{
    "pptName": "L4_Knauer-TDM",
    "slides": [
        "SLIDE #: 1 || ",
        "SLIDE #: 2 || Therapeutic Drug  Monitoring \n Clinical Biochemistry 3386b \n Michael Knauer PhD, FCACB  michael.knauer@lhsc.on.ca \n ",
        "SLIDE #: 3 || Therapeutic Drug Monitoring \n Objectives: \n TDM in the context of pharmacological principles \n The parameters involved in TDM \n The role of appropriate sampling in TDM \n Special case examples – particular applications in  TDM. \n ",
        "SLIDE #: 4 || Therapeutic Drug Monitoring \n What is it and Why is it Done? \n Therapeutic Drug Monitoring \n (TDM) refers to the  measurement of drug  concentrations in the blood  or plasma of a patient to  keep it within a target range. \n TDM provides information  about the adequacy of  dosing of the drug regimen  and the likelihood of toxicity  associated with the drug. \n TDM \n Dosing \n Toxicity \n Monitoring \n Things that affect tdm is dosing, compliance/monitoring (person is taking it or not), toxicity (taking too much) \n ",
        "SLIDE #: 5 || Which Drugs need TDM? \n Narrow Therapeutic Range \n Significant pharmacokinetic variability \n A reasonable relationship between plasma  concentrations and clinical effects; however the  pharmacological effect is hard to measure \n Medications prone to drug interactions \n Compliance issues or drugs prone to therapeutic  failure \n ",
        "SLIDE #: 6 || Why do Therapeutic Drug Monitoring  (TDM)? \n Narrow Therapeutic Range \n Drugs have therapeutic ranges \n Taking a drug orally is in this diagram  \n As you take it, concentration goes up peaks, and as eliminated it goes down \n Reaches blue in is the minimum therapeutic effect \n Once it goes below level of effect there is no pain relief  \n Toxic concentration is exceeding right \n More dangerous drugs have smaller therapeutic ranges – harder to keep drug level effective yet not toxic \n Most durgs tho, you don’t take once, you take repeatably \n The challenge is to keep the peak and trough in the therapeutic range in each successive dosing \n Dpeening on range, it could be hrader or easier to keep the drug in the safe zone \n ",
        "SLIDE #: 7 || Therapeutic Range with  Repeated Dosing \n Blue line is continuous infusion (IV) / red Is oral \n How constant influion would get you up in the range and keeps you in the correct range so you don’t have overdosing and eventually get to steady state concentration \n As long as noghting perturbes steady state that dose will keep you in the therapeutic range \n ",
        "SLIDE #: 8 || Why do Therapeutic Drug  Monitoring (TDM)? \n Variable  Pharmacokinetics \n What the body does to the drug \n Absorption \n Distribution \n Metabolism \n Elimination \n When you first take it you have to absorb it from GI tract \n Distrinbute it around body through venous system and get to site of action \n Metabolism – via liver and kidney to eliminate to more polar molecules or deactivate the drug to inactive metabolite (also some cases wehre you take inactive drug and activate in body) \n Eliminate is getting rid of it  \n ",
        "SLIDE #: 9 || Why do Therapeutic Drug  Monitoring (TDM)? \n Variable  Pharmacokinetics \n Not One Dose Fits All \n Levy \n BioDrugs, 2001 \n Inter-patient Variability in Cylosporine  Blood Levels in Renal Transplant Patients \n Diff people have diff pharmacokinetics \n Lines don’t overlap – peak happens at diff points for diff people \n Peak height (amount of absorption) different between people \n There is significant variability in terms of giving same drugs nad what happens after taking it  \n ",
        "SLIDE #: 10 || Pharmacokinetics – Fate of a Drug taken  Orally \n First Pass  Effect \n There are rate equations to monitor drugs when they come into body \n Take it, absorbed in small intestine, portal vein to liver which converts from parent molecule to metabolite, which is then excreted or sent to bile to be eliminated \n When you take a drug not all the drug gets into circulation; percentage gets eliminated before and bioavailability (amount of drug that makes it into systemic circulation – e.g. 70% bioavailability means 70% makes it to ciruclaiont  after liver– you can bypass this by IV which has 100% bioavailability) \n Drug parent and drug metabolite are in equilibrium with compartments – e.g. compartment could be fat store, muscle, or single organ \n Effect compartment is when drug ofi nterest and organ of interest (eg. Knee for knee pain); drug and metabolite would all distribute \n They can equilibrate back to centre compartment and this is where you can eliminate the drug (through kidney or liver by urine or feces) \n ",
        "SLIDE #: 11 || The effect of a single oral dose of a drug  on its concentration in serum/ plasma \n Example of a two compartment model \n Slow eliminatation  \n Modelled by two rate curces \n Drug distributing into tissues in the body (faster rate) \n Slower elimination rate – drug eliminated through urine or feces \n ",
        "SLIDE #: 12 || T1/2 (Elimination) Half  Life \n Time required for the concentration  of a drug to be reduced by half  (50%). \n Not all drugs are thes same for half life \n ",
        "SLIDE #: 13 || Half Lives - Examples \n Acetaminophen – \n 2 h \n Codeine – \n 3 h \n Theophylline – \n 8 h \n Carbamazepine – \n 15 h \n Lithium – \n 22 h \n Digoxin – \n 39 h \n (1.6 d) \n Sirolimus – \n 69 h \n (2.9 d) \n Phenobarbital – \n 99 h \n (4.1 d) \n Digoxin drug for heart \n Sirolimus immunosuppresent \n Phenobarbital antieppilypetic \n Not everyone has same half life \n ",
        "SLIDE #: 14 || The effect of multiple identical  doses on drug concentration \n Cmax & Cmin = maximum & minimum  concentrations \n C = average steady state concentration  MTC = minimum toxic concentration  MEC = minimum effective  concentration \n AUC = Area Under the Curve (a  measure of the exposure of the  patient to the drug) \n τ = dosing interval \n Minimul effective concentration is blue zone \n Middle is therapeutic range \n Each oral dosing gets you into therapeutic range and you hit your steady state \n Time between dosing is dosing interval - it is approximating half lfie of the drug (take it once a day if half life is 24 hours e.g.) \n AUC is area under curve – can tell you how well the drug is absorbed and how much exposure individual gets \n C trough – what happens right before next oral dose \n Mean is steady state concentration \n How long does it take to get to steady state? 5 half lives to get to stady state or 5 half lives to eliminate the drugs \n ",
        "SLIDE #: 15 || Effect of frequency of dosing \n Frequency and dosing amount to keep it in range? In this example you see: \n Infusion of drug at 28 mg/h – reaches steady state and is pretty consistent  \n Same drug at 224 mg/h (three times in a day – tid) orally, you can see effects as it peaks and troughs as it gets to theraptutic range – doesn’t matter what dosing you took it takes same amount of time to get into the range (5 half lives) \n Conveniemce is having to take the drug once a day \n Vurve has wider swings in peaks and troughs at higher concetration  \n For a narrow range, you want to avoid more swings so you have to lower does and increase dosing interval to keep swings smaller and keep it in thereapuetic range \n ",
        "SLIDE #: 16 || Loading doses \n If you can’t wait 5 half lives to get to therapeutic level in a drug so this is where loading doses come in \n Drugs wit hlong half life and you need effect rapidly (e.g. anticlotting drug) you want to give massive dose right off the bat (loading dose) and then maintance dose (smaller dose) to keep htem in the range \n ",
        "SLIDE #: 17 || Loading Dose -  Calculation \n C = 1.44 t1/2 D \n VdT \n Where C is the average drug concentration in plasma  Vd is the apparent volume of distribution \n t1/2 is the elimination half-life \n D is the maintenance dose for this drug conc’n  T is dosage interval (time between doses) \n Vd is where the theoretical space of where the drug goes in body – 5-6 L than the drug stays in blood volume, 1000 L then it stays in circulation and starts going into the tissue \n You can look up Vd is for a drug \n ",
        "SLIDE #: 18 || Loading Dose -  Calculation \n C = 1.44 t1/2 D \n VdT \n The total amount (weight) of drug in the body \n =\tCVd \n Therefore, the loading dose\tD*\t= CVd \n D*\t= CVd\t= 1.44 t1/2 D \n T \n ",
        "SLIDE #: 19 || Elimination Kinetics \n First Order  Kinetics and  the Rule of 5 \n o 50% \n o 25% \n o 12.5% \n o 6.25% \n o 3.1% (97% \n eliminated) \n Two ways drugs are eliminated – 0 order kinetics or 1st order kinetics \n 0 order kinetics is same amount of drug eliminated over time; 2 mg eliminated of drug per minute \n It is how alcohol is metabolized – you metabolzie same amount of alcohol in same amount of time  \n First order kinetics is wehre you metabolize same proportion of drugs per unit time \n 2% of drug metabolized per minute \n This matters when it comes to dosing - if you had something with first order kinetics it means it drops out of pocket range quicker than 0 order kinetics (which takes longer for it to come down from toxic rnage) \n Most drugs behave in 1st order \n First half life – 50% of drug remaining \n Second half life – 25% drug left \n 5th – drug essentially eliminated \n ",
        "SLIDE #: 20 || The Clinical Need\tfor  TDM \n Compliance \n (forgetfulness, etc.) \n Titration of optimal dosage \n Variation in drug metabolic rates (genetics, other drugs) \n Presence of disease (eg. renal, hepatic) \n Altered physiological states (youth, age, pregnancy) \n Overdose \n Identification and quantitation \n Children’s enzyme system don’t prform same way as adults \n Pregnancy can cause internal changes to blood volume, binding proteiins in blood etc.  \n To try and identify if someone overdosed or how much of an overdose they have \n ",
        "SLIDE #: 21 || Classical Criteria for Determining  the Necessity for TDM of a Drug \n Narrow but reasonably well defined  therapeutic range \n Poor correlation between dosage and serum  concentration \n Good correlation between serum  concentration and therapeutic effect \n Therapeutic effect which is hard to measure \n Specific, accurate, and reproducible  method \n ",
        "SLIDE #: 22 || When to sample? \n At steady-state \n Trough \n -Just before the next dose is given (e.g. one half-life after \n the last dose) \n When toxicity is suspected \n Timed sampling following a dose \n Used to estimate AUC \n Eg C2 for ISD \n Random (last resort) \n Overdose (accidental or deliberate) \n Patient non-compliance (last dose unknown) \n Trough is best time to take it for oral dosing \n Time to catch peak and trough \n Curve estimation is exposure individual gets from the drug \n Only do random during overdose and maybe used to determine drastic measures you may have to take or when you don’t know when they took the drug \n ",
        "SLIDE #: 23 || Examples of Trough Measured Drugs (FYI): \n Core Lab: \n valproic acid, carbamazepine,  lithium, phenytoin, phenobarbital,  vancomycin \n Specialty Lab:\tlamotrigine, gabapentin, topiramate,  clobazam, clonazepam, clozapine, risperidone,  haloperidol, olanzapine, nitrazepam, amiodarone \n Measure drug in core and speciality labs \n Depends on method where the drug measruements go \n Drugs with servious consequences in core labs because of fast turnaround time e.g. epileptics, antibiotics \n Speciality labs because you need selectivity to determine parent/metabolite or if drug you can’t do in core \n ",
        "SLIDE #: 24 || Free Drug Monitoring \n Free drug monitoring \n Its not just drug and metabolite, but drug, free drug, drug bound to protein, and then metabolite that you have to consider \n Protein bound drug is normally albumin or positively charged drug, and alphaone/glycoprotein for negatively charged drug \n In some cases, measuring free amount is better for concentraiotn/effect than total amount (which is free + protein bound) \n ",
        "SLIDE #: 25 || Criteria for Free Drug Monitoring \n TDM is necessary \n Drug highly (> 70%) bound to plasma proteins  Free drug level correlates poorly with total drug \n concentrations \n Also when balance of bound to not can be disturbed negatively for e.g. if you take another drug or changing free fatty acids present (depends on the drug) or changing plasma protein concetraions (if someone is becoming malnourished) \n ",
        "SLIDE #: 26 || Free Drug Monitoring \n Co-administered highly bound drugs \n Elevated free fatty acids \n Changes in plasma protein concentration \n ",
        "SLIDE #: 27 || Factors affecting Albumin  Concentration \n Decreased \n Malnutrition  Renal Disease  Malabsorption \n Protein-losing Enteropathy  Hepatic Disease \n Burns \n Tissue Damage \n Inflammation \n Increased \n Dehydration  Cancer \n Renal – less protein in blood therefore less binding capacity \n Protein-losing Enteropathy \n Losing protein through gut  \n Hepatic Disease \n Not produring proteins \n Burns  - disturbances in protein \n ^^ all these things increase free drug and lower albumin (protein) \n ",
        "SLIDE #: 28 || Free Drug Monitoring \n The anticonvulsant drugs, phenytoin, and valproic  acid historically are the only drugs for which free  drug monitoring has been done routinely. \n Free drug is better for these than total drug  \n There are total drug assays available for these in the core lab quickly; specialized lab does free from bound drug  \n ",
        "SLIDE #: 29 || TDM Case Examples \n ",
        "SLIDE #: 30 || Therapeutic Drug Monitoring of  Immunosuppressant Therapy: Balancing  Efficacy and Toxicity \n ",
        "SLIDE #: 31 || Transplantation: a treatment for end-stage organ failure \n KIDNEY \n LIVER \n LUNG\tHEART \n PANCREAS \n Primary Cause*:  Diabetes 27.5% \n Hypertension 25.9% \n Glomerulonephritis 16.8% \n Other 18.5% \n Cystic Kidney 11.2% \n * adults in the US, 2011 \n Scientific Registry of Transplant Recipients \n Primary Cause*:  DM type I\t85.3%  DM type II\t\t6.1%  Other/unk\t\t 7.8% \n DM type unk. 0.9% \n Primary Cause*: \n HCV\t23.5% \n Other/unknown 22.3% \n Malignancy\t20.9% \n Alcoholic liver\t17.6% \n Cholestatic\t9.1% \n Acute hepatic necrosis 4.0%  Metabolic liver disease 2.5% \n INTESTINE \n Primary Cause*:  Other SGS\t58.1% \n Necrotizing EC 12.4% \n Other\t12.4% \n Congen. SGS\t10.9% \n Pseudo-obstruc 6.2% \n Primary Cause*:  Cardiomyopathy 54.4% \n Coronary Artery 37.9% \n Congenital dis.\t3.6% \n Other/unknown\t2.7% \n Valvular disease  1.4% \n Primary Cause*:  Restrictive lung dis.\t49.1%  Obstructive lung dis. 32.0% \n CF or immunodef. 14.1%  Pulmonary vasc. dis. 4.4%  Other/unknown\t0.4% \n You reject organs due to immune systems  \n T celsl look for markers outside cells that detect foreign things and they try to eliminate \n In transplantation, you try to get markers as close to recipient as possible \n Therefore you suppress immune sysmte so they don’t recognize transplant organ as foreign and don’t try to get rid of it  \n ",
        "SLIDE #: 32 || Organ Transplantation in Ontario \n Statistics from Trillium Gift of Life \n ",
        "SLIDE #: 33 || Organ Rejection \n ",
        "SLIDE #: 34 || Transplant Rejection and  the\tImmune System \n ",
        "SLIDE #: 35 || Solution – \n Immunosuppression \n Immunosuppressants are a class of drugs that suppress or reduce the  strength of the body’s immune system, attempting to stop the  immune system from reacting to the transplanted organ. \n They all have different mechanisms of action in terms of getting t cell to recognize antigens  \n ",
        "SLIDE #: 36 || Mechanism\tof Action \n Nature Clinical Practice Cardiovascular Medicine (2006) 3, 203-212 \n Don’t need to know pathway but various parts you can block with immunosuppresents \n ",
        "SLIDE #: 37 || Cyclosporine A \n Used as a first-line  immunosuppressant \n Revolutionized field of  organ transplantation,  dramatically reducing  acute rejection rates \n Cyclic peptide of 11  amino acids from the  fungus Tolypocladium  inflatum \n Inhibits calcineurin  through cyclophilin to  block NFAT-mediated  transcription of IL-2 \n Really big, complex structure \n ",
        "SLIDE #: 38 || Tacrolimus \n 23-membered macrocyclic  lactone from bacterium  Streptomyces tsukubaensis \n Blocks production of IL-2  (cytokine) and activation of  immune system \n Calcineurin inhibitor 100x more  potent than cyclosporine \n Longer half-life than \n cyclosporine \n Trials comparing tacrolimus  and cyclosporine indicated a  reduced risk of acute  rejection with tacrolimus \n Currently, predominant first-  line immunosuppressant drug  used, particularly in the US \n Blocks fat activation as well \n This is now drug of choice for organ transplantation \n ",
        "SLIDE #: 39 || Sirolimus \n Macrolide antibiotic  structurally related to  tacrolimus \n Isolated from a bacterium \n discovered on Easter Island \n Binds FKBP12 and the  complex inhibits mTOR and  blocks signaling  downstream of IL-2 \n Inhibits IL-2-mediated  activation of T and B cells \n Used in place of and in  combination with  cyclosporine and  tacrolimus \n ",
        "SLIDE #: 40 || Immunosuppressive Drug  Regimens \n Low Risk \n First time  transplant  recipient \n <20% panel  reactive  antibodies \n Intermediate  Risk \n 20-80% panel  reactive  antibodies \n High Risk \n Rejected one  or more  transplants \n >80% panel  reactive  antibodies \n Therapy is based on the transplant recipient’s \n immunological risk and donor factors \n Intensity of \n Immunosuppression Therapy \n Determine risk of individual for rejection \n Low risk you may give them one immunosuppresent \n Intermediate or poor risk \n Use more intensive immunotherapy e.g. two drugs \n Might possible interact with each other \n ",
        "SLIDE #: 41 || Immunosuppressive  Drug Regimens \n Type of Organ Transplant \n Patient age (adults vs. children) \n Co-medications or patient conditions \n Initial therapy versus long-term maintenance \n Typical initial and long-term maintenance regimens  use a combination of medications including \n calcineurin inhibitor (tacrolimus or cyclosporine) \n antiproliferative agent (mycophenolic acid or  azathioprine) \n with or without corticosteroids \n How you choose depends on four 4 points on slide \n Initial therapy – hit immune system hard at first \n Long-term – if you want to sustain it long time  \n ",
        "SLIDE #: 42 || Balancing Efficacy and  Toxicity \n • \n • \n Sub-therapeutic drug levels increase the risk of  acute organ rejection \n Immunosuppressive drugs used in organ transplant \n have toxicities \n Dose dependent nephrotoxicity  Increased risk of infection \n KDIGO Clinical Practice Guideline for the \n care of kidney transplant recipients 2009 \n Balance which drugs you give for therapy/efficacy and toxicity  \n Concentraions used to make sure you are not at risk for losing organ \n ",
        "SLIDE #: 43 || Therapeutic Ranges for  Immunosuppressant Drugs \n (trough concentration) \n Drug \n Time \n Kidney \n Liver \n Heart or Lung \n Cylcosporine  C0 (C2) \n (ng/mL) \n Initiation  Maintenance \n 150-250 (>1200) \n 75-150 (800) \n 250-350 (>1000) \n 100-200 (600) \n 250-350 150- \n 250 \n Tacrolimus  (ng/mL) \n Initiation  Maintenance  Minimizatio  n \n 10-15 \n 5-10 \n 3-7 \n 10-20 \n 5-10 \n - \n 15-20 \n 5-10 \n - \n Sirolimus  (ng/mL) \n Initiation  Maintenance \n 5-15 \n - \n - \n Everolimus \n (ng/mL) \n Initiation \n Maintenance \n 5-15 \n 3-8 \n - \n 3-8,3-12 \n Current Trends in Transplantation. 2009 \n High level – intiation for the suppression \n Maintenace dose is lwoer \n ",
        "SLIDE #: 44 || Variable  Pharmacokinetics \n Not One Dose Fits All \n Why do Therapeutic Drug  Monitoring (TDM)? \n Levy \n BioDrugs, 2001 \n Inter-patient Variability in Cylosporine  Blood Levels in Renal Transplant Patients \n Someone on it  \n ",
        "SLIDE #: 45 || Drug-Drug\tInteractions \n Immunosuppressant  drugs are heavily  metabolized by the  cytochrome P450  system \n Potential for drug-drug  interactions that may  produce toxicity or  dangerously low levels  of immunosuppression \n Leads to an increased \n risk of acute rejection \n Ghanta et al., Overview of Immuno-  suppression in Renal Transplantation, 2013 \n Some one on it should be wary of starting new drugs – could produce toxicity or non-effect of immunosuppesent \n ",
        "SLIDE #: 46 || When should TDM be done  for Immunosuppressants? \n KDIGO Clinical Practice Guideline for the \n care of kidney transplant recipients 2009 \n Recommendations on how often you should measure these drugs \n ",
        "SLIDE #: 47 || How are Immunosuppressants  Measured? \n Methods \n Immunoassays \n CMIA (chemiluminescent  microparticle  immunoassays) (Abbott) \n Exhibit cross-reactivity with  drug metabolites that may  falsely raise values \n Competitive assay design \n LC-MS/MS \n Able to distinguish  metabolites from the  parent drug \n Multiplex Analysis -measure \n multiple analytes in one run \n Sample: Whole blood  for cyclosporine,  tacrolimus and sirolimus \n Site of Action \n Distribution in blood: \n Cyclosporine \n 41-58% RBCs, 33-47% \n plasma \n Tacrolimus \n 80% RBCs, 20% plasma \n Sirolimus \n 95% RBCs, 3% plasma, 2%  other cellular \n ",
        "SLIDE #: 48 || Summary \n Immunosuppression is necessary to reduce the risk  of transplant rejection \n Immunosuppressant Drugs have narrow therapeutic \n ranges \n Variable Pharmacokinetics makes dosing  challenging requiring many dose adjustments \n Therapeutic Drug Monitoring for  Immunosuppressants is used to ensure efficacy,  reducing transplant rejection, while avoiding  toxicity \n ",
        "SLIDE #: 49 || Therapeutic Drug  Monitoring of Antiepileptic  Drugs \n ",
        "SLIDE #: 50 || Epilepsy - Overview \n Epilepsy is a central nervous system disorder (neurological  disorder) in which nerve cell activity in the brain becomes  disrupted, causing seizures or periods of unusual behaviour,  sensations and sometimes loss of consciousness. \n Seizure symptoms can vary widely. \n From a simply blank stare for a few seconds to repeated twitching of arms or legs. \n About 1 in 26 people in the United States will develop a  seizure disorder. \n Nearly 10% of individuals may have a single unprovoked seizure. \n However, a single seizure doesn't mean you have epilepsy. At least two unprovoked  seizures are generally required for an epilepsy diagnosis. \n Even mild seizures may require treatment because they can  be dangerous during activities such as driving or swimming. \n Treatment with medications or surgery is ~80% effective \n Children with epilepsy may also outgrow their condition with \n age. \n ",
        "SLIDE #: 51 || Symptoms \n Epilepsy is caused by abnormal activity in brain cells \n can affect any process your brain coordinates. \n Seizure signs and symptoms may include: \n Temporary confusion \n A staring spell \n Uncontrollable jerking movements of the arms and legs \n Loss of consciousness or awareness \n Psychic symptoms \n Generally classify seizures as either focal or  generalized, based on how the abnormal brain  activity begins. \n ",
        "SLIDE #: 52 || Focal Seizures \n When seizures appear to result from abnormal activity in  just one area of your brain, they're called focal (partial)  seizures. \n Focal seizures without loss of consciousness (simple \n partial seizures). \n These seizures don't cause a loss of consciousness. They may alter emotions or  change the way things look, smell, feel, taste or sound. They may also result in  involuntary jerking of a body part, such as an arm or leg, and spontaneous  sensory symptoms such as tingling, dizziness and flashing lights. \n Focal dyscognitive seizures (complex partial seizures). \n These seizures involve a change or loss of consciousness or awareness. During  a complex partial seizure, you may stare into space and not respond normally  to your environment or perform repetitive movements, such as hand rubbing,  chewing, swallowing or walking in circles. \n Symptoms may be confused with other neurological  disorders, such as migraine, narcolepsy or mental illness. \n ",
        "SLIDE #: 53 || Generalized Seizures \n o \n Seizures that appear to involve all areas of the brain are called  generalized seizures. \n 1.\tAbsence seizures. (previously known as petit mal seizures) \n often occur in children and are characterized by staring into space or subtle body movements \n o \n o \n o \n o \n o \n such as eye blinking or lip smacking. These seizures may occur in clusters and cause a brief loss \n of awareness. \n Tonic seizures. \n Tonic seizures cause stiffening of your muscles and may cause you to fall to the ground. \n Atonic seizures. \n Also known as drop seizures, cause a loss of muscle control, which may cause you to suddenly \n collapse or fall down. \n Clonic seizures. \n Associated with repeated or rhythmic, jerking muscle movements. \n Myoclonic seizures. \n Usually appear as sudden brief jerks or twitches of your arms and legs. \n Tonic-clonic seizures. (previously known as grand mal seizures,) \n The most dramatic type of epileptic seizure and can cause an abrupt loss of consciousness,  body stiffening and shaking, and sometimes loss of bladder control or biting your tongue. \n ",
        "SLIDE #: 54 || Risk factors \n Age. \n o most common during early childhood and after age 60 \n Family history. \n Head injuries. \n Stroke and other vascular diseases. \n Dementia. \n Brain infections. \n Seizures in childhood. \n ",
        "SLIDE #: 55 || Causes \n Epilepsy has no identifiable cause in about half of those  with the condition. \n Genetic influence. \n It's estimated that up to 500 genes could be tied to the condition. Certain  genes may make a person more sensitive to environmental conditions that  trigger seizures. \n Head trauma. \n Car accident or other traumatic injury \n Brain conditions. \n Brain conditions that cause damage to the brain, such as brain tumours or  strokes, \n Stroke is a leading cause of epilepsy in adults older than age 35. \n Infectious diseases. \n Meningitis, AIDS and viral encephalitis \n Prenatal injury. \n Infection in the mother, poor nutrition or oxygen deficiencies. \n Developmental disorders. \n Can sometimes be associated with developmental disorders, such as autism  and neurofibromatosis. \n ",
        "SLIDE #: 56 || Antiepileptic Drugs  (AED) \n Antiepileptic Drugs (AEDs)  are used to treat seizure  disorders \n First generation of AEDs  were introduced many  decades ago \n o\tcarbamazepine, ethosuximide,  phenobarbital, phenytoin and  primidone, and valproic acid \n In the last 20 years, there  has been a surge of new  generation AEDs entering  the market \n Ther Drug Monit 2013;35:4–29) \n ",
        "SLIDE #: 57 || Mechanism of Action of  AEDs \n Limit the sustained, repetitive firing of neurons, an  effect mediated by promoting the inactivated  state of voltage-activated Na+ channels. \n Enhanced γ-aminobutyric acid (GABA)–mediated  synaptic inhibition, an effect mediated either by a  presynaptic or postsynaptic action. \n o\tDrugs effective against the most common forms of epileptic seizures,  partial and secondarily generalized tonic-clonic seizures, appear to  work by one of these two mechanisms. \n Inhibition of voltage-activated Ca2+ channels  responsible for T-type Ca2+ currents. \n o\tDrugs effective against absence seizures, less common form \n Goodman and Gilman. 12 Ed \n ",
        "SLIDE #: 58 || Mechanism of Action of  AEDs \n Mayo Clin Proc. 2012;87(9):879-889 \n ",
        "SLIDE #: 59 || Mechanism of Action of  AEDs \n Mayo Clin Proc. 2012;87(9):879-889 \n ",
        "SLIDE #: 60 || Goodman and Gilman. 12 Ed \n ",
        "SLIDE #: 61 || AEDs in the Clinical  Laboratory \n AEDs are among the most common medications for  which clinical laboratories perform therapeutic drug  monitoring (TDM) \n TDM quickly became part of clinical practice  because \n AEDs have complicated pharmacokinetics (ADME), \n narrow therapeutic ranges \n significant differences in individual’s therapeutic dosages \n ",
        "SLIDE #: 62 || Why do Therapeutic Drug  Monitoring (TDM)? \n Toxicity \n diagnosing toxicity \n avoiding toxicity \n Dosing \n after dose adjustment (usually after reaching a steady state) \n assessment of adequate loading dose (after starting phenytoin  treatment) \n help predict a patient's dose requirements1 \n Monitoring \n assessing compliance (anticonvulsant concentrations in patients having  frequent seizures) \n diagnosing under treatment (particularly important for prophylactic \n drugs such as anticonvulsants, immunosuppressants) \n diagnosing failed therapy (therapeutic drug monitoring can help  distinguish between ineffective drug treatment, non-compliance and  adverse effects that mimic the underlying disease). \n ",
        "SLIDE #: 63 || Which drugs need TDM? \n Narrow target range \n Significant  pharmacokinetic  variability \n A reasonable  relationship between  plasma concentrations  and clinical effects \n Established target  concentration range \n ",
        "SLIDE #: 64 || TDM Challenges with  AEDs \n Diagnosis is very difficult since seizures are  unpredictable and occur irregularly \n There is no simple diagnostic test to assess the  clinical efficacy \n Clinical assessment depends on careful  clinical observation and labour intensive EEG \n Clinical signs and symptoms of toxicity are  subtle or difficult to differentiate form the  disorder \n ",
        "SLIDE #: 65 || ",
        "SLIDE #: 66 || ",
        "SLIDE #: 67 || Indications for Monitoring Serum  AED concentrations - ILAE \n After initiation of treatment or after dose adjustment,  when the clinician decides to aim at a preselected target  concentration for that patient. \n Once the desired clinical response has been achieved,  to establish the “individual therapeutic range.” \n To assist the clinician in determining the magnitude of a  dose increase, particularly with AEDs showing dose-  dependent pharmacokinetics (most notably, phenytoin). \n When there are uncertainties in the differential diagnosis  of signs or symptoms suggestive of concentration-related  AED toxicity, or when toxicity is difficult to assess clinically  (for example, in young children or in patients with mental  disability). \n Epilepsia, 49(7):1239–1276, 2008 \n ",
        "SLIDE #: 68 || Indications for Monitoring Serum  AED concentrations - ILAE \n When seizures persist despite an apparently  adequate dosage. \n When an alteration in pharmacokinetics (and,  consequently, dose requirements) is suspected, due to  age-related factors, pregnancy, associated disease,  or drug-drug interactions. \n To assess potential changes in steady state AED  concentration when a change in drug formulation is  made, including switches involving generic  formulations. \n Whenever there is an unexpected change in \n clinical response. \n When poor compliance is suspected. \n Epilepsia, 49(7):1239–1276, 2008 \n ",
        "SLIDE #: 69 || AEDs in Children \n o  o \n AED PK is markedly influenced by age especially during  infancy and childhood \n Shorter half-lives, and larger Vd compared with adults  Dosages may be 2-3x higher than adults \n Reference range information is almost exclusively from  adult studies and there is little information about pediatrics \n PK interactions cause substantial changes in drug  concentrations. They are likely to occur in children too, but  the extent of the interactions may be different \n Studies have demonstrated that different types of seizures  respond to different serum concentrations. Childhood  seizures may be different types versus adult seizures \n AEDs may have long term adverse effects on the immature \n brain that do not occur in the mature brain \n Epilepsia, 49(7):1239–1276, 2008 \n ",
        "SLIDE #: 70 || AEDs in Pregnancy \n Maternal serum concentrations not only reflect the  concentrations that determine therapeutic effect and  adverse effects but also the extent of drug exposure to  the fetus \n PK of many AEDs is affected by many important \n changes during pregnancy \n Body weight \n Altered serum composition \n Hemodynamic alterations \n Hormonal changes \n Drug distribution changes due to fetoplacental unit \n Pregnancy-associated PK changes have been  reasonably characterized for the older generation AEDs \n TDM is recommended during pregnancy at increased \n frequency \n Epilepsia, 49(7):1239–1276, 2008 \n ",
        "SLIDE #: 71 || AEDs in Elderly \n TDM may be particularly helpful in guiding AED  therapy in elderly patients. \n Greater morbidity \n Poor medication compliance \n Variable age-related changes in pharmacodynamics and  pharmacokinetics \n Increased likelihood of drug interactions affect the safety and efficacy of  both AEDs and co-medications \n Epilepsia, 49(7):1239–1276, 2008 \n ",
        "SLIDE #: 72 || AED Formulation Changes  and Generic Substitution \n When an AED formulation is changed, e.g., when  switching to/from generic formulations, measuring the  serum concentration of the AED before and after the  change may help in identifying potential alterations in  steady-state drug concentrations resulting from  differences in bioavailability \n \tWhen patients are switched to a formulation with  modified-release characteristics (for example, from an  immediate-release to a sustained-release formulations),  or when dosing schedule is changed (for example, from  twice daily to once daily administration), interpretation  of TDM data should also take into account the expected  variation in diurnal drug concentration profile \n Epilepsia, 49(7):1239–1276, 2008 \n ",
        "SLIDE #: 73 || AED Formulation Changes  and Generic Substitution \n \tA 2006 Survey by the American Academy of  Neurology found that seizures worsened in 59% of  individuals switched from brand-name to generic  AEDs \n Liow K, Barkley GL, Pollard JR. Position statement on the coverage of anticonvulsant drugs for the  treatment of epilepsy. Neurology. 2007;68(16):1249-1250. \n Krauss et al studied differences between 595 pairs  of generic AED formulations, estimated AUC varied  by more than 15% for 17% of pairs, and an  estimated Cmax differed by more than 15% for 39%. \n The AEDs with low bioavailability and solubility, such as oxcarbazepine,  had the greatest variability. \n Krauss GL, Caffo B, Chang YT, Hendrix CW, Chuang K. Assessing bioequivalence of generic  antiepilepsy drugs. Ann Neurol. 2011;70(2):221-228. \n ",
        "SLIDE #: 74 || Carbamazepine \n First line treatment in partial and secondarily generalized  tonic– clonic seizures and primary generalized tonic– clonic  seizures \n Voltage gated Na channel modulator \n Absorption is relatively slow, erratic, variable, and formulation \n dependent \n Undergoes extensive metabolism with less that 2% of an oral  dose excreted unchanged in the urine \n Metabolism by primarily cytochrome P450 (CYP) 3A4, to pharmacologically active  carbamazepine-10–11-epoxide \n Inactivated by epoxide hydrolase to 10, 11 - diol \n Many possible drug interactions \n Carbamazepine undergoes autoinduction so that clearance  can increase threefold within several weeks of starting therapy \n During maintenance carbamazepine monotherapy, adults  have half-lives of 8–20 h whereas in children 10–13 years of  age half-lives are 10–14 h \n ",
        "SLIDE #: 75 || Carbamazepine \n Seizure control is most likely to occur between 4 and  12 mg/L (17–51 μ mol/L) \n There is substantial overlap between  carbamazepine concentrations associated with  seizure control and those associated with toxicity \n Unpredictable relationship between dose and  carbamazepine concentration, its narrow  therapeutic index, and the presence of numerous  clinically significant drug interactions support the  need to individualize and maintain therapy using  TDM \n ",
        "SLIDE #: 76 || Lamotrigine \n Voltage gated Na channel modulator and Ca Channel  blocker \n Rapid and complete absorption form GI tract \n Extensive metabolism to an inactive glucuronide \n metabolite via\tUGT1A4, \n Autoinduction phenomenon occurs with in 2 weeks,  resulting in 17% reduction in serum concentrations \n prone to drug interactions \n Clearance is higher in children than adults \n Clearance can be increased up to 300% in pregnancy \n No clear-cut relationship exists between clinical response  and serum lamotrigine concentrations; however, toxicity  increases significantly with concentration >15 mg/L ( >58  μmol/L) \n ",
        "SLIDE #: 77 || Phenytoin \n Voltage gated Na channel modulator \n Complex pharmacokinetics due to variable absorption,  high protein binding, saturable metabolism, and drug  interactions \n Extensive metabolism by CYP2C9 and CYP2C19 to  inactive metabolite \n Serum elimination half-life of phenytoin in adults is 30– 100 \n hours \n Elimination follows nonlinear kinetics \n Metabolism decreases with increasing dosages \n Increasing dose can lead to disproportionately large increments in serum  concentrations \n Many interactions with other medications via metabolism \n and serum protein binding interactions \n Reference range of 10–20 mg/L (40–79 μ mol/L) \n Often Free Drug levels are measured for TDM \n ",
        "SLIDE #: 78 || Valproic Acid \n Voltage gated Na channel modulator and Ca Channel  blocker \n Almost 100% bioavailability in all formulations \n Food delays absorption but not extent \n Serum protein binding decreases with increasing  concentration \n Free concentration increases in pregnancy, elderly, renal  disease, liver disease and conditions associated with low  albumin \n Often Free Drug levels are measured for TDM \n Pharmacokinetics deviate from linearity due to changes  in serum protein binding \n Children require higher dosages to achieve comparable \n plasma levels with adults \n Unpredictable relationship between dose and valproic  acid concentration supports the use of TDM \n ",
        "SLIDE #: 79 || Matthew D. Krasowski, JUN.1.2013 Clinical Laboratory News \n ",
        "SLIDE #: 80 || Conclusion - Why to  measure AEDs \n Establish an individual therapeutic concentration \n As an aid in the diagnosis of clinical toxicity \n To assess compliance, particularly in patients with \n uncontrolled seizures or breakthrough seizures; \n To guide dosage adjustment in situations  associated with increased pharmacokinetic  variability (e.g., children, the elderly, patients with  associated diseases, drug formulation changes); \n When a potentially important pharmacokinetic  change is anticipated (e.g., in pregnancy, or when  an interacting drug is added or removed); \n To guide dose adjustments for AEDs with dose-  dependent pharmacokinetics, particularly  phenytoin. \n ",
        "SLIDE #: 81 || Conclusions \n TDM has been used as a tool to optimize treatment  of epilepsy for almost 50 years. \n Although solid evidence for its usefulness in  improving clinical outcome is scarce, TDM  continues to play a role in epilepsy management,  partly due to the nature of the condition and partly  because of the pharmacokinetic variability of AEDs. \n The evidence for a universal drug concentration-  effect interrelationships is less than satisfactory  highlighting the need for an “individual therapeutic  concentration” \n ",
        "SLIDE #: 82 || Other Drugs \n ",
        "SLIDE #: 83 || Digoxin \n Purpose: antiarrhythmic \n Therapeutic range: 1.0 - 2.7 nmol/L \n Digoxin has a narrow therapeutic range \n Toxic symptoms are similar to sub-therapeutic symptoms  (arrhythmia). \n ",
        "SLIDE #: 84 || Digoxin \n There is marked overlap of serum digoxin levels between  those that are toxic and\tthose that aren’t. \n At steady state the concentration of digoxin in cardiac tissue is  15-30 times that of serum. \n ",
        "SLIDE #: 85 || Digoxin \n Accumulation of digoxin in tissue lags behind serum  concentrations. \n While the peak serum concentration is reached 2-3 h after the  oral dose, the peak tissue concentration occurs 6-10 h after an  oral dose. \n ",
        "SLIDE #: 86 || Digoxin \n Therapeutic range is determined at the time of peak tissue \n concentration. \n The appropriate time to collect the specimen is 8 h or more  after the last dose \n (e.g. bedtime dose, specimen collection in morning) \n ",
        "SLIDE #: 87 || Digoxin \n Digoxin toxicity develops more frequently and lasts longer in  patients with renal impairment. \n Dosage requirements are decreased in patients with renal  disease. \n ",
        "SLIDE #: 88 || Aminoglycosides \n Purpose:\tiv antibiotics \n Tobramycin \n Gentamicin \n ",
        "SLIDE #: 89 || Aminoglycosides \n Purpose:\tiv antibiotic \n Used for the treatment of aerobic gram-negative bacterial \n infections \n Main objective is the maintenance of drug concentrations high \n enough to consistently achieve antibacterial activity. \n ",
        "SLIDE #: 90 || Aminoglycosides \n Elimination rates vary widely among patients, even those with  normal renal function. \n Ototoxicity and nephtrotoxicity are associated with both  excessive peak and trough aminoglycoside concentrations. \n ",
        "SLIDE #: 91 || Aminoglycosides \n Susceptibility to toxicity varies widely from one patient to  another. \n Because both peak and trough concentrations are important,  therapeutic ranges have been established for both of these  parameters. \n ",
        "SLIDE #: 92 || Aminoglycosides \n Sampling for trough measurements is done  just before the next dose (pre-dose). \n Peak (post-dose) serum sampling has to be done after the  distribution phase is completed. \n ",
        "SLIDE #: 93 || Aminoglycosides \n In most patients, sampling for the peak concentration should be  done 15-30 min after the end of the infusion (post-dose) \n in renally impaired or morbidly obese patients, sampling should  be done 30-60 min after infusion. \n ",
        "SLIDE #: 94 || Thank You \n "
    ]
}