{
    "pptName": "L5_Knauer-Toxicology",
    "slides": [
        "SLIDE #: 1 || Toxicology \n Clinical Biochemistry 3386b \n Michael Knauer PhD, FCACB \n michael.knauer@lhsc.on.ca \n ",
        "SLIDE #: 2 || Learning Objectives \u000bfor this Section: \n Understand the purpose and clinical context of toxicology. \n Learn the different clinical samples typically tested. \n Learn about the variety of drugs and poisons that are tested \n Understand the screen and confirmation tests and their purposes. \n ",
        "SLIDE #: 3 || Toxicology \n Purpose of Toxicology Testing: \n To detect, identify, and possibly measure, in various biological fluids, drugs and poisons which may or may not be suspected to be present. \n Substance could be illicit or prescribed  \n ",
        "SLIDE #: 4 || Patients \n Emergency \n Babies and new mothers \n Psychiatric \n Pain Clinic \n Sexual Assault Centre \n Inpatients (ICU) \n who do we look at for testing? \n - most come from emergency departments where patients come in and you look for drug abuse \n - new mothers and babies sometiems tested for illicit drug use for CAS cases \n - psychiatric for compliance or illicit drug use \n - pain clinics do compliance testing to see if they are compliant with pain medication to renew prescription adn they are taking they are taking it and not supplmenting it with anything \n - sexual assault cases  \n - ICU if they came in from motor vehicle c \n ",
        "SLIDE #: 5 || Analytical Approaches \n  Tests for specific drugs/poisons (e.g. drugs of abuse) when clinical  information points directly to them \n General analyses for any or all drugs/ poisons when information on the case is limited \n first is direct testing - test  for specific drug \n second to see classes of drugs they've been on or broad panel like mass spec to look at 100s  \n ",
        "SLIDE #: 6 || Interpretation of Analyses Serum/Plasma: \n Specimen of choice to measure drug levels \n Can measure level of intoxication \n Contains parent drugs and some metabolites \n Analysis rather involved because of complex matrix including large amounts of lipid and protein present \n Drugs can be present in low concentration \n main sample type is serum/plasma if you want to measure drug levels in patient \n - can tell you about intoxication or impact of having drug in system \n - more complex matrix and harder to test for because of lots of serum proteins and lipids in the sample \n - requires more sensitive technology like liquid chromatography or mass spec because drugs are often present in low concentrations \n ",
        "SLIDE #: 7 || Interpretation of Analyses - Urine \n Indicates exposure (what drugs taken) but exact timeline of when the compound was ingested \n Cannot measure level of intoxication \n Contains mostly drug metabolites (sometimes parent drug) \n Less complex matrix results in simpler analysis due to very small amounts of lipid and protein present \n the more common sample type is urine - this is because the question is usually 'what did the person take' rather than how much they took \n - doesn't tell you much about amount taken or when they took it (doesn't tell you a lot about intoxication) \n - most cases you only detect drug metabolites \n - it's a simpler matrix - less protein and fat - therefore easier to measure drug of interest \n ",
        "SLIDE #: 8 || Interpretation of Analyses – \u000bGastric Fluid \n relatively infrequently requested \n  invasive specimen \n no advantage over serum or urine \n another fluid type that could be tested is gastric fluid  \n - this is very rarely tested because so invasive to retreive and not a lot of advantage  \n - e.g. known ingestion or found inconscious with empty pill bottle and it is thought they consumed 100s of pills \n ",
        "SLIDE #: 9 || Interpretation of Analyses  - Hair and Meconium \n These testing matrices are used to determine long term exposure to drugs \n Hair testing can be used to identify a timeline for drug abuse or compliance. (e.g. was this a one-time exposure or has there been chronic exposure) \n Meconium tests are requested in neonates when there is concern regarding long term exposure to drugs in utero. \n Not clinically useful for acute management – TAT is too long – weeks \n Usually only requested by CAS \n another sample type is hair and meconium (first stool formed in baby ~ black stool that baby has) \n - both are good matrices for long term exposure to drugs \n - hair testing can be used as a timeline - closer to scalp = more recent drug use \n - meconium testing is done on neonates and often when it is during concern regarding exposure in utero (medications or drug of abuse mom consumed during pregnancy) \n - tests are only done by specialized labs \n ",
        "SLIDE #: 10 || Types of Drugs /Poisons \n 1. Alcohols (ethanol, methanol, isopropanol and acetone, ethylene glycol) \n 2. Drugs of Abuse (cannabinoids, opiates, cocaine, amphetamines, phencyclidine [PCP]) \n 3. Over-the-counter Drugs (salicylate, acetaminophen, pseudoephedrine, diphenhydramine) \n 4. Prescription Drugs (antidepressants, benzodiazepines, barbiturates) \n 5. Sexual assault drugs (gammahydroxybutyrate, flunitrazepam, ketamine) \n 6. Heavy Metals (Pb, As, Hg) \n 2. can be street drugs or pharmaceutical drugs \n ",
        "SLIDE #: 11 || Ethanol \n one of the most requested tox tests \n automated, fast, convenient \n based on alcohol dehydrogenase \n specific for ethanol only \n if someone presents to ER with all signs of intoxication but they don't have ethanol \n ",
        "SLIDE #: 12 || Toxic Volatile Alcohols \n Methanol    (windshield washer fluid, gas line antifreeze) \n Isopropanol    (rubbing alcohol) \n Acetone   (metabolite of isopropanol) \n then you look at toxic volatile alcohols to see if they consumed these instead of ethanol  \n ",
        "SLIDE #: 13 || Glycols \n Ethylene glycol         (antifreeze) \n Propylene Glycol     (numerous uses) \n people might try to consume glycols in terms of suicidial intention/alcohol seeking behaviour  \n ",
        "SLIDE #: 14 || Toxic Alcohols \n methanol, isopropanol, and ethylene glycol can only be analysed by gas chromatgraphy (GC) \n GC is also used to monitor treatment  \n (ethanol therapy, fomepizole, and/or haemodialysis –methanol, EG \n supportive treatment –  isopropanol/acetone) \n GC can be used to monitor treatment (make sure methabol/ethanol is decreasing) \n treatment could be ethanol therapy to protect them from isoporonaol etc. \n - prevent ethanol from breaking  down into toxic metabolite \n fomepizole to prevent enzyme from breaking down and forming toxic metabolite \n ^ most cases its followed up by hemodialysis to get rid of parent alchol and toxic emtabolite  \n if overdose found than supportive treatment  \n ",
        "SLIDE #: 15 || example of GC chromatogram  \n top tracing is standards for volatiles - they are all chromatographically seperated from each other and each peak is diff retention time on column \n volatile screen - patient sample only has peak correspodning with methanol and internal standard which helps quantify how mcuh tyey consumed \n ethanol theraphy - large peak of ethanol because given to prevent methanol from forming toxic metabolite, peak of methanol is smaller \n post tretment - individual does not have ethanol or methanol detected \n ",
        "SLIDE #: 16 || Serum Osmolality Gap (OGAP) \n OGAP  = Osmolality measured - Osmolality calculated \n   \n \t\t   = Osmolality meas -  (2[Na] + [Glucose] + [Urea])  \n    \n \t          =    -10    to  +10 \n unexplained (residual)  OGAP   =   OGAP – [Ethanol] \n OGAP is where you look for measured and calculated osmolality \n submit sample of serum to laboratory which is measured for it and you also measure it for the main thing that takes it up in normal person (sodium, glucose, and urea)  \n use both to calculate OGAP \n measured is normally higher than calculated \n measured componetnts are 2 times sodium (because sodium and chloride are there, glucose and urea) \n  OGAP that is between -10 and +10 is normal OGAP \n take the unexplained/residual OGAP -  \n ",
        "SLIDE #: 17 || Unexplained   OGAP \n Precision   (i.e. SD)   is  ± 6 \n Accumulation of measurement error of \n Osmolality \n Na \n Glucose \n Urea \n Ethanol \n precision of the OGAP - S.D could be +/- 6 due to accumulation error \n - small errors in all measurments add up  \n ",
        "SLIDE #: 18 || Unexplained   OGAP \n An unexplained OGAP >10 mmol/L strongly suggests presence of something in addition to ethanol \n An unexplained OGAP ≤10 mmol/L   - not helpful \n ",
        "SLIDE #: 19 || Serum Osmolality Gap (OGAP) \n Ethylene glycol is toxic at only 3.2 mmol/L  \n Methanol is toxic at 8 mmol/L \n If unexplained OGAP <=6 mmol/L, we encourage clinical staff to cancel the methanol/isopropanol screen but not a glycol screen \n ",
        "SLIDE #: 20 || Acetaminophen \n Tylenol \n Other preparations (e.g. Percocet, Robaxacet, combination cold remedies) \n Liver Toxicity is major concern \n > 4 grams per day \n Antidote \n antidote - anacytalsitine or NAC - used to protect liver from toxic metabolite produced  \n ",
        "SLIDE #: 21 ||  The effect of a single oral dose of a drug\u000b  on its concentration in serum/ plasma \n when you take a drug, you have absorption phase which peaks then a two phase distribtuion (distribution phase where it goes into tissues/fat and second one is elimination where it goes into bile or urine) \n knwoing when you are taking medicaiton from ingestion is important for interpretation of it  \n ",
        "SLIDE #: 22 || nomogram used in acetominophen overdosing \n it starts at 4 hrs after ingestion to 16 hrs \n - window where you are concerned about toxicitiy \n - measure the levels and plot it relating to time and when you think ingestion occured \n - more severe poisoning = more likely they are giving antidote \n earlier testing is done, earlier antidotte given  \n ",
        "SLIDE #: 23 || Salicylate \n Aspirin \n Other preparations (e.g. Percodan) \n Pepto-Bismol (bismuth subsalicylate) \n Enteric-coated preparations \n Leads to Metabolic Acidosis \n Treatment is to enhance elimination \n Ion traping \n eteric coated is different formulation where it has different coating or release pattern for aspirin \n ion trapping - salicylate is ionized and released primarily in urine so you enhance elimnation by taking acidic urine and make it charged to add more base to urine to keep the salicylate negatively charged and keeps them in the urine allowing you to pee them out  \n - uncharged salicylate have abiity to be reabsorbed back into body  \n ",
        "SLIDE #: 24 || Sexual Assault Drugs \n Sexual assault drugs can include any drug which will reduce inhibitions and/or awareness such as: \n alcohol, cannabis, Ecstasy (MDMA), or benzodiazepines \n The classical application of the term “date rape drug” is to drugs which also induce amnesia of the assault (e.g. Gammahydroxybutyrate [GHB, GBL], flunitrazepam [Rohypnol], ketamine [Special K]) \n take serum or urine samples from victim and look to see if they were drugged \n drugs are used to reduce inhibitions/awareness/memory \n ",
        "SLIDE #: 25 || Urine Drug  Testing \n ",
        "SLIDE #: 26 || How Long are Drugs \u000bDetectable in Urine?* \n *Dose and individual dependent \n Drug \n Estimated Window of Detection \n Drug Screen Threshold (Cutoff) Concentration ng/mL (μmol/L) \n   \n Amphetamines \n 1 - 3 days \n 1000 (7.41) \n Barbiturates \n short/intermediate acting \n phenobarbital \n   \n 2 - 4 days \n Several weeks \n 200 (0.84) \n Benzodiazepines \n 1 - 7 days \n 200 (0.70) \n Cannabinoids \n 4 - 30 days \n 50 (0.147) \n Cocaine \n   \n 300 (1.04) \n Opiates (Morphine or Codeine) \n 2-3 days \n 300 (1.05) \n GHB \n 1 day (max) \n 10 ug/mL \n this is the first question in urine drug testing \n urine is primary choice because it is helpful in determining exposure of drug (not intoxication/effect of drug) \n half life gives you window of detection to find out if they consumed drugs \n shorter half life = shorter window of detection \n earlier you get the urine sample, more likely you will be able to pick up the trace of these \n drug screening have different cutt offs for different methadologies \n ",
        "SLIDE #: 27 || Terminology \n Screening Test: \n initial test which distinguishes a negative result from a presumptive positive \n ",
        "SLIDE #: 28 || Terminology \n Presumptive Positive: \n positive screen test result not yet validated by a confirmation  test \n in most cases, confirmation test/methodoly is by some type of mass spec method where you have definitive peak/fragmentation pattern compared to standard and you know it was present  \n most often come from immunoassay or POC \n ",
        "SLIDE #: 29 || Terminology \n Confirmation Test: \n definitive test which conclusively establishes the \n presumptive positive screen result as a true or false \n positive \n confirm. testing normally done with mass spec method  \n ",
        "SLIDE #: 30 || Terminology \n True Positive:  \n    a positive screening test result which has been validated by a positive confirmation test result \n both screening methodology and confirmation test both say drug is there in sample \n ",
        "SLIDE #: 31 || Terminology \n False Positive: \n     a presumptive positive screening test result which has been invalidated by a negative confirmation test result \n normally due to cross reactivity to some other drug in sample \n ",
        "SLIDE #: 32 || Toxicology Methods \n 1.  Screening Methods \n 2.  Confirmation Methods \n screening methods - rapid, easy to use, present in POC testing by lateral flow strips or core lab \n confirmation methods - based on mass spec  \n ",
        "SLIDE #: 33 || Common Screen Methods \u000bSpecific screen methods: \n Core Lab or POCT (mostly immunoassays) \n Qual or Quant \n Fast & Cheap (relatively) \n Sensitive screening methods \n False Positives? \n Serum(acetaminophen, salicylate, ethanol) \n Urine \n Drugs of abuse screens (urine) \n Prescription drug screens (mostly urine) \n cannabinoids \n opiates (but NOT oxycodone; poor cross-reactivity) \n amphetamines \n barbiturates (e.g. phenobarbital) \n cocaine \n benzodiazepines (e.g. lorazepam) \n opiates \n serum tricyclic antidepressants (e.g. amitriptyline) \n they can be qualitative (so either present or absent) \n quantitative e.g. in core lab where you can know if they are close to threshold, twice the threshold, half of it etc.  \n these are fast, quick, short TAT (within an hour or minute) \n sensitive - can pick up many drugs \n not every drug in a class is equally good at causing a positive (doesn't react quite as well with antibodies) \n prone to false positivies because of interferent or other drug in sample which causing a false positive but it is not the class of drug that you want  \n it is important to know class (?) \n -  \n ",
        "SLIDE #: 34 || Significant \u000bCross-reactivity Problems \n Amphetamines \n \t\t\t(pseudoephedrine,  e.g. Sudafed). \n Tricyclic antidepressant drugs  \n \t\t\t(30% false positives) \n Cannabinoids \n \t              (50% of all neonatal positives can be false) \n cross reactivity causes false positives \n amphetamines cross react with psudeoephedrine  \n tricyclic antidepressant \n - structure is common to a lot of drugs \n cannabinoids  \n ",
        "SLIDE #: 35 || Tricyclic Immunoassay Screen Cross-reactants \n Diphenhydramine \n Phenothiazines \n Carbamazepine \n Cyclobenzaprine \n Hydroxyzine \n Orphenadrine \n Cyproheptadine \n not all of these are highly prescribed or used \n carbamazepine - antiepileptic drug \n ",
        "SLIDE #: 36 || Causes Of False Positive Immunoassay Drug Screen Results \n [Drug] is close to but below the cutoff conc’n \n Presence of interfering substances  \n (usually other drugs) \n due to interfering substance (some other drug) \n or drug gets close to cut-off \n - be a little bit higher than cut off but in confirmation testing its not high enough to reach cut off \n - could be due to the fact that parent drug/other drugs in the same class collectively bind and react in immunoassay therefore collectively theyre all greater in cutt off but when looking at them individually they might not meet it  \n ",
        "SLIDE #: 37 || Confirmation Methods \n greater analytical sensitivity than the screen \n based on a different chemical principle \n HPLC,  GC,  triple quad LCMS,   GC/MS \n measure lower concentrations and definiatively tell compound's presence \n method is based on mass spec usually which is a different pricniple than immunoassay \n could be done by HPLC or GC but more commonly done by LCMS or GC/MS \n ",
        "SLIDE #: 38 || Screen Confirmation \n Positive screen result for drugs of abuse and prescription drugs \n Indeterminate screen result may be close but below the cut-off level, \n False positive screen result due to cross reactivity or interference from other drugs is always possible \n It is not necessary to do confirmations on all samples containing drugs, for example: \n Nicotine (unless insurance testing) \n Caffeine \n Therapeutic drugs for which there are assays available \n Prescribed drugs (known to be taken by patient). \n ",
        "SLIDE #: 39 || Criteria for Confirmation Testing: \n Presumptive positive immunoassay screen result \n Any uncertainty in the identification of a drug in the initial drug screen (e.g. GC/MS or LC/MS/MS) \n Request from patient care giver \n if you need to know the true positive then you need to do a confirmation test \n ",
        "SLIDE #: 40 || Criteria for Confirmation Testing: \n Reality check: \n In the clinical setting, confirmation testing cannot be done in real time for Emerg. Dept. needs \n And so many drug screens are ordered by ED. \n    Tox lab confirmation tests cannot keep up anyway \n Confirmation testing done on request only. \n Absolutely necessary in forensic toxicology testing to determine cause of death with certainty \n when determining if to do a confirmation test, do a reality check, figure out if you need it and if it clinically impacts the case \n usually by ED, they want to determine what drug the overdose was and that's all they need to know to treat \n - ED though might be acting before the screening result \n ED also orders them for patients admitted to psychiatry - to figure out what the patient came into the ED On  \n confirmation testing requires more investment of time and greater TAT therefore no clinical use to ED  \n confirmation testing done in certain clinical situations like pain clinics and forensic investigation  \n ",
        "SLIDE #: 41 || Toxidromes \n clinically, they are assessing toxidromes (clinical parameters they can measure to assess what potential drug a patient overdosed on) \n - they do this along with screening methodology sent to core lab  \n toxidromes - clinically assess respiratory rate, HR, blood pressure, size of pupils, temperature, bowel, sweat and energy \n you can clinically classify drug overdose into one of these five categories which can dictate what the treatment should be \n all they need from the lab is a screen result to confirm that clinical picture and results match that they are on the right track \n anticholinergic - basically fight or flight response by someone \n noloxone is therapy for opioid overdose \n ",
        "SLIDE #: 42 || Part 2 - Toxicology Cases \n ",
        "SLIDE #: 43 || Case 1: \n A patient with is history of elicit drug use was seen in clinic and is asked to submit a specimen to undergo a urine drug screen to assess for Rx compliance. Their Rx include: Oxycodone, Morphine, Diazepam, Adderall (amphetamine) \n ",
        "SLIDE #: 44 || Case 1: Drug Screen Results \n Screening Test \n Result \n Ordering Physician Comments \n Amphetamines \n Positive \n Is this consistent with Rx or elicit use? \n Benzodiazepines \n Negative \n Are they compliant with Rx? \n Cannaboids \n Negative \n Cocaine \n Positive \n Suggest elicit drug use \n Opiates \n Positive \n Oxycodone \n Positive \n Testing done in Core laboratory by Homogenous IA (KIMS methodology) \n send screening testing to core laboratory - done with homogenous immunoassay \n physicians have to determine if that makes sense with the prescriped drugs \n the screen can't tell you if it is prescription or elicit \n opiates positive is consistent with prescription of morphine, so is oxycodene \n physicians may want to request confirmation testing for the amphatmines or benzos \n ",
        "SLIDE #: 45 || example of the GC/MS results for this patient \n patient has a positive/peak for cocaine -- so screening for cocaine got confirmed \n small peak for diazepam; maybe dose missed or its a low level accounted for by the negative screen but still detected by the more sensitive methodology \n ",
        "SLIDE #: 46 || MDMA \n MDA \n amphetamines - you can tell them apart by fragmentation pattern \n ",
        "SLIDE #: 47 || Methamphetamine \n Amphetamine \n fragmentation pattern slightly different for these \n same class of drugs but different fragmentation - screen result would be positive \n this will tell you which one was taken  \n ",
        "SLIDE #: 48 || Case 1: Drug Screen Results \n Screening Test \n Screen Result \n Ordering Physician Comments \n Confirmation Testing \n Amphetamines \n Positive \n Is this consistent with Rx or elicit use? \n Positive for AMP, MethAMP, MDMA and MDA \n Benzodiazepines \n Negative \n Are they compliant with Rx? \n Positive \n Cannaboids \n Negative \n Negative \n Cocaine \n Positive \n Suggest elicit drug use \n Positive \n Opiates \n Positive \n Positive for Hydromorphone \n Oxycodone \n Positive \n Positive \n Testing done in Core laboratory by Homogenous IA (KIMS methodology).  \n Confirmation testing done by GC/MS \n for benzos, confirmation tests show that they are compliant \n ",
        "SLIDE #: 49 || Case 2 \n A patient is seen in your pain clinic today and undergoes routine urine drug testing. \n Their Rx history includes Codeine (OTC), Nitrazapam, Oxycodone and recently they have had a cold with OTC cough and cold therapy \n routine testing to assess compliance to make sure they are taking pain meds prescribed and not selling it or supplementing it with other things \n ",
        "SLIDE #: 50 || Case 2: Drug Screen Results \n Screening Test \n Result \n Ordering Physician Comments \n Amphetamines \n Positive \n Is elicit use? \n Benzodiazepines \n Positive \n Cannaboids \n Negative \n Cocaine \n Negative \n Opiates \n Positive \n Oxycodone \n Positive \n Testing done in Core laboratory by Homogenous IA (KIMS methodology) \n not prescribing amphetamines so you want to know if it is elicit use \n benzos, oxycodene consistent with prescription \n confirmation testing for amphetamines \n ",
        "SLIDE #: 51 || GC/MS for this patient \n ",
        "SLIDE #: 52 || ",
        "SLIDE #: 53 || Case 2: Drug Screen Results \n Screening Test \n Result \n Ordering Physician Comments \n Confirmation testing \n Amphetamines \n Positive \n Is elicit use? \n Negative (False Positive Screen) \n Benzodiazepines \n Positive \n Positive for Nitrazepam Met \n Cannaboids \n Negative \n Negative \n Cocaine \n Negative \n Negative \n Opiates \n Positive \n Positive for Hydromorphone and Hydrocodone \n Oxycodone \n Positive \n Positive \n Testing done in Core laboratory by Homogenous IA (KIMS methodology) \n Confirmation testing done by GC/MS \n ",
        "SLIDE #: 54 || Case 3: Parkinson’s or Drug Toxicity?  \n ",
        "SLIDE #: 55 || Case 3 – ED Presentation \n 70y Male \n Presented to ED with a two week history of falls, difficulty ambulating, ataxia, and worsening tremor. \n Concerns in past few months regarding cognition and tremor and recently assessed by neurology for Multisystem Atrophy vs Parkinson’s Disease. \n But symptoms have become significantly worse in the last few days. \n Difficulty ambulating around home \n Denys syncope or other cardiorespertory symptoms \n Daily nausea and vomiting (1 to 2x per day) after meals for the last several weeks and loose bowel movements \n Oral intake has been minimal over the last 2-3 days \n No fever or other infectious symptoms \n ",
        "SLIDE #: 56 || Case 3 – Past Medical History \n 20y Hx of bipolar disease with stable lithium dose \n CKD – Baseline Cr 160 mmol/L \n CAD – Grade 3-4 with multiple MIs in past \n Atrial Fibrillation \n Has an Automatic defibrillator inserted (AICD) – 6 years ago \n Ventricular Tachycardia \n Mild Cognitive impairment \n Lung cancer – Left lung lobectomy in 2000 \n COPD \n Past smoker and consumes large amounts of nicotine gum \n Tremors, autonomic instability, erectile dysfunction, REM sleep disturbances, head drop \n Parkinsonian Syndrome – currently being worked up by Neurology \n Recently started on Sinemet (carbadopa/levodopa) \n Cr - creatinine \n - normal levels \n MI - myocardial infarctions \n ",
        "SLIDE #: 57 || Case 3 – Medication \n Lithium Carbonate 300mg PO TID \n Levodopa/Carbidopa 100mg/25mg PO TID \n Warfarin 4mg PO OD \n Vit B12 1000mcg PO OD \n Senokot 8.6mg PO qhs \n Venlafaxine SR 150mg PO OD \n Doxepin 50mg PO qhs \n Atorvastatin 40mg PO qhs \n Amiodarone 100mg PO OD \n Quetiapine 50mg PO qhs \n ASA 81mg PO OD \n Bisoprolol 7.5mg PO OD \n Furosemide 40mg PO OD \n Midodrine ?mg PO TID \n he has complicated medical history and large list of medication \n ",
        "SLIDE #: 58 || Case 3 \n Triage Vitals \n T 36.6, HR 61, BP 97/60, RR 22, O2 Sat 96 \n   \n Physical Exam \n Appears well, no distress, dry mucus membranes JVP 1cm ASA \n CVS: normal  \n Resp: Normal, no wheezes or crackles \n Abd: Soft and Lax, no tenderness or rigidity, + BS \n No edema \n Neruo exam: alert and oriented, no facial asymmetry or slurred speech \n No pronator drift, CN2-12 normal, Power 5/5 all limbs, Reflexes 2+ No asterixis \n LABS \n CBC: WBC 10.5, Hgb 122 L, Neut 9.0 H, Lymph 0.7 L, PLT 213, MCV 96.2 H \n Na 137, K 5.4 H, Cl 104, CO2 26, AG 7 \n Ca 2.54, Mg 1.27 H, PO4 1.2 \n Alb 44 \n AST 17, ALT 9, ALP 116, TBil 8 \n CK 46, Lipase 48 \n INR 2.61 H \n Urea 11.8 H \n Cre 214 H \n HsTrpT 40 H \n Glu, random 5.2 \n UDS – Negative \n EtOH - ND \n Toxic Alcohol Screen – ND \n APAP – ND \n Salicylate – ND \n Lithium 2.5 mmol/L (0.4-1.3) C \n appears well and not in distress \n basic chemistry panel is unremarkable; little bit high potassium but overall normal results \n - Cr is a little elevated \n looking for toxic cause for his symptoms \n urine drug test - no ellicit drugs  \n ethanol/alcohol screen - none detected \n aceptominophne (APAP) and serum - not detected  \n then someone measured lithium levels - he was prescribed it for his bipolar - it was critically high \n ",
        "SLIDE #: 59 || Lithium Toxicity \n Acute – lithium naïve patients who overdose \n Chronic – on maintenance Li therapy with some change – increase dose, reduced kidney function, or new drug-drug interaction \n Acute on chronic – existing burden (from chronic maintenance therapy) and are acutely exposed to a large burden \n ",
        "SLIDE #: 60 || Lithium Pharmacokinetics \n A  \n D  \n M  \n E  \n Complete in 6-8 hrs \n Peak plasma level 0.5-2 hrs \n Peak plasma for delayed release 4-5 hrs \n In total body water, no protein binding \n Delayed intracellular uptake \n CSF and brain uptake delayed by 24 hrs \n None \n Entirely in urine \n Freely filtered in glomerulus, 80% reabsorbed \n T ½ 12-27 hours (delayed in geriatric patients) \n Because of my background I got asked about the role for Dialysis and Whole Bowel irrigation  \n A - absorption  \n D - distribution \n M - lithium is an ion therefore not metabolized \n E -excretion; excreted in urine \n ",
        "SLIDE #: 61 || Case 1 – Lithium Levels \n Collect D/T: 2016/04/07 1955 \n Receive D/T: 2016/04/07 2027 \n   LITHIUM (TDM) \n     LAST DOSE (LI) \n UNKNOWN~ \n     TIME OF LAST DOSE (LI) \n 20160407200100~ \n     LITHIUM \n C \n 2.5 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/08 0715 \n Receive D/T: 2016/04/08 1032 \n     LITHIUM \n C \n 2.1 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/08 1332 \n Receive D/T: 2016/04/08 1529 \n     LITHIUM \n H \n 1.9 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/08 1925 \n Receive D/T: 2016/04/08 2031 \n     LITHIUM \n H \n 1.7 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/09 0724 \n Receive D/T: 2016/04/09 0751 \n     LITHIUM \n H \n 1.4 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/09 1345 \n Receive D/T: 2016/04/09 1500 \n     LITHIUM \n 1.2 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/10 0735 \n Receive D/T: 2016/04/10 0814 \n     LITHIUM \n 0.9 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/11 1440 \n Receive D/T: 2016/04/11 1523 \n     LITHIUM \n 0.6 \n (0.4-1.3) \n mmol/L \n Collect D/T: 2016/04/13 0710 \n Receive D/T: 2016/04/13 0816 \n     LITHIUM \n 0.4 \n (0.4-1.3) \n mmol/L \n 2.5 to 1.2 (2 Days) \n 1.2 -0.6 ( 2 Days) \n Lithium halflife is 2 days in this Patient normally ~1 day \n ",
        "SLIDE #: 62 || Case 3 – Lithium Levels \n 2.5 to 1.2 (2 Days) \n 1.2 -0.6 ( 2 Days) \n Lithium halflife is 2 days in this Patient normally ~1 day \n longer than 24 hrs for a half life for him (first half life) \n next half life - almost two days \n this patient has a delayed half life and takes about two days per half life  \n ",
        "SLIDE #: 63 || Case 3 - Conclusion \n After doing a comprehensive laboratory investigation including UDS, toxic alcohol screen and lithium level for TDM. The patient was found to have a critical Lithium level 2.5 mmol/L (RI 0.4 – 1.3) with mild acute on chronic kidney disease Cre 214. \n He was on a stable lithium dose over the last few years and denies any intentional overdose and was taking his lithium as prescribed. Lithium was held until the lithium levels came down to below the reference range 0.4 mmol/L (6 days). \n Recommendation from Nephrology, Clinical Pharmacology, and Poison Centre was to hold the Lithium and give IV fluids, acute dialysis is not indicated to facilitate lithium clearance.  \n Monitor kidney function with frequent volume assessments and watch for lithium induced diabetes insipidus . \n The differential for his presentation would include lithium toxicity versus worsening of his underlying neurological disorder, secondary to decreased oral intake, GI symptoms, and hypovolumeia. \n Patient was referred to Psychiatry for reassessment of Bipolar disorder and lithium dosing \n ",
        "SLIDE #: 64 || Lithium Toxicity \n Lithium toxicity treatment guidelines for Dialysis:  \n Lithium level >6 mmol/L: any patient \n Lithium level >4 mmol/L: any patient on chronic lithium therapy \n Lithium level between 2.5 and 4 mmol/L: any patient with severe neurologic symptoms, renal insufficiency, or unstable hemodynamically or neurologically \n Lithium level <2.5 mmol/L: hemodialysis indicated only for patients with end-stage renal disease or patients whose lithium levels increase after admission or who fail to reach a lithium level below 1 mmol/L in 30 h \n Ref Dr B. Kapur CSCC List Serv \n ",
        "SLIDE #: 65 || Lithium Toxicity \n Current clinical practice in the fields of Psychiatry and Geriatric Psychiatry, expert opinion, and the literature, the the upper limit (1.3 mmol/L) was deemed too high for the elderly.  \n Recommended therapeutic interval of 0.4-0.8 mmol/L in patients ≥ 65  years of age. \n Australian and New Zealand Journal of Psychiatry 2011; 45:1026–1032  \n Curr Psychiatry Rep (2011) 13:488–492 \n ",
        "SLIDE #: 66 || Conclusions \n These cases are to illustrate the need for toxicology testing in the compliance and over dose setting \n Important to recognize the differences between screening and confirmation testing  \n "
    ]
}