{
    "pptName": "L6_Knauer-Tumor_markets",
    "slides": [
        "SLIDE #: 1 || Tumor Markers \n Clinical Biochemistry 3386b \n Michael Knauer PhD, FCACB \n michael.knauer@lhsc.on.ca \n ",
        "SLIDE #: 2 || Define cancer and describe the properties of “ideal” tumor markers.  \n Discuss the clinical application of tumor markers in the clinic and their potential uses. \u000b \n Describe the clinical uses of prostate-specific antigen (PSA) in prostate cancer.  \n Objectives \n ",
        "SLIDE #: 3 || What is cancer? \n It is a group of diseases characterized by uncontrolled growth and division of cells (proliferation) that can develop into a solid mass (tumor) and spread to other areas of the body.  \n Cancer develops as a consequence of multiple genetic mutations which usually occur over a long period of time. These mutations are often in genes that disrupt cell cycle, differentiation or apoptosis (programmed cell death) pathways  \n Activated oncogene \n Uncontrolled Growth  \n ",
        "SLIDE #: 4 || What is cancer? \n http://cisncancer.org/research/what_we_know/advances/oncogenes.html \n Oncogenes \n The bad guys, turn abnormal cell growth on (go/gas pedal) \n Tumor-Suppressor Genes \n The good guys, turn cell growth off (stop/brake pedal) \n 2 types of genes involved \n Tumor suppressor genes: braking signals during phase G1 of the cell cycle, to stop or slow the cell cycle before S phase. If tumor-suppressor genes are mutated, the normal brake mechanism will be disabled, resulting in uncontrolled growth, i.e. cancer. \n Oncogenes: a proto-oncogene that has been mutated in a way that leads to signals that cause uncontrolled growth- i.e., cancer \n stop  signal (keep them in senescent state)  \n oncogenes are pro cancer genes - is the signal for cell to divide wh  \n ",
        "SLIDE #: 5 || Cancer \n Cancer is staged based on  \n Tumor size \n Histology \n Regional lymph node  \n       involvement \n Presence of metastasis \n A benign tumor is not considered to be a cancer because the tumor remains localized in the place where it started; it does not spread \n A malignant tumor is considered to be cancerous because the tumor does invade and destroy nearby tissues, and can be become metastatic (spread to distant sites) \n usually starts in small location but can spread throughout body  \n ",
        "SLIDE #: 6 || Tumor markers \n Ideal Tumor markers  \n Be positive in all cases of cancer and negative in the absence of cancer \n Be specific to the malignant tissue, and be produced only by it \n Have plasma levels proportional to the tumor mass and stage  \n Have plasma levels, urine levels, or both, that are relatively short half-life, reflecting temporal changes in tumor burden and response to therapy \n Be prognostically useful i.e. a rise in level predicts recurrence/ relapse  \n Be easy, reproducible and inexpensive to measure \n Healthy cells \n Cancer cells \n Tumor markers \n Proteins/substances that are selectively over-produced by and released from cancer (tumor) cells, but not typically from normal cells \n ",
        "SLIDE #: 7 || Ideal tumor markers \n Be positive in all cases of cancer and negative in the absence of cancer \n -ve  \n Normal \n Tumor \n specific to cancer \n ",
        "SLIDE #: 8 || Ideal tumor markers \n 2.   Be specific to the malignant tissue, and be produced only by it \n Colon cells \n CEA \n PSA \n Prostate cancer \n e.g. only produced in one area  \n  or can find cancer by detecting the protein  \n in prostate cacner, you can't fidn it any other cancer in various locations around body \n but in CEA could be produced in rectal, thryoid, or lung cancer - which is not the ideal tumour marker - because it doesn't help tell you wehere it started \n ",
        "SLIDE #: 9 || Ideal tumor markers \n 3.     Have plasma levels proportional to the tumor mass and stage  \n Low concentration \n High concentration \n -ve  \n concentraiton of markers differentiate between stage 1 to 4 - the more present, larger the mass of cancer \n ",
        "SLIDE #: 10 || Ideal tumor markers \n Have plasma levels, urine levels, or both, that are relatively short half-life,  \n        reflecting temporal changes in tumor burden and response to therapy \n -ve  \n After treatment \n Before treatment \n ",
        "SLIDE #: 11 || -ve  \n Ideal tumor markers \n Recurrence/ Relapse?  \n After treatment \n 5.  Be prognostically useful i.e. a rise in level predicts recurrence/ relapse  \n use monitoring of markers to assess if cells were missed/relapse occured/treatment isn't working  \n decreases when it works \n ",
        "SLIDE #: 12 || Ideal tumor markers \n Be positive in all cases of cancer and negative in the absence of cancer \n Be specific to the malignant tissue, and be produced only by it \n Have plasma levels proportional to the tumor mass and stage  \n Have plasma levels, urine levels, or both, that are relatively short half-life, reflecting temporal changes in tumor burden and response to therapy \n Be prognostically useful i.e. a rise in level predicts recurrence/ relapse  \n Be easy, reproducible and inexpensive to measure \n NOT EXIST \n ideal tumor marker does not exist  \n ",
        "SLIDE #: 13 || Types of tumor markers \n PSA \n LD \n ALP \n catecholamines \n serotonin \n calcitonin \n CA15-3 \n CA125 \n CA19-9 \n CEA \n AFP \n hCG \n others \n Immunoglobulin \n Serum free light chain \n tumor markers could be proteins associated with tumor, produced by tumor, oncoproteins, oncogenes, tumor supression genes \n most common clinically is tumor associated proteins \n - protiens or associated molecules produced by tumor \n oncofetal antigens \n - only produced in fetal/early development  \n - picking up in adults suggest that cells progressed to fetal like cell or going back to stem cell like  \n eptihelial antigens \n - cancer antigens \n - mnumber corresponds to various types and lcoations \n enzymes \n - tumors produced enzymes  \n hormones \n - selectively overproduce hormones or produce hormones \n others \n - immunoglobin - plasma cells can contniue dividing and overproduce these, which is used to detect type of cancer \n ",
        "SLIDE #: 14 || Role of Laboratory Tests \n ",
        "SLIDE #: 15 || Role of Laboratory Tests \n screening - this would be ideal place to use tumor markers \n - screen population when symptoms show to find cancer early \n ",
        "SLIDE #: 16 || Role of Laboratory Tests: Screening \n Screening  \n Screening refers to looking for cancer in people who have no symptoms of the disease.  \n Early detection is finding cancer at an early stage, when it’s less likely to have spread and is easier to treat. \n but very few markers have been shown to be helpful in screening \n either markers arent snesitivie enough  \n ",
        "SLIDE #: 17 || Role of Laboratory Tests: Screening \n Tumor marker value \n Healthy \n cancer \n Chosen cut-off \n Frequency  \n distribution \n Increase Specificity \n Increase Sensitivity \n A screening test should have a very low false-negative rate i.e., the sensitivity of the test should be 100% or close to it \n This means that a “negative” screening test result assures the patient is free of that disease/cancer \n sensitivity should be close to 100%  \n - means negative reassures that they are free of cancer \n move cut off left  \n ",
        "SLIDE #: 18 || Role of Laboratory Tests: Screening \n Tumor marker value \n Healthy \n cancer \n Chosen cut-off \n Frequency  \n distribution \n Increase Specificity \n Increase Sensitivity \n A screening test should have a very low false-negative rate i.e., the sensitivity of the test should be 100% or close to it \n This means that a “negative” screening test result assures the patient is free of that disease/cancer \n moving it left will pick up all cases but also high false positivite rate \n - this could cause undue stress on healthy population  \n ",
        "SLIDE #: 19 || Role of Laboratory Tests: Screening \n Best example is PAP smear for cancer of the cervix cancer and mammography for breast cancer. \n ",
        "SLIDE #: 20 || Role of Laboratory Tests \n ",
        "SLIDE #: 21 || Role of Laboratory Tests: Diagnosis \n Diagnosis \n Tumor makers doesn’t help in establishing the diagnosis per se in most of the cases but corroborates it \n Helps in distinguish benign from malignant cases in some tumors \n In patients that have symptoms, tumor markers may be used to help identify the source of the cancer, such as CA-125 for ovarian cancer, and to help differentiate it from other conditions \n ",
        "SLIDE #: 22 || Role of Laboratory Tests \n ",
        "SLIDE #: 23 || Role of Laboratory Tests: Prognosis \n Staging and Prognosis \n If a patient has cancer, tumor marker elevations can be used to help determine how far the cancer has spread (staging) into other tissues and organs and how aggressive a cancer is likely to be (prognosis) \n The presence or absence of a tumor marker or its quantification helps in determining the prognosis \n Tumor marker concentration generally increases with tumor progression, reaching their highest levels when tumors metastasize. \n elevations in marker can tell you how far cancer spread and stage it  \n can also tell you how aggressive it is \n ",
        "SLIDE #: 24 || A 57-year-old woman with a diagnosis of jaundice, diabetes mellitus, and pancreatitis. Suspected cancer of the head of the pancreas was based on given the history, physical examination, and clinical presentation, tumor markers were also ordered.  \n \tLab result: \n Lipase \t800 U/L (13 – 60 U/L) \n Amylase\t104 U/L (30 – 100 U/L) \n ALP \t213 U/L (35 – 100 U/L) \n LD\t293 U/L (100 – 250 U/L) \n Bilirubin\t115 umol/L (3.5 – 20 umol/L) \n \tOrder:  \n CA19.9 \t241 U/mL (≤ 33 U/mL) \n Role of Laboratory Tests: Prognosis \n If they were elevated above the reference range, it would most likely indicate cancer of the head of the pancreas in stage 2 or later.  \n Chemotherapy and radiation therapy would most likely be initiated. \n lipase elevated \n ALP elevated \n LD - above reference interval \n bilirubin - elevated \n CA19.9 is also elevated \n just because tests are above, you can guess type/stage of cancer -- likely guess it is stage 2 cancer \n ",
        "SLIDE #: 25 || Pancreatic cancer is the fourth most common cause of cancer death \n Pancreatic cancer is difficult to diagnose until it is advanced and, thus chemotherapy and radiation therapy haven’t been very successful in curing or treating the disease \n Because pancreatic cancer often presents with nonspecific symptoms until it reaches advanced stages, there is a need for good staging indicators \n Some indicators that have been used include serum enzymes such as amylase and lipase, ectopically produced hormones, and tumor-associated antigens: CA19.9  that provide the best specificity and sensitivity \n Role of Laboratory Tests: Prognosis \n ",
        "SLIDE #: 26 || Role of Laboratory Tests \n ",
        "SLIDE #: 27 || Role of Laboratory Tests: Monitoring \n Monitoring effectiveness of therapy and disease recurrence \n Seeing if certain treatments are likely to work or how well treatment is working. \n One of the biggest uses for tumor markers is to monitor for cancer recurrence.  \n If a tumor marker is elevated before treatment, low after treatment, and then begins to rise over time, it is likely that the cancer is returning. (If it remains elevated after surgery, then chances are that not all of the cancer was removed).  \n The changes are important, which is why results of a series of level tests often mean more than a single result. If at all possible it’s best to compare results from tests done at the same lab, and always be sure that the results are of the same value. \n more common ways is to measure it after person has been clear or in remission - this could be sign that cancer is back if it is elevated  \n elevated before treatment, low after = means that treatment is working \n important to do serial monitoring to look for changes in levels of it  \n - same lab because immunoassays are not standardized between vendors/kits therefore differences between labs can affect levels \n ",
        "SLIDE #: 28 || A 25-year old man with a history of testicular cancer is followed post-surgery over the course of 10 months with β-hCG and AFP monitored.  \n This patient is treated with radiation at 2 months, followed by chemotherapy from months 6 through month 9. \n \t \n https://archive.org/details/ClinicalChemistry6thEditionBishop \n Role of Laboratory Tests: Monitoring \n day 0 he has low  \n 2 month follow up he is low levels but higher than before \n - begin to start radiation therapy -- this was successful in lowering HCg but not AFP \n month 5 - AFP continuing to rise \n - changed to chemotherapy \n first you have large spike in AFP and hcg but as the months pass, both tumor markers are declining back to baseline \n ",
        "SLIDE #: 29 || Timeline of tumor marker use \n different tumor marker ahve their advantages and disadvantages in the time line of cancer \n e.g. PSA/AFP are good screening markers but for diagnosis you may have other molecules and others for prognosis to determine type of cancer or poor prognosis with high levels \n none of the examples are available for any of the five major reasons to use them - just one of the plethora of tumor markers are not ideal marker \n ",
        "SLIDE #: 30 || Recommendations \n When ordering tumor markers \n Never rely on result of a single test \n Multiple markers should be considered to improve the outcome of the test (improve sensitivity and specificity) \n Repeat tests while following up should be ordered from the same lab using same kit \n Do serial testing \n While monitoring recurrence, make sure the tumor marker level was elevated before surgery (check baseline) \n The half-life of the marker (know the metabolism of tumor markers) should be taken into account before interpreting the result \n use same lab/vendor when repeating tests \n serial testing - before treatment, after treatment, and after remission \n set baseline level and compare successive measurements back to it  \n ",
        "SLIDE #: 31 || Define cancer and describe the properties of “ideal” tumor markers.  \n Discuss the clinical application of tumor markers in the clinic and their potential uses. \u000b \n Describe the clinical uses of prostate-specific antigen (PSA) in prostate cancer.  \n Objectives \n ",
        "SLIDE #: 32 || Prostate cancer \n The most common type of cancer (>65 yrs, African-Americans) and second most frequent cause of cancer-related death in men \n A malignant (cancerous) tumor begins in the prostate gland  \n Some prostate cancers grow very slowly and may not cause problems for years \n Canadian Cancer Registry and National Cancer Incidence Reporting System databases at Statistics Canada \n ",
        "SLIDE #: 33 || What is the function of prostate? \n Prostate gland is a walnut-sized gland just below the bladder and in front of the rectum \n It surrounds part of the urethra, which is the tube that carries urine and semen through the penis. \n The prostate makes part a liquid called seminal fluid, which mixes with sperm from the testicles to make semen. \n As a male gets older, the size of prostate gland increases and most males develop a significant increase in the size of the prostate called  \n \t“benign prostatic hyperplasia, BPH”  \n ",
        "SLIDE #: 34 || What are the risk factors for prostate cancer? \n Risk factors \n Increasing age \n Race \n Family history \n Fat diet \n Male hormones \n Adenocarcinoma occurs in periphery of prostate gland \n Metastasizes to lungs, bones (bone pain often first symptom as early stage of primary tumor maybe asymptomatic) \n ",
        "SLIDE #: 35 || What are the symptoms of prostate cancer? \n Frequent urination, or weak or interrupted urine flow \n Pain or burning during urination or blood in the urine \n The urge to urinate frequently during the night \n Different symptoms if the cancer has spread (metastasis):  \n pain in the back, weight loss, fatigue \n Sometimes, people with prostate cancer do not show any of these symptoms, or these symptoms may be similar to symptoms of other medical conditions \n ",
        "SLIDE #: 36 || Role of Laboratory Tests: Screening \n For tumor marker (biochemical testing), the screening of prostate cancer with serum PSA is the best example \n Major disadvantage \n Being the over-diagnosis and overtreatment of a certain tumor based on screening with tumor markers \n Tumor marker value \n Healthy \n cancer \n Chosen cut-off \n Frequency  \n distribution \n Increase Specificity \n Increase Sensitivity \n PSA - prostate specific antigen \n in order to get high sensitivity and 100% detection, you are incresing the risk of healthy people being positive that means yo uare overdiagnosising \n ",
        "SLIDE #: 37 || How is Prostate Cancer Evaluated? \n http://www.cancer.gov/publications/dictionaries/cancer-terms?cdrid=46632 \n PSA test \n DRE: Digital rectal exam  \n palpation of prostate by DRE detects nodular lump \n Diagnosis is confirmed with a biopsy \n Transrectal ultrasound (TRUS) \n measures prostate volume \n Imaging tests can determine if the cancer has spread \n prostate cancer screened by PSA test and visual rectal exam (palpation of prostate) \n confirm diagnosis with biopsy \n ",
        "SLIDE #: 38 || Prostate Specific Antigen (PSA) \n Structure \n A 28.4 kDa single chain chymotrypsin-like serine protease containing 237 amino acids  \n It is synthesized in prostate tissue, and after being released into the seminal fluid \n Physiological function \n It lyses the gel proteins, resulting in the liquefaction of the semen to promote the release and motility of spermatozoa \n ",
        "SLIDE #: 39 || Prostate Specific Antigen (PSA) \n Forms in serum: Complex and Free forms \n Various molecular forms because of complex formation with protease inhibitors \n There are 2 major forms of PSA that are found circulating in the blood \n complexed form:  \n α1-antichymotrypsin (PSA-ACT) \n α2-macroglobulin \n free form \n Free PSA comes from benign prostatic hyperplasia (BPH), an enlargement of the prostate. The higher the amount of free PSA, the less likely prostate cancer will be found as prostate cancer cells produce more complex PSA. \n \u000b \n Total PSA = α1-antichymotrypsin-PSA (complexed) + fPSA \n bound to alpha 1 or alpha 2 \n looking at prostate size you can't tell if its cancer or hyperplasia \n ",
        "SLIDE #: 40 || Total PSA test \n The PSA test is a simple blood test, which measures the amount of PSA protein in the blood.  \n It is common for PSA to be found in the blood in very small concentrations. \n Higher levels of PSA may indicate the presence of cancer, but can also be an indicator of other prostate conditions.  \n \u000b \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n Y \n PSA \n bound antibody and detection AB on one side \n capture antibody (solid support or magnetic bead on other side) ? \n ",
        "SLIDE #: 41 || PSA test: Cut-off \n Total PSA level, DRE \n PSA normal \n Grey zone \n Free PSA \n Calculate F/T PSA ratio \n Abnormal \n Biopsy \n Positive \n Treatment \n Normal \n Repeat DRE/PSA \n in 6 months \n < 10% \n free PSA comes from benign prostatic hyperplasia (BPH) \n High free PSA = BPH \n Low free PSA = Cancer \n total PSA levels - you need more total levels and digital rectal ultrasound ot figure it out \n if results of PSA is less than 4 than normal and no risk \n greater than 10 leads to further testing  \n - if biopsy was positive you treat the individual \n - if negative, repeat the screening in 6 months \n if its between 4-10 \n - measure free PSA levels; if less then 10% (more PSA is bound to protein than this increases risk for cancer and should proceed to biopsy) \n ",
        "SLIDE #: 42 || % Free PSA \n To enhance the specificity of total PSA in detecting prostate cancer, especially when total PSA values are between 4 and 10 µg/L.  \n The use of free/ total PSA in men with PSA levels can reduce the number of unnecessary biopsies. \n fPSA results can be used in 2 ways:  \n Use of a single cut-off point.  \n <25% fPSA it was shown that unnecessary needle biopsies could be reduced by 20% \n Probability of cancer: \n use single cut off- free PSA is less than 25% than reduce biopsies by 20%  \n graded approach where you ahve free PSA les s than 10% then you have greater than 50% of cancer?  \n ",
        "SLIDE #: 43 || PSA test: to screen or not to screen \n Benefits \n Limitations \n May indicate the presence of cancer in its earliest stages. \n May lead to unnecessary tests and treatment. \n Simple blood test (not harmful). \n Cannot distinguish between slow growing and advanced cancer. \n Currently only test we have as red flag to indicate follow-up. \n The PSA test cannot diagnose prostate cancer but can tell you if there’s a problem with the prostate. \n PSA can be elevated in  \n Benign prostatic hyperplasia \n Prostatitis (inflammation) \n Prostate infection, UTI \n Physical injuries: urethral catheterization, DRE, biopsy \n Physical activities: cycling, prostatic massage \n used in screening but not the perfect test \n ",
        "SLIDE #: 44 || PSA test: Why is it done? \n Screening \n Prostate cancer often grows very slowly, without causing major problems \n Detecting prostate cancer early and treating it may prevent some health problems and reduce the risk of dying from the cancer \n However, some treatments for prostate cancer can cause other problems \n Together with digital rectal exam (DRE), PSA can aid the diagnosis of prostate cancer \n To monitor prostate cancer and how it responds to treatment \n If PSA levels increase, the cancer may be growing or spreading \n PSA is usually not present in a man who has had his prostate gland removed \n A PSA level that rises after prostate removal may mean the cancer has returned or has spread  \n prostate cancer screening is done because it grows slowly so detecting early is good to prevent death \n ",
        "SLIDE #: 45 || PSA test: Canada Recommendation \n Prostate Cancer Canada Recommends:\u000b\u000b1. Men should get a PSA test in their 40s to establish their baseline.\u000b\u000b2. Men at high risk for prostate cancer should talk to their primary care provider before age 40 about prostate cancer.\u000b\u000b3. At or over age 70, the decision to end prostate cancer screening should be based on an informed discussion with their primary care provider.\u000b  \n While the PSA test is not currently used in Canada as a population-wide screening tool, it is used to monitor how someone responds to cancer treatment or to monitor disease recurrence or progression. \n \u000b \n ",
        "SLIDE #: 46 || PSA: Case study \n 69 y man presented to the  medical clinic with complaints of increased frequency of urination and difficulty urinating.  \n Further questioning revealed the need to urinate several times a night.  \n Although the problem has been present for some time, it has recently become worse.  \n A serum prostate-specific antigen (PSA) was obtained and a digital rectal examination (DRE) was performed. \n PSA \t15 μg/L \n DRE\tenlarged prostate without palpable nodules \n ",
        "SLIDE #: 47 || PSA: Case study \n Questions: \n Can serum PSA be used alone as a screening test for prostate cancer? \n What are some causes for an elevated serum PSA level? \n No. PSA used in conjunction with DRE and trans rectal ultrasound to improve prostate cancer detection. \n Benign prostatic hyperplasia \n Prostatitis \n Physical injuries: urethral catheterization, DRE, biopsy \n Physical activities: cycling, prostatic massage \n ",
        "SLIDE #: 48 || PSA: Case study \n Questions: \n If this patient has cancer limited to the prostate, should PSA levels be monitored  after radical prostatectomy and/or radiation therapy? \n Yes. PSA is extremely useful for monitoring cancer recurrence in patients following therapeutic intervention for prostate cancer. \n PSA (ug/L) \n After therapy, PSA levels should be extremely low or undetectable, with rising levels indicating recurrent disease. There is a direct relationship between the serum PSA concentration and the volume of prostate gland. \n "
    ]
}