[
    {
        "pptName": "Feb 10 - Intro to Endocrine System",
        "slides": [
            "slide 3: hormones defn: chemical from glands or cells. Autocrine or paracrine",
            "slide 4: neurotransmitters defn: synthesized in pre-synaptic neuron and travel in synapse; does not reach cells via bloodstream",
            "slide 5: neuroendocrine cells defn: nerve cells secrete into bloodstream; hypothalamus to anterior pituitary via portal circulation",
            "slide 6: principle site of endocrine glands: diagram of major glands",
            "slide 7: chart of gland/hormones released/function/type",
            "slide 8: structure of hormones: lipid soluble and water soluble",
            "slide 9: transport of hormones: hydrophilic or hydrophobic carriers",
            "slide 10: transport of hormones: only free parts can bind to receptors – ideally you want to measure the free portion in lab because that’s what corresponds to activity",
            "slide 11: control of endocrine system: simple/negative feedback/positive feedback e.g. LH",
            "slide 12: control of endocrine system: inhibitory control e.g. dopamine and prolactin/endocrine rhythms e.g. cortisol, vitamin D",
            "slide 13: endocrine disorders: over-secretion = loss of negative feedback e.g. ectopic secretion/under-secretion = loss of stimulation e.g. organ failure/disordered metabolic pathway = reduced end product, increased intermediates e.g. congenital hyperplasia",
            "slide 14: ectopic hormones defn: hormones produced by tumours e.g. small cell lung carcinoma produces ACTH which is normally made in pituitary",
            "slide 15: measurements of hormone concentrations: bioassays – time consuming, poor accuracy/precision/rarely used",
            "slide 16: measurements of hormone concentrations: chemical reactions – nonspecific/insensitive/imprecise/not used",
            "slide 17: measurements of hormone concentrations: chromatography – works well for small molecules/LC-MS/MS is method of choice for small analytes",
            "slide 18: measurements of hormone concentrations: immunoassays – automated/accurate/nonspecific/measures concentration not activity/best for large molecules",
            "slide 19: basic components of immunoassays: analyte, antibodies, label/detection system, method to separate bound from free",
            "slide 20: competitive immunoassays: analyte and tracer (labelled hormone) compete for limited amount of antibody. Can be simultaneous or sequential. Signal inversely proportional to analyte concentration",
            "slide 22: competitive immunoassays: examples of mechanisms used to separate bound and free tracer",
            "slide 23: non-competitive (sandwich) immunoassays: uses large amount of antibodies and all analyte will bind. Second antibody (labelled detection) binds to epitope on analyte. Signal is proportional to concentration of the analyte",
            "slide 24: competitive immunoassays vs non-competitive immunoassay chart",
            "slide 25: immunoassay labels: list of labels used",
            "slide 28: tandem mass spectrometry (LC-MS/MS): measures small molecules and metabolites in urine or steroid hormones in blood",
            "slide 29: catecholamines and metabolites: examples measured by mass spec: neural crest tumours (neuroblastoma,  pheochromocytoma,  ganglioneuroma)",
            "slide 30: LC-MS/MS: two stages; one to preselect an ion and second to analyze fragments induced by collision with inert gas",
            "slide 31: LC-MS/MS for catecholamines: diagrams",
            "slide 32: more specificity than immunoassays"
        ]
    },
    {
        "pptName": "Feb 12 – The Hypothalamic-Pituitary Axis",
        "slides": [
            "slide 3: pineal gland: produces melatonin. Stimulated by darkness and promotes sleep",
            "slide 4: location of the endocrine cells in the brain - diagram",
            "slide 5: pituitary gland – labelled diagram and location in the brain",
            "slide 6: pituitary gland – labelled diagram",
            "slide 7: hypothalamic-pituitary axis",
            "slide 8: hormones of the hypothalamus: chart of name/alternative names/abbreviations/function",
            "slide 9: anterior pituitary hormones: chart of name/alternative names/abbreviations/target organ/effect",
            "slide 10: anterior pituitary hormones: cells that secrete thyroid-stimulating hormone does not also secrete growth hormone ",
            "slide 11: hormones of the pituitary gland: list of the body processes pituitary hormones control ",
            "slide 12: feedback loop: diagram of feedback loop for thyroid hormones",
            "slide 14: surgical approach: diagram of transsphenoidal surgery",
            "slide 15: hormones of the posterior pituitary: oxytocin – made in hypothalamus and stored in posterior pituitary. Stimulates uterine contraction and induces labor. Stimulates milk release during suckling. Not measured in laboratory tests",
            "slide 16: hormones of the posterior pituitary: ADH (anti-diuretic hormone) – made in hypothalamus and stored in posterior pituitary. Increases reabsorption of water by kidneys; translocates aquaporins to plasma membrane and prevents excess loss",
            "slide 17: regulation of ADH levels: dehydration/low blood volume stimulates/high osmolality release. Osmolality detected by osmoreceptors in the hypothalamus. Baroreceptors detect low blood pressure. Urine osmolality increased due to ADH secretion",
            "slide 18: osmolality: serum and urine osmolality measured by osmometry. Osmometers measure freezing point depression which is proportional to concentration of solutes in fluid",
            "slide 19: osmometry: chart of thermodynamics of sample vs temperature",
            "slide 20: diabetes insipidus: can be central (low ADH/high serum osmolality/ low urine osmolality with high urine volume output and thirst) or nephrogenic ( high ADH/ high serum osmolality/low urine osmolality with high urine volume output and thirst)",
            "slide 21: diabetes insipidus: water deprivation test – deprive water and measure urine and serum osmolality; administer ADH and do again to distinguish central from nephrogenic",
            "slide 22: ADH measurement: more common to measure copeptin as surrogate of ADH rather than assays because they are tedious, time consuming and poor precision",
            "slide 23: copeptin: derived from same precursor protein as ADH",
            "slide 24: advantages of measuring copeptin over ADH: more stable, correlates better with osmolality, assays are quick/automated/excellent precision",
            "slide 25a: syndrome of inappropriate ADH (SIADH): overproduction of ADH (high ADH, hyponatremia due to excess water, low serum osmolality, high urine osmolality) ",
            "slide 25b: syndrome of inappropriate ADH (SIADH): caused by head trauma, tumour, or some drugs. Treat underlying cause and restrict fluids"
        ]
    },
    {
        "pptName": "Feb 14 – The thyroid gland/thyroid function test/disorders of the thyroid",
        "slides": [
            "slide 3: thyroid gland: located below larynx. Gland size increases in areas with iron deficiency",
            "slide 4: hypothalamic-pituitary-thyroid axis: diagram: labelling of T3 and T4 depends on iodine moieties on the tyrosine molecules",
            "slide 5: thyroid stimulating hormone: diagram of structure. Alpha subunit is common for glycoproteins TSH, LH, FSH, hCG. They have unique beta subunits",
            "slide 6: thyroid follicular cells: thyroid gland consists of follicular cells (arranged around a colloid. More abundant and secrete thyroid hormone) and parafollicular (C) cells (secrete calcitonin)",
            "slide 8: thyroid hormones: diagram of synthesis pathway",
            "slide 9: thyroid hormones: binding of TSH to TSHR leads to increased uptake of iodine, increased synthesis of thyroglobulin and thyroperoxidase, increased uptake of colloid by follicular cells, and increased degradation and release of thyroid hormones from thyroglobulin ",
            "slide 10: thyroid hormones: 80% secreted as T4, only T3 has hormone function, most T3 produced by peripheral deiodination of T4, most T3 and T4 bound to proteins in circulation, free hormone is biologically active",
            "slide 11: control of thyroid hormone production: thyroid dysgenesis causes low T4 and high TSH",
            "slide 12: iodine intake and thyroid function: insufficient dietary iodine causes low T4, high TSH, and goitre (hypertrophy)",
            "slide 14: biological actions of thyroid hormones: T3 binds to nuclear receptors. List of principles effects",
            "slide 15: causes of hyperthyroidism (thyrotoxicosis) and lab tests: primary – Graves disease: autoantibodies against TSH receptor bind and stimulate TSH receptors. Low TSH and high FT4 and FT3. Secondary – pituitary adenoma that excessively secretes TSH. High TSH, FT4, and FT3",
            "slide 16: clinical features/symptoms of hyperthyroidism: nervousness, irritability, bulging eyes, menstrual irregularities, warm/moist palms, increased sweating/heat intolerance, hoarseness/deep voice, persistent sore or dry throat, difficulty swallowing, goitre, irregular or rapid heartbeat, infertility, difficulty sleeping, frequent bowel movements, weight loss, diabetes",
            "slide 17: treatment of hyperthyroidism: list",
            "slide 18a: causes of hypothyroidism and lab tests: primary – insufficient iodine, drug or surgery induced thyroidal hypofunction, hashimoto’s thyroiditis (autoimmune destruction of thyroid; antibody is usually against TPO or Tg). Low FT4 and FT3, high TSH",
            "slide 18b: causes of hypothyroidism and lab tests: secondary – pituitary insufficiency due to malignancy, ischemia, head trauma. Low FT4, FT3, and TSH",
            "slide 18c: causes of hypothyroidism and lab tests: tertiary – hypothalamic dysfunction. Low FT4, FT3, TSH",
            "slide 19: clinical features/symptoms of hypothyroidism: thinning hair/hair loss, puffy face, dry and coarse skin, cool extremities, enlarged thyroid (goitre), slow heartbeat, poor appetite, infertility, heavy menstruation, carpal tunnel syndrome, weight gain, poor memory, intolerance to the cold, feeling of tiredness",
            "slide 20: treatment of hypothyroidism: list",
            "slide 21: TSH test: primary screening test. Most sensitive indicator of thyroid hormone activity (log-linear relationship between T4 and TSH; inverse relationship is primary disorder, not inverse is secondary)",
            "slide 22: thyroid function tests: measurement of free T4 needed to differentiate between hyper and hypo- and between primary and secondary. T4 reliably predicts T3 and has longer half-life (T3 more susceptible to short term variations)",
            "slide 23: measurement of FT4 and FT3: small therefore competitive immunoassay and measure free (active) portion",
            "slide 24: lab investigation of thyroid disease: TRH test – differentiate between secondary and tertiary. Thyroid binding immunoglobin (TSI or TBII) – May bind to TSH receptor and stimulate the thyroid gland  as if TSH (TSI, causing hyperthyroidism) or block it from  binding TSH (TBII, causing hypothyroidism). Anti-Tg, Anti-TPO – for hashimoto’s thyroiditis (primary hypothyroidism) ",
            "slide 25: lab investigation of thyroid disease: thyroglobulin – follicular cell thyroid cancers produce high levels of Tg. Tg monitored in patients and indicates recurrence. Calcitonin – tumor marker for C-cell carcinoma of thyroid gland",
            "slide 26: algorithm for initial assessment of thyroid function",
            "slide 27: parathyroid glands: secrete parathyroid hormone (PTH) which regulates calcium levels",
            "slide 28: parathyroid hormone: low concentration of calcium causes release of PTH which goes to bone (efflux of calcium from bone), kidneys (decreased loss of calcium in urine and stimulation of enzyme to make vitamin d), and intestine (vitamin d causes enhanced absorption of calcium at intestines)",
            "slide 29: parathyroid hormone: Intact PTH sandwich/non-comp. assays will recognize amino acids 1-84 (active) as well as 7-84 (inactive). One recognizes N and the other the C terminal. Newer assays detect 1-84"
        ]
    },
    {
        "pptName": "Feb 24 – Adrenal Cortex",
        "slides": [
            "slide 3: functional anatomy of adrenal gland: cortex divided into three zones – glomerulosa makes aldosterone, fasiculata makes cortisol, reticularis makes androgens",
            "slide 4: functional anatomy of the adrenal gland: diagram",
            "slide 5: steroid hormones: cortisol – controlled by pituitary via ACTH, aldosterone – controlled through RAAS, androgens – controlled by pituitary ACTH",
            "slide 6: biosynthesis of hormones of the adrenal cortex (adrenal steroids): pathway shown, DHEA-S is measured in lab",
            "slide 7: hypothalamic-pituitary-adrenal axis: diagram, stress such as physical, emotional, hypoglycemia, cold exposure and pain stimulate CRH",
            "slide 8: metabolic actions of cortisol: list – gluconeogenesis, deposition of fat, anti-inflammatory, increase sodium reabsorption and potassium excretion",
            "slide 9: metabolic actions of aldosterone: sodium reabsorption and potassium excretion at DCT and collecting duct, more potent than cortisol",
            "slide 10: Renin-Angiotensin-Aldosterone System (RAAS): Pathway diagram",
            "slide 11: adrenal androgens: DHEA and androstenedione in females, and testosterone and DHT in males",
            "slide 12: cushing’s syndrome: excessive production of cortisol by adrenal gland; caused by tumor, adrenal hyperplasia, or ectopic ACTH production by tumor. If the cause is due to a pituitary overproduction  of ACTH by a pituitary adenoma, the clinical  picture is the same, but condition now called  Cushing’s Disease",
            "slide 13: cushing’s syndrome: diagram of causes",
            "slide 14: cushing’s syndrome symptoms: central obesity/thin extremities, buffalo hump, moon facies, increase sweating, thinning of skin, bruising, stretch marks, irritability/depression, osteoporosis, insulin resistance/diabetes mellitus, hypertension, immune suppression, menstrual disorders, male pattern hair growth, baldness, hypercholesteremia",
            "slide 15: diurnal variation in cortisol level: high in morning and low at midnight, someone with cushings loses diurnal variation (more constant elevation)",
            "slide 16: laboratory diagnosis of cushings syndrome/disease: Measurement of serum cortisol reflects total cortisol and is subject to diurnal variation. Measurement of cortisol in a 24-hour urine specimen reflects free (active) cortisol and collection over a 24-hour period helps to normalize for effects of diurnal variation. Salivary cortisol also reflects free cortisol; usually collected around midnight",
            "slide 18: laboratory diagnosis of cushings syndrome/disease: ACTH measured to differentiate primary and secondary; Dexamethasone suppression test – low dose will suppress cortisol in normal individuals, high dose will suppress high cortisol levels due to pituitary adenoma ectopic ACTH-producing tumors will not be supressed",
            "slide 19: laboratory diagnosis of cushings syndrome/disease: flowchart/diagram",
            "slide 20: petrosal vein sampling: if ACTH increases in petrosal vein relative to peripheral blood upon CRH stimulation then pituitary adenoma. If not, then ectopic ACTH production",
            "slide 21a: adrenal insufficiency (addison’s disease): primary – often autoimmune disease against adrenal gland or adrenal dysgenesis, impaired steroidogenesis, corticosteroid withdrawal. All types result in low cortisol but primary can result in low aldosterone",
            "slide 21b: adrenal insufficiency (addison’s disease): secondary – low ACTH due to pituitary insufficiency. Tertiary – insufficient CRH production by hypothalamus. All types result in low cortisol but primary can result in low aldosterone",
            "slide 22: primary adrenal insufficiency (addison’s disease): low cortisol, high ACTH. Low cortisol leads to hypoglycemia. Low cortisol and aldosterone to low sodium and high potassium. Low aldosterone can also lead to metabolic acidosis which leads to hypercalcemia. Lab diagnosis involves measurement of cortisol, ACTH, sodium, potassium and sometimes antibodies against adrenal gland",
            "slide 23: adrenal insufficiency (addison’s disease): ACTH is small polypeptide fragmented from large molecule containing melanocyte stimulating hormone so increase in ACTH production can increase pigmentation",
            "slide 24: hyperaldosteronism: primary (Conn’s syndrome) – tumor in adrenal cortex producing aldosterone. Results in high sodium, low potassium, high serum and urinary aldosterone, and low levels of plasma renin. Secondary – e.g. renin-secreting tumor",
            "slide 25: congenital adrenal hyperplasia: diagram of pathway. Most commonly it is 21-hydroxylase that is affected resulting in accumulation of 17-OH-progesterone. Eventually results in excess synthesis of adrenal androgens",
            "slide 27: congenital adrenal hyperplasia: laboratory diagnosis – high levels of 17-OH progesterone. Treatment – replacement of glucocorticoids and mineralcorticoids"
        ]
    },
    {
        "pptName": "Feb 28 – Adrenal Medulla and Hormonal Control of Growth",
        "slides": [
            "slide 3: adrenal medulla: central portion of adrenal gland. Effects of catecholamines list",
            "slide 4: pheochromocytoma: catecholamine-producing tumours. Symptoms: tachycardia/palpitations, hypertension, headaches, sweating, anxiety, hyperglycemia, weight loss. The diagnosis is based on measuring the catecholamines (or usually their metabolites (metanephrines)) in urine or plasma",
            "slide 5: catecholamines and metabolites: metanephrinesis is only produced in adrenal medulla therefore best to measure it rather than catecholamines",
            "slide 7: human growth hormone: secreted by anterior pituitary in pulsatile manner under GHRH. Inhibited by hypothalamic somatostatin. Carried in plasma in free form and bound to GH binding protein. Major action sites are bone and liver. Most action is mediated through another hormone, like IGF-1",
            "slide 8: growth hormone and IGF-1 regulation: diagram of pathway and stimulation",
            "slide 9: IGF-1: liver is major source of IGF-1 but other cells that contain GH receptors also produce it. 98% in plasma is protein bound to IGFBP3. Acts in autocrine or paracrine fashion",
            "slide 10: actions of growth hormone: list",
            "slide 11: glucose regulation: hormones that decrease blood glucose – insulin. Increase blood glucose – cortisol, catecholamines, growth hormone, glucagon",
            "slide 12: glucose regulation: low blood glucose stimulates growth hormone (GH) secretion. High blood glucoses suppresses growth hormone secretion",
            "slide 13: assessing growth hormone pathway: occurs in pulses throughout day and especially night. Measurement of IGF-1 more helpful. Stimulation and suppression tests also used",
            "slide 14: growth hormone deficiency: in adults, reduced bone and muscle mass, increased body fat, and impaired brain function. In child, pituitary dwarfism (classical dwarfism)",
            "slide 16: laron dwarfism: mutation in GH receptors. Can’t respond to GH and IGF01 levels are low",
            "slide 18: possible causes of short stature: list",
            "slide 19: investigation of short stature: list of causes",
            "slide 20: investigation of GH deficiency: stimuli used to increase GH secretion – insulin, exercise, glucagon (causes insulin release), arginine (suppress somatostatin). Blood drawn before and after stimulus and GH measured and glucose (if stimulus is insulin)",
            "slide 21: growth hormone excess: GH excess leads to – gigantism in children and acromegaly in adults. Diagnosis is based on lack of suppression of GH level after glucose supplementation",
            "slide 23: acromegaly: enlargement of soft tissue such as hands, feet, nose, lips, ears, heart, kidneys, vocal cords. Brow and jaw protrusion"
        ]
    },
    {
        "pptName": "Mar 2 – Reproductive Endocrinology",
        "slides": [
            "slide 3: puberty in males",
            "slide 4: hypothalamic-pituitary-gonadal axis in males: GnRH stimulates LH and FSH by anterior pituitary. LH promotes synthesis of testosterone by Leydig cells. FSH stimulates spermatogenesis by Sertoli cells which also produces inhibin which has negative feedback inhibition (as does testosterone)",
            "slide 5: adrenal androgens: Androstenedione and DHEA (DHEAS) are androgens made in the adrenal cortex in both males and females. Adrenal androgens are relatively weak as androgens when compared to testosterone and DHT",
            "slide 6: gonal androgens in males: Androstenedione and DHEA from the adrenal gland act as precursors for testosterone synthesis by the testes. Most testosterone in circulation is bound to sex-hormone binding globulin (SHBG). Testosterone is converted to dihydrotestosterone (DHT) by 5α-reductase in target tissues. DHT is a more potent androgen than testosterone",
            "slide 7: androgen resistance: genetic disorder due to lack of the testosterone receptor or deficiency of 5α-reductase. The genetic deficiency results in a patient with a high testosterone level and a low level of DHT. In males, can result in ambiguous genitalia at birth, failure to undergo puberty, infertility. Degree of symptoms depends on degree of defect",
            "slide 8a: hypogonadism in males: primary - Kleinfelter’s syndrome (47XXY), Testicular agenesis, Mumps (orchitis), Varicocele, Radiation/chemotherapy. Low testosterone, high LH/FSH",
            "slide 8b: hypogonadism in males: secondary - Isolated gonadotropin deficiency. Pituitary damage (panhypopituitarism). Tumours in the pituitary (e.g. prolactinoma). Low LH/FSH, low testosterone. Tertiary – kallmann syndrome (x-linked abnormality in GnRH production. Low LH/FSH, low testosterone)",
            "slide 9: hypogonadism in males: symptoms include delayed puberty, infertility. Treat underlying cause. Other treatments are testosterone, LH, FSH, GnRH",
            "slide 10: puberty in females: increased adrenal androgen and pulsatile GnRH production",
            "slide 11: hypothalamic-pituitary-gonadal axis in females: FSH promotes ovarian follicle development which eventually results in estrogen and progesterone production by corpus luteum after ovulation. LH promotes ovulation",
            "slide 12: esterdiol and progesterone: functions",
            "slide 13: menstrual cycle: follicular phase - levels of LH and FSH have been suppressed by the previously high estradiol levels, but gradually they start to increase, which results in follicular development via FSH and estradiol production via LH. Ovulation -estradiol concentration increases above a threshold where it actually stimulates an increase in LH levels, which induces  ovulation",
            "slide 14: menstrual cycle: luteal phase – corpus luteum produces progesterone and esterdiol, which thicken uterine lining and prepare for implantation. If fertilization does not occur, uterine lining sheds",
            "slide 15: ovulation, fertilization and implantation: diagram of beginning of fertilization",
            "slide 16: menstrual cycle with implantation: diagram of cycle",
            "slide 17: hormonal changes with pregnancy: hCG produced by trophoblastic cells of embryo. hCG maintains corpus luteum which keeps endometrium until placenta is developed enough to take over producing esterdiol and progesterone",
            "slide 18: hCG levels during pregnancy: detected as early as 6 days after conception. Pregnancy is considered to start on day 1 of last menstrual cycle, conception occurs 2 weeks so pregnancy 3-4 weeks along by time hCG is measured. Once placenta is developed and functional, hCG levels decline but remain elevated",
            "slide 19: hypogonadism: primary – turners syndrome, radiation/chemotherapy. Low esterdiol, high LH/FSH. Secondary – isolated gonadotropin deficiency, pituitary damage panhypopituitarism, tumors in pituitary. Low LH/FSH, low esterdiol. Tertiary – kallmann syndrome. Low LH/FSH, low esterdiol",
            "slide 20: hypogonadism in females: symptoms are delayed puberty, infertility, menstrual irregularities. Treat underlying cause, may include estrogen, progesterone, LH, FSH, GnRH",
            "slide 21: ectopic pregnancy: symptoms are abdominal pain, bleeding as embryo grows and puts pressure on fallopian tubes and other structures",
            "slide 22: ectopic pregnancy: hCG measurement and ultrasound used to check for it. normal doubling time for hCG is 2 days, ectopic pregnancy there is less than 66% rise in hCG in 48 hours (longer doubling time)",
            "slide 23: ectopic pregnancy: surgery if imminent risk of rupture or methotrexate",
            "slide 26: hCG has tumor marker: hCG may be increased in molar pregnancy (defective embryo), placental tumor (choriocarcinoma), non-seminiferous testicular cancer",
            "slide 27: hCG has tumor marker: pregnancy - hyperglycosylated hCG and free beta more common in early pregnancy; mostly intact hCG from 2nd trimester on. Trophoblastic and germ cell tumors mostly make intact hCG. Non-trophoblastic tumors (e.g. biliary, pancreatic, balder) make only free beta"
        ]
    },
    {
        "pptName": "Mar 11 – Glucose and Diabetes",
        "slides": [
            "slide 3: insulin: protein hormone produced and stored in beta cells of pancreas. Secreted in response to high blood glucose. Binding to insulin receptors causes translocation of GLUT4 to cell surface allowing for glucose uptake by adipose and striated muscle cells",
            "slide 4: hormones that increase blood glucose level in hypoglycemia: list",
            "slide 5: diabetes: classic symptoms – polyuria (high urine volume), polydipsia (excessive thirst), unexplained weight loss",
            "slide 6: type 1 diabetes mellitus: primarily result of pancreatic beta cell destruction due to immune-mediated process. Occurs due to absolute deficiency of insulin",
            "slide 7: treatment of type 1 diabetes: insulin administration",
            "slide 8: pancreas and islet transplantation: can result in prolonged insulin independence. Islet transplant result in transient insulin independence and reliably stabilize blood glucose",
            "slide 9: diabetic ketoacidosis (DKA): high blood glucose (hyperglycemia) due to non functioning insulin and gluconeogenesis/glycogenolysis. Fatty acids will be oxidized to ketones to fuel brain and heart so ketone levels will be high. Ketones are acidic and can causes metabolic acidosis. Symptoms are polyuria (high urine volume), dehydration, thirst, hyperventilation, acetone breath, vomiting, confusion, coma, death if not treated",
            "slide 10: DKA: occur in people who don’t realize they have diabetes or people not taking sufficient insulin. Most common in type 1 diabetics. Blood glucose and beta-hydroxybutyrate are most help tests. Treatment is insulin",
            "slide 11: ketones",
            "slide 12: DKA: potassium leaks out of cells due to impaired ATP production and some is excreted due to polyuria. As insulin is given, fuels Na/K ATPase and can cause K levels to drop to dangerous levels",
            "slide 13: type 2 diabetes mellitus: insulin resistance when reserve capacity to store fat reduced, signalling changes, and levels of free fatty acids in circulation increases. Initially greater insulin production due to reduced response but then progresses to type II when pancreas can’t produce enough insulin to keep blood glucose at normal level. More a condition of relative insulin deficiency than absolute",
            "slide 14: treatment of type 2 diabetes",
            "slide 15: metabolic syndrome: diagnosis requires 3 of the following – abdominal obesity, hypertension, elevated fasting blood glucose, hyperlipidemia, low HDL",
            "slide 16: long term complications of diabetes (Type 1 and 2): increased glycation reactions which leads to microvascular and macrovascular complications",
            "slide 17: methods of measuring glucose: hexokinase – photometric, glucose oxidase – photometric linked with peroxidase, oxygen selective electrode, glucose dehydrogenase – photometric ",
            "slide 18: hexokinase",
            "slide 19: glucose oxidase",
            "slide 20: glucose dehydrogenase",
            "slide 21: glucose stability (collection): separate from cells after collection if you intend to measure it. Additive NaF can inhibit glycolysis by inhibiting enolase. Only useful if samples takes more than one hour to be analyzed because enolase is late in pathway",
            "slide 22: diagnosis of diabetes: chart",
            "slide 23: glucose tolerance test: graph/chart: diabetic has higher levels",
            "slide 24 + 25: hemoglobin A1c (HBA1c): gives insight into average blood glucose over 2-3 months, procedure available to measure, factors increasing, factors decreasing",
            "slide 26: diagnosis of diabetes: advantages and disadvantages of parameters ",
            "slide 27: glucometers: based on glucose oxidase or dehydrogenase. Measures glucose in whole capillary blood (lab instruments measures in venous blood). Sometimes used in POCT",
            "slide 28: should be compared to lab instruments annually. Do not have same precision at low glucose levels as lab instruments.",
            "slide 29: fructosamine: glycated albumin, since it has shorter half life than Hb, it gives indication of glucose control over the past 4 weeks. Test used in place of HbA1c in people with contraindications for HbA1c testing or when there is interest in determining blood glucose control over shorter window of time. Not validated for diagnosis of diabetes",
            "slide 30: fructosamine: reduced NBT in alkaline solution to purple dye",
            "slide 31: glucose in urine: urine dipstick test to detect glucose in urine. Test can suggest presence of diabetes but not validated for diagnosis",
            "slide 32: insulin: diagram of forms (preproinsulin to proinsulin to insulin to C-peptide)",
            "slide 33: insulin: measured by immunoassay. C-peptide is only produced endogenously and not found in injected forms, measurements of it help distinguish endogenous production from exogenous insulin (e.g. Munchausen syndrome vs insulinoma). C-peptide can also be measured in diabetics treated with insulin to see how much endogenous insulin is being produced"
        ]
    },
    {
        "pptName": "L3 – Drug Analysis Systems/Instruments",
        "slides": [
            "slide 3: definitions: clinical sensitivity and clinical specificity",
            "slide 4: definitions: analytical sensitivity and analytical specificity",
            "slide 5: drug analysis systems/instruments: examples",
            "slide 6: types of systems/instruments in core lab",
            "slide 7: homogenous competitive protein binding immunoassays: antibodies confer analytical sensitivity and specificity while labelled analyte used to quantitate the binding reaction",
            "slide 8: most commonly employed homogenous competitive assays in TDM: FPIA, EMIT, CEDIA, PETIA, KIMS, LOCIA",
            "slide 9: fluorescence polarization immunoassays (FPIA)",
            "slide 10: particle-enhanced turbidimetric immunoassay (PETIA)",
            "slide 11: enzyme multiplied immunoassay technique (EMIT)",
            "slide 12: cloned enzyme donor immunoassay (CEDIA)",
            "slide 13: ethanol: most requested toxicology testsl fast, convenient, almost always accurate",
            "slide 14: alcohol dehydrogenase based automated test for ethanol: NADH absorbance measured and related to ethanol concentration in specimen",
            "slide 15: calorimetric methods: salicylate measured by tinder reaction",
            "slide 17: POCT drug analysis: competitive lateral flow strip: positive if you don’t see a line, negative if you do not",
            "slide 19: chromatography: separate components in sample, distributed between two phases, the stationary and mobile (gas or liquid)",
            "slide 20: chromatography: retention time – time retained by column",
            "slide 21: chromatography types in lab: flow chart",
            "slide 22: gas chromatography (GC)",
            "slide 24: GC/FID for toxic alcohols: example",
            "slide 25: high pressure liquid chromatography (HPLC)",
            "slide 30: mass spectrometry: type of mass spec",
            "slide 36: tandem mass spectrometry: types of mass spec",
            "slide 37: tandem mass spec: process/how it works",
            "slide 40: tandem mass spec: five principal experiments",
            "slide 41: multiple reaction monitoring (MRM)",
            "slide 42: triple quad vs ion traps: advantages vs limitations",
            "slide 44: immunosuppressive drug transitions: immunosuppressives have similar retention times and different precursor ions and product ions"
        ]
    },
    {
        "pptName": "L2 – POCT",
        "slides": [
            "slide 4: POCT: removes everything from identification to anlaysis",
            "slide 5: POCT: definition",
            "slide 6: POCT the start of clinical chemistry: assessed urine based on colour, odour, consistency, precipitate",
            "slide 7: location of POCT",
            "slide 8: who will perform the tests",
            "slide 9: common types of elements",
            "slide 10: advantages of POCT",
            "slide 11: disadvantages of POCT",
            "slide 13: challenges of POCT pre-analytical",
            "slide 14: challenges of POCT analytical",
            "slide 15: challenges of POCT post-analytical",
            "slide 18: glucose homeostasis",
            "slide 19: diabetes symptoms",
            "slide 20: clinical utility of glucose meters: management of diabetes and critical care",
            "slide 21: POCT glucose testing: kit contains",
            "slide 22: specimen collection: basic tool for drawing blood is lancet (sharp needle in plastic sleeve)",
            "slide 23: POCT requirements: perform QC",
            "slide 24: apply blood sample: once the meter has detected the last strip, apply blood sample",
            "slide 25: how is glucose measured: enzymatic reaction – glucose oxidase converts glucose to gluconolactone. Detector (electrochemical detection) – current flow between electrodes proportional to concentration of glucose in reactoin",
            "slide 26: factors affecting bedside glucose testing: user error, endogenous interferences, exogenous interferences, environmental factors",
            "slide 27 to 32: glucose meters – a long history: history of the glucose meter",
            "slide 34: pregnancy testing: pregnancy strip is best known POCT to measure hCG levels in urine",
            "slide 35: hCG: glycoprotein hormone. Detected in serum and urine 7-10 days after conception",
            "slide 36: lateral flow strip: how does the test work",
            "slide 38: challenges in using pregnancy test",
            "slide 39: hCG heterogeneity: key beta-containing variants",
            "slide 40-41: challenges in using pregnancy test: using serum is of greater sensitivity and advantageous at early stages when hCG is not high. Determination in serum can be helpful in abnormalities during pregnancy and for gestational trophoblastic neoplasm (GTN) or hCG-producing tumors",
            "slide 42: fecal occult blood test (FOBT): detect blood ins tools",
            "slide 43: colorectal cancer",
            "slide 44: colorectal cancer stages: diagram",
            "slide 45: risk factors for colorectal cancer: intrinsic and extrinsic",
            "slide 46: symptoms for colorectal cancer: most cases have no symptoms; however, some include abdominal pain or tenderness in lower abdomen, blood in stool, bowel changes (diarrhea or constipation), narrow stools, weight loss, fatigue",
            "slide 47: colorectal cancer in Ontario: average risk, FOBT recommended once every two years, increased risk colonoscopy is recommended",
            "slide 48: colorectal cancer: screening: detection of occult blood in stool (FOBT/FIT), flexible sigmoidoscopy, colonoscopy",
            "slide 49: fecal occult blood: blood or products not recognized then its called occult blood (hidden blood)",
            "slide 50: specimen collection: avoid certain foods/drugs, collect three different bowl movements",
            "slide 52: FOBT: principle: guaiac resin on test card turns blue in presence of hemoglobin. Catalytic action of heme results from its peroxidase activity",
            "slide 53: what causes blood to appear in stool: conditions it could happen",
            "slide 54: advantages/disadvantages of FOBT"
        ]
    },
    {
        "pptName": "L4 – TDM",
        "slides": [
            "slide 4: What is TDM and why is it done",
            "slide 5: Which drugs need TDM",
            "slide 6: Why do TDM: narrow vs wide therapeutic range",
            "slide 7: therapeutic range with repeated dosing",
            "slide 8: why do TDM: variable pharmacokinetics – absorption, distribution, metabolism, elimination",
            "slide 9: variable pharmacokinetics: not one dose fits all",
            "slide 10: pharmacokinetics: fate of drug taken orally",
            "slide 11: effect of a single oral dose of drug on its concentration in serum/plasma: two rate curves – drug distributing in tissues (faster), elimination (slower)",
            "slide 12: half-life",
            "slide 14: effect of multiple identical doses on drug concentration",
            "slide 15: effect of frequency of dosing",
            "slide 16: loading doses",
            "slide 17: loading doses calculation"
        ]
    },
    {
        "pptName": "L1 – GI disorders",
        "slides": [
            "slide 3: The Gastrointestinal (GI) Tract: composed of GI tract and digestive glands. Main functions are digestion of food and absorption of nutrients",
            "slide 4: stomach: gastric mucosa contains gastric pits and glands. Secretions: chief cells, parietal cells, mucous cells",
            "slide 5: stomach: defensive mechanism: to prevent self-digestion",
            "slide 6: peptic (gastric and duodenal) ulcer: erosion of GI mucosa resulting from digestive action of HCl and pepsin. Symptoms are upper abdominal pain, bloating, heartburn, nausea, vomiting and black stool",
            "slide 7: gastric ulcer: hostile factors and protective factors",
            "slide 8: H.pylori",
            "slide 9: pathogenesis of gastric ulcer",
            "slide 10: C-Urea Breath Test",
            "slide 11: limitations of urea breath test: false negatives due to decreased bacterial loads with stomach mucosa. False positives due to urease producing bacteria colonizing in achlorhydric stomach due to atrophic gastritis",
            "slide 12: small intestine: three regions. Villi and microvilli increase total area for absorption",
            "slide 13: celiac disease: autoimmune disorder mainly affecting small intestine. Triggered by gluten in wheat, rye, and barley. Also called gluten-sensitive enteropathy or celiac sprue. Abnormal immune response to gluten lead to damage and atrophy of the intestinal villi. Nutrients can’t be absorbed properly",
            "slide 14: pathophysiology of celiac disease",
            "slide 16: symptoms of celiac disease: GI symptoms – abdominal pain, diarrhea, bloating, weight loss. Non-GI symptoms – anemia; iron, B12, folate deficiency, bone disease; vitamin D deficiency, short status and delayed puberty",
            "slide 17: celiac disease and anemia – anemia results from either a decrease in the size or number of RBCs or in the amount of hemoglobin. Due to lack of iron, vitamin B12, folate (essential for the formation and growth of RBCs). Iron deficiency – microcytic and hypochromic. 12 and folate deficiency – macrocytic",
            "slide 18: antibodies in celiac disease: IgA plays crucial roel in immune function of mucous membranes",
            "slide 19a: laboratory testing serology testing: anti-tissue transglutaminase (tTG) antibodies. Preferred screening test. Sensitive and specific for 2+ years. Not positive in patients with IgA deficiency",
            "slide 19b: laboratory testing: anti-endomysial antibodies (EMA) – Another type of antibody to tTG found in endomysium (connective tissue around muscle fibers). EMA-IgA has a high specificity of 99%. Used less often as it’s more difficult to do than anti-tTG",
            "slide 20a: laboratory testing serology testing: Anti-deamidated gliadin peptide (DGP) antibodies. DGP-IgG is useful in patients with IgA deficiency in pediatric patients, parallel testing of DGP-IgG and tTG-IgA is the preferred screening method",
            "slide 20b: laboratory testing: tissue biopsy of small intestine – gold standard and invasive",
            "slide 21: methodology ELISA: Anti tTG and DGP antibodies are measured by ELISA",
            "slide 23: methodology IFA: EMA-IgA is measured by IFA (Indirect Immunofluorescence Assay) on tissue sections of monkey esophagus",
            "slide 24: negative serology testing: factors that might contribute to false-negative test results. If celiac disease is still suspected, total IgA should be measured. In IgA deficiency, tTG-IgG or DGP-IgG should be measured",
            "slide 29: malabsorption: causes – failure of digestion or failure of absorption",
            "slide 30: tests for malabsorption: chart"
        ]
    },
    {
        "pptName": "L2 – Lab Testing for GI Disorders",
        "slides": [
            "slide 2: pancreas: located close to liver. Has endocrine (insulin, glucagon) and exocrine functions (amylase, lipase, trypsin)",
            "slide 3: cystic fibrosis (CF): affects lungs and pancreas. Mutations in CFTR gene which encodes CFTR protein",
            "slide 4: cystic fibrosis (CF): refers to autopsy findings of fluid-filled sacs and excessive connective tissue in pancreas",
            "slide 5: inheritance of CF: autosomal recessive",
            "slide 6: function of CFTR protein: chloride channel across apical membrane of epithelial cells that produce mucus, digestive enzymes, and sweat. Transports chloride in and out of cells, helps control water movement",
            "slide 7: pathophysiology in airway: CFTR on the apical membrane secretes Cl- onto the airway surface liquid. It inhibits Na+ absorption by blocking the Epithelial Na+ Channel (ENaC), allowing water movement via osmosis to hydrate the surface area. CFTR function lost causes retention of chloride and sodium in cell, water movement into cell resulting in mucus dehydration. Thick mucus clogs lumen of various organs",
            "slide 8: clinical presentation of CF in lung: high viscosity of airway fluid – cough, shortness of breath, bacterial infection (sinus and lung infection – leading cause of death)",
            "slide 9: pathophysiology in pancreas: dysfunction impairs the transport of Cl– and HCO3– into the lumen. Water secretion is also impaired as there is no longer a sufficient osmotic gradient to drive water into the duct. Obstruction of ducts by a viscous secretion prevents pancreatic enzymes from reaching the intestine",
            "slide 10: clinical presentation in pancreas: pancreatic insufficiency and pancreatitis",
            "slide 11: clinical presentation GI tract in newborns: affects meconium, becomes thick and sticky causing intestinal obstruction called meconium ileus",
            "slide 12: pathophysiology in reproductive system: men infertile because blockage of tube that connects testes and prostate gland, sperm can’t leave testes. Women may be infertile due to increased viscosity of luminal fluid making barrier between ovary and uterus",
            "slide 13: pathophysiology in sweat glands: CFTR channel is unable to transport Cl- into the tubule cells, producing sweat with high salt content",
            "slide 14: laboratory testing: newborn screening – sample collection (blood)",
            "slide 15: CF newborn screening test: IRT then DNA analysis and then sweat chloride test",
            "slide 16: IRT: trypsinogen detectable in blood of normal and CF newborn. In CF, pancreatic ducts are blocked, and trypsinogen is secreted into blood. Babies with CF have high levels of IRT",
            "slide 17: blood test for IRT: elevated levels suggest pancreatic insufficiency and increased risk of CF. positive result may be confirmed by second sweat test or dna testing",
            "slide 18: sweat chloride test: gold standard",
            "slide 19: sweat collection",
            "slide 20: chloridometer: coulometric titration",
            "slide 22: Inflammatory Bowel disease (IBD): two major types – crohn’s disease (CD) and ulcerative colitis (UC). Similarities on slide",
            "slide 23: differences between CD and UC",
            "slide 24: diagnosis of IBD: mainly based on clinical features, barium, x-rays, colonoscopy, and biopsy. Laboratory testings on slide",
            "slide 25:C-reactive protein (CRP)",
            "slide 26: CRP testing: principle-enhanced immunoturbidimetric Assay principle",
            "slide 27: ASCA testing",
            "slide 28: pANCA testing",
            "slide 29: ASCA and pANCA ASCA positive and pANCA negative – crohns. ASCA negative and pANCA positive – ulcerative colitis",
            "slide 30: fecal calprotectin",
            "slide 31: algorithm for IBD"
        ]
    },
    {
        "pptName": "L3 – Protein Electrophoresis",
        "slides": [
            "slide 3: serum proteins",
            "slide 4: analytical methods: chemical and immunochemical, protein electrophoresis (PEL) – to detect monoclonal proteins",
            "slide 5: Protein electrophoresis: principle – separate in electrical field. Mobility depends on charge, size and medium",
            "slide 7: migration according to charge",
            "slide 8: migration according to size: smaller is faster",
            "slide 9: gel electrophoresis systems: components",
            "slide 12: specimen: PEL performed on serum rather than plasma. Serum vs plasma – serum has no clotting factors",
            "slide 13: serum protein electrophoresis: chart of types",
            "slide 14: albumin; principle functions – maintain oncotic pressure and transport substances. Hypoalbuminemia often results in edema",
            "slide 15: prealbumin: sensitive marker for nutritional status. Faster than albumin. Also called transthyretin",
            "slide 16: alpha-1 antitrypsin: proteins inhibitor that inactivates trypsin activity. Decreased in 1-antitrypsin deficiency. Genetic disease due to emphysema or liver cirrhosis",
            "slide 17: alpha-2 macroglobulin: protease inhibitor. Increased in nephrotic syndrome because body makes more protein in response to protein loss",
            "slide 18: haptoglobin (Hp): binds to hemoglobin released from dead RBC. Serum levels will be low in intravascular hemolysis because Hp become depleted in the large amounts of Hb. A screening test for intravascular hemolytic anemia",
            "slide 19: ceruloplasmin: copper carrying protein. Serum concentrations low in Wilson’s disease. Screening test for Wilson’s Disease",
            "slide 20: transferrin: ion transport protein. Serum concentration increase in iron deficiency anemia. Increased in iron overload diseases e.g. hemochromatosis",
            "slide 21: C3 complement: major component immune system. Decrease in complement deficiency. Increased in inflammatory reaction",
            "slide 23: C-reactive protein (CRP): defence against bacteria and foreign substances. Not detected in ELP due to its low levels. Increased in acute phase response such as trauma, acute and chronic infection and inflammation",
            "slide 24: acute phase reactants (APR): class of proteins whose serum concentrations increase or decrease rapidly in response to inflammation, trauma or malignancy. Positive APR: 1-antitrypsin, haptoglobin, cerulopasmin, C3 and CRP. Negative APR: albumin, prealbumin and transferrin",
            "slide 25: specific serum proteins: chart",
            "slide 26: immunoglobulins (Ig): antibodies made by immune system. Five classes: IgG, IgA, IgM, IgD and IgE",
            "slide 27: Immunofixation (IFE): Used to identify the type of the M-protein found by PEL. Protein separated by PEL, antibodies to heavy and light chains added to gel. AB-Ag precipitates form, fixed in gel"
        ]
    },
    {
        "pptName": "L4 – Protein Electrophoresis 2",
        "slides": [
            "slide 5: normal pattern",
            "slide 7: hypoalbuminemia: common symptom is picking of skin",
            "slide 8: causes of hypoalbuminemia",
            "slide 9: abnormal gel electrophoresis patterns",
            "slide 10: hypergammaglobulinemia: increase of immunoglobins, polyclonal and monoclonal increase",
            "slide 11: polyclonal increase in gamma region: seen in chronic infection, inflammation, and autoimmune diseases",
            "slide 12: monoclonal increase of Ig: also called monoclonal gammopathy. Increase in sharp narrow band called M-protein",
            "slide 13: monoclonal gammopathy",
            "slide 14: what is multiple myeloma",
            "slide 15: how common is myeloma",
            "slide 16: CRAB symptoms – calcium, renal failure, anemia, bone lesions for myeloma",
            "slide 17: diagnosis of myeloma: requires two of following",
            "slide 18: types of multiple myeloma",
            "slide 19: identify type of M protein by immunofixation",
            "slide 20: Waldenstrom’s Macroglobulinemia: lymphoma producing IgM monoclonal protein. Causes hype-viscosity. Clinical features.",
            "slide 21: MGUS: at risk for developing myeloma. Monitored not treated",
            "slide 22: urine protein electrophoresis: normally bit of albumin and transferrin, no bands visible or trace bands in usual locations",
            "slide 23: urine protein electrophoresis: proteinuria – glomerular or tubular",
            "slide 24: urine protein electrophoresis: Bence Jones Protein",
            "slide 25: laboratory evaluation of monoclonal gammopathy: perform electrophoresis to detect M-protein, measure amount of M-protein, identify type of M-protein by immunofixation"
        ]
    },
    {
        "pptName": "L5 – Vitamin D and Calcium",
        "slides": [
            "slide 3: biochemistry of vitamin d: D2 (ergocalciferol – from diet) and D3 (cholecalciferol – produced in skin on exposure to sunlight)",
            "slide 4: vitamin d metabolism: mechanism/pathway",
            "slide 5: Functions of 1,25(OH)2D: a steroid hormone regulating Calcium and phosphate (PO4) metabolism. Intestine (increase Ca and PO4 absorption), kidney (increase reabsorption of Ca and PO4), bone (increase bone mineralization indirectly)",
            "slide 6: Absorption of Ca2+ from the gut: pathway",
            "slide 7: Regulation of 1,25(OH)2D Formation: pathway",
            "slide 8: Sources of Vitamin D: endogenous (skin) or exogenous (diet and supplements)",
            "slide 9: Vitamin D Deficiency: causes (inadequate exposure to sunlight, nutrient deficiency, intestinal disease, liver disease, kidney disease) and clinical conditions (deficient bone mineralization due to low Ca and PO4, rickets in children and osteomalacia in adults)",
            "slide 10: Vitamin D Deficiency: rickets (bowed legs, fracture, tetany, muscular weakness) and osteomalacia (bone pain and muscle weakness, softening of bones and fracture)",
            "slide 11: Vitamin D Deficiency: other health problems – osteoporosis, cardiovascular disease, diabetes, breast and colon cancer, autoimmune diseases",
            "slide 13: Laboratory Assessment of Vitamin D Status – which form to measure? chart",
            "slide 14: Analytical Methods for Vitamin D Status: immunoassays measure 25(OH)D2 and D3; Chromatographic assays measure 25(OH)D3 and D2 independently (gold standard). Other lab tests: calcium normal or slight low, PTH increases offsets calcium reduction, alkaline phosphatase increases",
            "slide 15: Calcium – Biochemistry: 99% in bone. Three forms in plasma – free/ionized 50% (active), protein bound (mainly albumin) 40%, complexed with citrate and phosphate 10%",
            "slide 16: Equilibrium between protein-bound, complexed, and free calcium: most protein bound is with albumin. Binding is pH dependent. Decrease pH increases free Calcium because more hydrogen binds to albumin and calcium binding decreases. pH effects free calcium but not total calcium levels",
            "slide 17: effect of albumin on calcium forms: changes in albumin affects total calcium levels but not free calcium levels",
            "slide 18: roles of calcium: bone (structural component) in the form of hydroxyapatite. Neuromuscular activity (membrane excitable, NT release, muscle contraction). Coenzyme of coagulation factors",
            "slide 19: calcium – regulation: hormones are parathyroid hormone (PTH) and 1,25(OH)2D",
            "slide 20: effects of parathyroid hormone: most important regulator of blood calcium. Bone – increase calcium and phosphate absorption. Kidney increases calcium and decreases phosphate reabsorption and increase 1,25 (OH)2D. Net effect in plasma – increase calcium and decrease phosphate; in urine increase calcium and increase phosphate",
            "slide 21: calcium homeostasis: pathway (why does pth stimulate calcium reabsorption and decrease phosphate reabsorption in kidney)",
            "slide 22: hypocalcemia: causes – hypoalbuminemia, renal failure, hypoparathyroidism (low PTH), vitamin d deficiency (high PTH), artefactual (EDTA tube)",
            "slide 23: hypocalcemia: clinical features/symptoms – neurological problems (increased neuromuscular excitability – tingling, tetany, mental changes), cardiovascular disorders (hypotension, arrhythmias)",
            "slide 24: hypercalcemia: causes – primary hyperparathyroidism, malignancy",
            "slide 25: hypercalcemia: hyperparathyroidism (often due to parathyroid adenoma. majority are post menopausal women. Asymptomatic). Malignancy (due to PTH related peptide (PTHrP) which has similar structure to PTH, binds to PTH receptors, mimics PTH effects in the bone and kidneys. Low 1,25(OH)2D. PTH undetectable)",
            "slide 26: hypercalcemia: clinical features/symptoms – bone pain, neurological (weakness, lethargy, confusion, depression), GI problems (anorexia, abdominal pain, nausea, vomiting, constipation), renal features (thirst, polyuria, renal calculi). Most of the clinical features are due to reduced neuromuscular activity",
            "slide 27: laboratory testing: total calcium – calorimetric assay (affected albumin (low albumin have low total calcium but normal free calcium. Adjusted with equation Ca+0.02(40-albumin). Free calcium (more accurate, ion selective electrode. Changes in pH can cause free Ca to change)",
            "slide 28: interpretation of results: chart of levels/diseases caused"
        ]
    },
    {
        "pptName": "L6-7 – Trace Elements",
        "slides": [
            "slide 3 what are trace elements: group of minerals in body at low concentrations. Essential or toxic elements",
            "slide 4: essential trace elements; required for body’s health and normal function. Obtained from diet (micronutrients). Deficiency causes metabolic disorders; high levels are toxic. Most function as cofactors",
            "slide 5: Iron (Fe): most abundant trace element. 70% of total body iron is located in RBC hemoglobin. Each hemoglobin contains 4 heme units with iron atom. Only 0.1% in plasma, almost all bound to transferrin",
            "slide 6: iron metabolism: pathway",
            "slide 7: iron deficiency: most common cause of anemia. Main causes; chronic blood loss, poor diet or GI absorption. Symptoms are primarily due to anemia: fatigue, dizziness, headache, pale skin",
            "slide 8: iron toxicity: acute - GI erosion symptoms, heart problems, metabolic acidosis. Chronic iron overload (hemochromatosis) - Hereditary: Canada’s most common genetic disorder caused by HFE gene mutation, leading to increased intestinal absorption of iron. Excessive iron deposits in the liver, heart, and other organs, leading to organ damage/ Acquired: multiple blood transfusions. Treatment: venesection",
            "slide 9: lab testing for iron deficiency: Complete blood count (CBC) with blood smear: microcytic hypochromic. Decreases in plasma ferritin (early marker). Plasma iron has limited value because of diurnal changes. ZPP increases",
            "slide 10: lab testing for iron overload: acute iron poisoning – increases in plasma iron. Hemochromatosis - Plasma ferritin increases. Plasma iron increases. Transferrin saturation↑ (>60%). Liver biopsy for iron determination. The HFE genetic testing",
            "slide 11: zinc (Zn): cofactor of many metalloenzymes, regulating cell growth and immune functions. Important for wound healing. In blood 80% of zinc in RBC, 20% in plasma largely bound to albumin, Acrodermatitis enteropathica (inherited form). Lab testing – blood zinc determination",
            "slide 12: zinc deficiency: causes - Inadequate dietary intake or malabsorption, chronic TPN. Symptoms – skin lesion/impaired wound healing, Diarrhea, growth retardation in children, ",
            "slide 13: copper (Cu): cofactor for enzymes. Key role in RBC formation and brain function. Diagram of metabolism pathway.",
            "slide 14: copper deficiency: causes – gastric bypass surgery or chronic TPN. Symptoms - Microcytic hypochromic anemia (iron-resistance), neurological problems, menkes diseases (genetic disease) (impaired absorption and transport of Cu, plasma Cu low development delay, and \"kinky hair\", death during early childhood",
            "slide 15: copper toxicity: Wilson’s disease: genetic disease, Biliary excretion of Cu and incorporation in ceruloplasmin decreases. Plasma ceruloplasmin and total Cu decreases; free Cu increases and deposits in the liver, brain and cornea. Urine Cu increases",
            "slide 16: laboratory testing for wilson’s disease",
            "slide 17: toxic elements (heavy metals): no nutritional value. Most common – arsenic, cadmium, lead, mercury",
            "slide 18: arsenic (As): odourless, colourless, tasteless. Most dangerous",
            "slide 19: arsenic (As): three forms – gas (most toxic), inorganic is toxic (aresnite more than aresenate), organic is less toxic then inorganic (arsenobetaine and arsenocholine are nontoxic)",
            "slide 20: sources of arsenic: occupational, environmental, dietary",
            "slide 21: biochemical effects of arsenic: gas inhibits erythrocyte Na-K pump, causing hemolysis. Inorganic arsenic - Inhibits erythrocyte Na-K pump, causing hemolysis (bind SH groups, inhibits ATP production, blocks PO4 in mitochondria). Accumulates in hair/nails (binds to keratin), crosses placenta",
            "slide 22: inorganic arsenic metabolism: pathway – 90% removed from blood in few hours",
            "slide 23a: symptoms of arsenic poisoning: acute - Abdominal pain, vomiting, garlic breath odour, and bloody diarrhea, dehydration and hypotension. Neuropathy with numbness and tingling in the extremities. Large doses affect the heart and lead to death",
            "slide 23b: symptoms of arsenic poisoning: chronic - Persistent diarrhea. Neuropathy (fatigue, weakness, dizziness etc.). Hair loss, skin pigmentation, ulcers, Mees’ lines. Increased cancer (skin, lung, liver, GI, kidney)",
            "slide 24: laboratory testing for arsenic: urine (preferred sample is total and inorganic testing). Blood (not a good sample). Hair and nails (inorganic only)",
            "slide 25: cadmium (Cd): half life is 10-20 years. sources – occupational and environmental",
            "slide 26: biochemical effects and metabolism of cadmium: Well-absorbed by inhalation. In the blood, 90% of Cd binds to RBC and is transported to the liver. In the liver, Cd binds to SH groups in metallothionein (detoxification). Cd-metallothionein complexes (Cd-MT) are transported to the kidneys for excretion. Renal excretion is limited, Cd is built up in the kidneys, causing kidney damage. Does not cross the placenta",
            "slide 27: symptoms of cadmium toxicity: acute - bronchial irritation and pulmonary edema. Chronic - Kidney disease and itai-itai bone disease, increased risk of lung and prostate cancer",
            "slide 28: mercury (Hg): three forms – elemental, inorganic, organic. Toxic in any form (organic > inorganic > elemental). Mercury is most notable  for its neurological effects (mad hatter syndrome)",
            "slide 29: sources of mercury: list",
            "slide 30: biochemical effects of mercury: T1/2 = 60-90 days in blood       (organic > inorganic). Binds SH groups, inhibiting choline acetyl-transferase activity and acetylcholine (ACh) production. Binds SH groups, inhibiting choline acetyl-transferase activity and acetylcholine (ACh) production. Cross the placenta to induce neurological and teratogenic effect",
            "slide 31a: mercury metabolism and toxicity: elemental - Poorly absorbed by the GI tract, its vapor well absorbed by the lungs. Inhalation of Hg vapor can cause. neurological problems (mad hatter syndrome). Mainly excreted in urine",
            "slide 31b: mercury metabolism and toxicity: inorganic - Can be absorbed by the skin, <10% is absorbed by the GI tract. Trapped mainly in the kidneys and can cause kidney damage. Excreted in urine",
            "slide 32c: mercury metabolism and toxicity: organic - Well absorbed by the GI tract. Enters the brain, causing neurological problems (Minamata disease). Excreted primarily in feces rather than in urine",
            "slide 32: Minamata disease: industrial Hg dumped into Minamata Bay. Accumulated in fish.",
            "slide 33: laboratory testing for mercury: blood – any form, preferred for organic. Urine – for elemental and inorganic. Hair and nails – for organic.",
            "slide 34: Lead (Pb)",
            "slide 35: Sources of lead: occupational and environmental",
            "slide 36: lead metabolism: absorption – Ingestion (most common route), inhalation or the skin. Distribution - Bone: contains >90% of the total body Pb, Blood: Pb is concentrated in RBC (binds to hemoglobin), Soft tissue: distributed widely. Excretion – mainly urine. Crosses placental",
            "slide 37: how long does lead stay in body?: Half-life of Pb: Blood: 30 days, Soft tissue: 40 days, Bone: 28 years. In children, Pb deposits to rapidly growing long bones and inhibits skeletal growth. Heavy exposure can leave a \"lead line\" in bone. Pb stored in bone is released into blood years later",
            "slide 38: how does lead affect the body?: main targets are brain, hemopoietic system and kidneys",
            "slide 39: lead inhibits heme synthesis: pathway/mechanism: lead affects second reaction and inhibits it and 7th one which catalyzes last reaction (doesn’t let iron to bind)",
            "slide 40: lead poisoning increases ZPP: because lead inhibits enzyme activity, iron can't be inserted and zinc replaces it to form ZPP",
            "slide 41: children are more susceptible to lead poisoning: greater GI absorption (40%) than adults (10%). Have incomplete blood-brain barrier",
            "slide 42: symptoms: in children - anemia, growth failure, impaired mental development (irreversible), ADHD, learning disabilities, and hearing loss (auditory nerve damage). In adults - anemia, peripheral neuropathy, hypertension, chronic renal failure, and infertility.",
            "slide 43 – laboratory testing for lead: CBC with blood smear (RBC are microcytic hypochromic), blood lead level (BLL) is the best test for acute Pb exposure. blood ZPP level is an indirect measure of Pb exposure, but not specific for Pb. Hair analysis is useful for chronic exposure, but has low sensitivity.",
            "slide 44: treatment for heavy metal poisoning: remove source, chelation therapy, supportive therapy",
            "slide 45: analytical method: atomic absorption spectroscopy (AAS) and Inductively coupled plasma-mass spectrometry (ICP-MS)",
            "slide 46: atomic absorption spectroscopy (AAS): principle – atoms can absorb light at specific wavelengths. Amount of light absorbed is proportional to concentration of absorbing atoms.",
            "slide 47 - Inductively coupled plasma-mass spectrometry (ICP-MS): principle - ICP uses a high temperature plasma torch (8000 degrees C) to convert elements to ions. These ions pass into a mass spectrometer which separate them based on their mass-to-charge (m/z) ratio",
            "slide 48: two designs of ICP-MS: Quadrupole ICP-MS (low resolution) and Sector Field ICP-MS (high resolution because higher mass resolving power so it can separate interferences – gold standard)"
        ]
    },
    {
        "pptName": "L4_Knauer-TDM",
        "slides": [
            "SLIDE #: 1 || ",
            "SLIDE #: 2 || Therapeutic Drug  Monitoring\nClinical Biochemistry 3386b\nMichael Knauer PhD, FCACB  michael.knauer@lhsc.on.ca\n",
            "SLIDE #: 3 || Therapeutic Drug Monitoring\nObjectives:\nTDM in the context of pharmacological principles\nThe parameters involved in TDM\nThe role of appropriate sampling in TDM\nSpecial case examples – particular applications in  TDM.\n",
            "SLIDE #: 4 || Therapeutic Drug Monitoring\nWhat is it and Why is it Done?\nTherapeutic Drug Monitoring\n(TDM) refers to the  measurement of drug  concentrations in the blood  or plasma of a patient to  keep it within a target range.\nTDM provides information  about the adequacy of  dosing of the drug regimen  and the likelihood of toxicity  associated with the drug.\nTDM\nDosing\nToxicity\nMonitoring\nThings that affect tdm is dosing, compliance/monitoring (person is taking it or not), toxicity (taking too much)\n",
            "SLIDE #: 5 || Which Drugs need TDM?\nNarrow Therapeutic Range\nSignificant pharmacokinetic variability\nA reasonable relationship between plasma  concentrations and clinical effects; however the  pharmacological effect is hard to measure\nMedications prone to drug interactions\nCompliance issues or drugs prone to therapeutic  failure\n",
            "SLIDE #: 6 || Why do Therapeutic Drug Monitoring  (TDM)?\nNarrow Therapeutic Range\nDrugs have therapeutic ranges\nTaking a drug orally is in this diagram \nAs you take it, concentration goes up peaks, and as eliminated it goes down\nReaches blue in is the minimum therapeutic effect\nOnce it goes below level of effect there is no pain relief \nToxic concentration is exceeding right\nMore dangerous drugs have smaller therapeutic ranges – harder to keep drug level effective yet not toxic\nMost durgs tho, you don’t take once, you take repeatably\nThe challenge is to keep the peak and trough in the therapeutic range in each successive dosing\nDpeening on range, it could be hrader or easier to keep the drug in the safe zone\n",
            "SLIDE #: 7 || Therapeutic Range with  Repeated Dosing\nBlue line is continuous infusion (IV) / red Is oral\nHow constant influion would get you up in the range and keeps you in the correct range so you don’t have overdosing and eventually get to steady state concentration\nAs long as noghting perturbes steady state that dose will keep you in the therapeutic range\n",
            "SLIDE #: 8 || Why do Therapeutic Drug  Monitoring (TDM)?\nVariable  Pharmacokinetics\nWhat the body does to the drug\nAbsorption\nDistribution\nMetabolism\nElimination\nWhen you first take it you have to absorb it from GI tract\nDistrinbute it around body through venous system and get to site of action\nMetabolism – via liver and kidney to eliminate to more polar molecules or deactivate the drug to inactive metabolite (also some cases wehre you take inactive drug and activate in body)\nEliminate is getting rid of it \n",
            "SLIDE #: 9 || Why do Therapeutic Drug  Monitoring (TDM)?\nVariable  Pharmacokinetics\nNot One Dose Fits All\nLevy\nBioDrugs, 2001\nInter-patient Variability in Cylosporine  Blood Levels in Renal Transplant Patients\nDiff people have diff pharmacokinetics\nLines don’t overlap – peak happens at diff points for diff people\nPeak height (amount of absorption) different between people\nThere is significant variability in terms of giving same drugs nad what happens after taking it \n",
            "SLIDE #: 10 || Pharmacokinetics – Fate of a Drug taken  Orally\nFirst Pass  Effect\nThere are rate equations to monitor drugs when they come into body\nTake it, absorbed in small intestine, portal vein to liver which converts from parent molecule to metabolite, which is then excreted or sent to bile to be eliminated\nWhen you take a drug not all the drug gets into circulation; percentage gets eliminated before and bioavailability (amount of drug that makes it into systemic circulation – e.g. 70% bioavailability means 70% makes it to ciruclaiont  after liver– you can bypass this by IV which has 100% bioavailability)\nDrug parent and drug metabolite are in equilibrium with compartments – e.g. compartment could be fat store, muscle, or single organ\nEffect compartment is when drug ofi nterest and organ of interest (eg. Knee for knee pain); drug and metabolite would all distribute\nThey can equilibrate back to centre compartment and this is where you can eliminate the drug (through kidney or liver by urine or feces)\n",
            "SLIDE #: 11 || The effect of a single oral dose of a drug  on its concentration in serum/ plasma\nExample of a two compartment model\nSlow eliminatation \nModelled by two rate curces\nDrug distributing into tissues in the body (faster rate)\nSlower elimination rate – drug eliminated through urine or feces\n",
            "SLIDE #: 12 || T1/2 (Elimination) Half  Life\nTime required for the concentration  of a drug to be reduced by half  (50%).\nNot all drugs are thes same for half life\n",
            "SLIDE #: 13 || Half Lives - Examples\nAcetaminophen –\n2 h\nCodeine –\n3 h\nTheophylline –\n8 h\nCarbamazepine –\n15 h\nLithium –\n22 h\nDigoxin –\n39 h\n(1.6 d)\nSirolimus –\n69 h\n(2.9 d)\nPhenobarbital –\n99 h\n(4.1 d)\nDigoxin drug for heart\nSirolimus immunosuppresent\nPhenobarbital antieppilypetic\nNot everyone has same half life\n",
            "SLIDE #: 14 || The effect of multiple identical  doses on drug concentration\nCmax & Cmin = maximum & minimum  concentrations\nC = average steady state concentration  MTC = minimum toxic concentration  MEC = minimum effective  concentration\nAUC = Area Under the Curve (a  measure of the exposure of the  patient to the drug)\nτ = dosing interval\nMinimul effective concentration is blue zone\nMiddle is therapeutic range\nEach oral dosing gets you into therapeutic range and you hit your steady state\nTime between dosing is dosing interval - it is approximating half lfie of the drug (take it once a day if half life is 24 hours e.g.)\nAUC is area under curve – can tell you how well the drug is absorbed and how much exposure individual gets\nC trough – what happens right before next oral dose\nMean is steady state concentration\nHow long does it take to get to steady state? 5 half lives to get to stady state or 5 half lives to eliminate the drugs\n",
            "SLIDE #: 15 || Effect of frequency of dosing\nFrequency and dosing amount to keep it in range? In this example you see:\nInfusion of drug at 28 mg/h – reaches steady state and is pretty consistent \nSame drug at 224 mg/h (three times in a day – tid) orally, you can see effects as it peaks and troughs as it gets to theraptutic range – doesn’t matter what dosing you took it takes same amount of time to get into the range (5 half lives)\nConveniemce is having to take the drug once a day\nVurve has wider swings in peaks and troughs at higher concetration \nFor a narrow range, you want to avoid more swings so you have to lower does and increase dosing interval to keep swings smaller and keep it in thereapuetic range\n",
            "SLIDE #: 16 || Loading doses\nIf you can’t wait 5 half lives to get to therapeutic level in a drug so this is where loading doses come in\nDrugs wit hlong half life and you need effect rapidly (e.g. anticlotting drug) you want to give massive dose right off the bat (loading dose) and then maintance dose (smaller dose) to keep htem in the range\n",
            "SLIDE #: 17 || Loading Dose -  Calculation\nC = 1.44 t1/2 D\nVdT\nWhere C is the average drug concentration in plasma  Vd is the apparent volume of distribution\nt1/2 is the elimination half-life\nD is the maintenance dose for this drug conc’n  T is dosage interval (time between doses)\nVd is where the theoretical space of where the drug goes in body – 5-6 L than the drug stays in blood volume, 1000 L then it stays in circulation and starts going into the tissue\nYou can look up Vd is for a drug\n",
            "SLIDE #: 18 || Loading Dose -  Calculation\nC = 1.44 t1/2 D\nVdT\nThe total amount (weight) of drug in the body\n=\tCVd\nTherefore, the loading dose\tD*\t= CVd\nD*\t= CVd\t= 1.44 t1/2 D\nT\n",
            "SLIDE #: 19 || Elimination Kinetics\nFirst Order  Kinetics and  the Rule of 5\no 50%\no 25%\no 12.5%\no 6.25%\no 3.1% (97%\neliminated)\nTwo ways drugs are eliminated – 0 order kinetics or 1st order kinetics\n0 order kinetics is same amount of drug eliminated over time; 2 mg eliminated of drug per minute\nIt is how alcohol is metabolized – you metabolzie same amount of alcohol in same amount of time \nFirst order kinetics is wehre you metabolize same proportion of drugs per unit time\n2% of drug metabolized per minute\nThis matters when it comes to dosing - if you had something with first order kinetics it means it drops out of pocket range quicker than 0 order kinetics (which takes longer for it to come down from toxic rnage)\nMost drugs behave in 1st order\nFirst half life – 50% of drug remaining\nSecond half life – 25% drug left\n5th – drug essentially eliminated\n",
            "SLIDE #: 20 || The Clinical Need\tfor  TDM\nCompliance\n(forgetfulness, etc.)\nTitration of optimal dosage\nVariation in drug metabolic rates (genetics, other drugs)\nPresence of disease (eg. renal, hepatic)\nAltered physiological states (youth, age, pregnancy)\nOverdose\nIdentification and quantitation\nChildren’s enzyme system don’t prform same way as adults\nPregnancy can cause internal changes to blood volume, binding proteiins in blood etc. \nTo try and identify if someone overdosed or how much of an overdose they have\n",
            "SLIDE #: 21 || Classical Criteria for Determining  the Necessity for TDM of a Drug\nNarrow but reasonably well defined  therapeutic range\nPoor correlation between dosage and serum  concentration\nGood correlation between serum  concentration and therapeutic effect\nTherapeutic effect which is hard to measure\nSpecific, accurate, and reproducible  method\n",
            "SLIDE #: 22 || When to sample?\nAt steady-state\nTrough\n-Just before the next dose is given (e.g. one half-life after\nthe last dose)\nWhen toxicity is suspected\nTimed sampling following a dose\nUsed to estimate AUC\nEg C2 for ISD\nRandom (last resort)\nOverdose (accidental or deliberate)\nPatient non-compliance (last dose unknown)\nTrough is best time to take it for oral dosing\nTime to catch peak and trough\nCurve estimation is exposure individual gets from the drug\nOnly do random during overdose and maybe used to determine drastic measures you may have to take or when you don’t know when they took the drug\n",
            "SLIDE #: 23 || Examples of Trough Measured Drugs (FYI):\nCore Lab:\nvalproic acid, carbamazepine,  lithium, phenytoin, phenobarbital,  vancomycin\nSpecialty Lab:\tlamotrigine, gabapentin, topiramate,  clobazam, clonazepam, clozapine, risperidone,  haloperidol, olanzapine, nitrazepam, amiodarone\nMeasure drug in core and speciality labs\nDepends on method where the drug measruements go\nDrugs with servious consequences in core labs because of fast turnaround time e.g. epileptics, antibiotics\nSpeciality labs because you need selectivity to determine parent/metabolite or if drug you can’t do in core\n",
            "SLIDE #: 24 || Free Drug Monitoring\nFree drug monitoring\nIts not just drug and metabolite, but drug, free drug, drug bound to protein, and then metabolite that you have to consider\nProtein bound drug is normally albumin or positively charged drug, and alphaone/glycoprotein for negatively charged drug\nIn some cases, measuring free amount is better for concentraiotn/effect than total amount (which is free + protein bound)\n",
            "SLIDE #: 25 || Criteria for Free Drug Monitoring\nTDM is necessary\nDrug highly (> 70%) bound to plasma proteins  Free drug level correlates poorly with total drug\nconcentrations\nAlso when balance of bound to not can be disturbed negatively for e.g. if you take another drug or changing free fatty acids present (depends on the drug) or changing plasma protein concetraions (if someone is becoming malnourished)\n",
            "SLIDE #: 26 || Free Drug Monitoring\nCo-administered highly bound drugs\nElevated free fatty acids\nChanges in plasma protein concentration\n",
            "SLIDE #: 27 || Factors affecting Albumin  Concentration\nDecreased\nMalnutrition  Renal Disease  Malabsorption\nProtein-losing Enteropathy  Hepatic Disease\nBurns\nTissue Damage\nInflammation\nIncreased\nDehydration  Cancer\nRenal – less protein in blood therefore less binding capacity\nProtein-losing Enteropathy\nLosing protein through gut \nHepatic Disease\nNot produring proteins\nBurns  - disturbances in protein\n^^ all these things increase free drug and lower albumin (protein)\n",
            "SLIDE #: 28 || Free Drug Monitoring\nThe anticonvulsant drugs, phenytoin, and valproic  acid historically are the only drugs for which free  drug monitoring has been done routinely.\nFree drug is better for these than total drug \nThere are total drug assays available for these in the core lab quickly; specialized lab does free from bound drug \n",
            "SLIDE #: 29 || TDM Case Examples\n",
            "SLIDE #: 30 || Therapeutic Drug Monitoring of  Immunosuppressant Therapy: Balancing  Efficacy and Toxicity\n",
            "SLIDE #: 31 || Transplantation: a treatment for end-stage organ failure\nKIDNEY\nLIVER\nLUNG\tHEART\nPANCREAS\nPrimary Cause*:  Diabetes 27.5%\nHypertension 25.9%\nGlomerulonephritis 16.8%\nOther 18.5%\nCystic Kidney 11.2%\n* adults in the US, 2011\nScientific Registry of Transplant Recipients\nPrimary Cause*:  DM type I\t85.3%  DM type II\t\t6.1%  Other/unk\t\t 7.8%\nDM type unk. 0.9%\nPrimary Cause*:\nHCV\t23.5%\nOther/unknown 22.3%\nMalignancy\t20.9%\nAlcoholic liver\t17.6%\nCholestatic\t9.1%\nAcute hepatic necrosis 4.0%  Metabolic liver disease 2.5%\nINTESTINE\nPrimary Cause*:  Other SGS\t58.1%\nNecrotizing EC 12.4%\nOther\t12.4%\nCongen. SGS\t10.9%\nPseudo-obstruc 6.2%\nPrimary Cause*:  Cardiomyopathy 54.4%\nCoronary Artery 37.9%\nCongenital dis.\t3.6%\nOther/unknown\t2.7%\nValvular disease  1.4%\nPrimary Cause*:  Restrictive lung dis.\t49.1%  Obstructive lung dis. 32.0%\nCF or immunodef. 14.1%  Pulmonary vasc. dis. 4.4%  Other/unknown\t0.4%\nYou reject organs due to immune systems \nT celsl look for markers outside cells that detect foreign things and they try to eliminate\nIn transplantation, you try to get markers as close to recipient as possible\nTherefore you suppress immune sysmte so they don’t recognize transplant organ as foreign and don’t try to get rid of it \n",
            "SLIDE #: 32 || Organ Transplantation in Ontario\nStatistics from Trillium Gift of Life\n",
            "SLIDE #: 33 || Organ Rejection\n",
            "SLIDE #: 34 || Transplant Rejection and  the\tImmune System\n",
            "SLIDE #: 35 || Solution –\nImmunosuppression\nImmunosuppressants are a class of drugs that suppress or reduce the  strength of the body’s immune system, attempting to stop the  immune system from reacting to the transplanted organ.\nThey all have different mechanisms of action in terms of getting t cell to recognize antigens \n",
            "SLIDE #: 36 || Mechanism\tof Action\nNature Clinical Practice Cardiovascular Medicine (2006) 3, 203-212\nDon’t need to know pathway but various parts you can block with immunosuppresents\n",
            "SLIDE #: 37 || Cyclosporine A\nUsed as a first-line  immunosuppressant\nRevolutionized field of  organ transplantation,  dramatically reducing  acute rejection rates\nCyclic peptide of 11  amino acids from the  fungus Tolypocladium  inflatum\nInhibits calcineurin  through cyclophilin to  block NFAT-mediated  transcription of IL-2\nReally big, complex structure\n",
            "SLIDE #: 38 || Tacrolimus\n23-membered macrocyclic  lactone from bacterium  Streptomyces tsukubaensis\nBlocks production of IL-2  (cytokine) and activation of  immune system\nCalcineurin inhibitor 100x more  potent than cyclosporine\nLonger half-life than\ncyclosporine\nTrials comparing tacrolimus  and cyclosporine indicated a  reduced risk of acute  rejection with tacrolimus\nCurrently, predominant first-  line immunosuppressant drug  used, particularly in the US\nBlocks fat activation as well\nThis is now drug of choice for organ transplantation\n",
            "SLIDE #: 39 || Sirolimus\nMacrolide antibiotic  structurally related to  tacrolimus\nIsolated from a bacterium\ndiscovered on Easter Island\nBinds FKBP12 and the  complex inhibits mTOR and  blocks signaling  downstream of IL-2\nInhibits IL-2-mediated  activation of T and B cells\nUsed in place of and in  combination with  cyclosporine and  tacrolimus\n",
            "SLIDE #: 40 || Immunosuppressive Drug  Regimens\nLow Risk\nFirst time  transplant  recipient\n<20% panel  reactive  antibodies\nIntermediate  Risk\n20-80% panel  reactive  antibodies\nHigh Risk\nRejected one  or more  transplants\n>80% panel  reactive  antibodies\nTherapy is based on the transplant recipient’s\nimmunological risk and donor factors\nIntensity of\nImmunosuppression Therapy\nDetermine risk of individual for rejection\nLow risk you may give them one immunosuppresent\nIntermediate or poor risk\nUse more intensive immunotherapy e.g. two drugs\nMight possible interact with each other\n",
            "SLIDE #: 41 || Immunosuppressive  Drug Regimens\nType of Organ Transplant\nPatient age (adults vs. children)\nCo-medications or patient conditions\nInitial therapy versus long-term maintenance\nTypical initial and long-term maintenance regimens  use a combination of medications including\ncalcineurin inhibitor (tacrolimus or cyclosporine)\nantiproliferative agent (mycophenolic acid or  azathioprine)\nwith or without corticosteroids\nHow you choose depends on four 4 points on slide\nInitial therapy – hit immune system hard at first\nLong-term – if you want to sustain it long time \n",
            "SLIDE #: 42 || Balancing Efficacy and  Toxicity\n•\n•\nSub-therapeutic drug levels increase the risk of  acute organ rejection\nImmunosuppressive drugs used in organ transplant\nhave toxicities\nDose dependent nephrotoxicity  Increased risk of infection\nKDIGO Clinical Practice Guideline for the\ncare of kidney transplant recipients 2009\nBalance which drugs you give for therapy/efficacy and toxicity \nConcentraions used to make sure you are not at risk for losing organ\n",
            "SLIDE #: 43 || Therapeutic Ranges for  Immunosuppressant Drugs\n(trough concentration)\nDrug\nTime\nKidney\nLiver\nHeart or Lung\nCylcosporine  C0 (C2)\n(ng/mL)\nInitiation  Maintenance\n150-250 (>1200)\n75-150 (800)\n250-350 (>1000)\n100-200 (600)\n250-350 150-\n250\nTacrolimus  (ng/mL)\nInitiation  Maintenance  Minimizatio  n\n10-15\n5-10\n3-7\n10-20\n5-10\n-\n15-20\n5-10\n-\nSirolimus  (ng/mL)\nInitiation  Maintenance\n5-15\n-\n-\nEverolimus\n(ng/mL)\nInitiation\nMaintenance\n5-15\n3-8\n-\n3-8,3-12\nCurrent Trends in Transplantation. 2009\nHigh level – intiation for the suppression\nMaintenace dose is lwoer\n",
            "SLIDE #: 44 || Variable  Pharmacokinetics\nNot One Dose Fits All\nWhy do Therapeutic Drug  Monitoring (TDM)?\nLevy\nBioDrugs, 2001\nInter-patient Variability in Cylosporine  Blood Levels in Renal Transplant Patients\nSomeone on it \n",
            "SLIDE #: 45 || Drug-Drug\tInteractions\nImmunosuppressant  drugs are heavily  metabolized by the  cytochrome P450  system\nPotential for drug-drug  interactions that may  produce toxicity or  dangerously low levels  of immunosuppression\nLeads to an increased\nrisk of acute rejection\nGhanta et al., Overview of Immuno-  suppression in Renal Transplantation, 2013\nSome one on it should be wary of starting new drugs – could produce toxicity or non-effect of immunosuppesent\n",
            "SLIDE #: 46 || When should TDM be done  for Immunosuppressants?\nKDIGO Clinical Practice Guideline for the\ncare of kidney transplant recipients 2009\nRecommendations on how often you should measure these drugs\n",
            "SLIDE #: 47 || How are Immunosuppressants  Measured?\nMethods\nImmunoassays\nCMIA (chemiluminescent  microparticle  immunoassays) (Abbott)\nExhibit cross-reactivity with  drug metabolites that may  falsely raise values\nCompetitive assay design\nLC-MS/MS\nAble to distinguish  metabolites from the  parent drug\nMultiplex Analysis -measure\nmultiple analytes in one run\nSample: Whole blood  for cyclosporine,  tacrolimus and sirolimus\nSite of Action\nDistribution in blood:\nCyclosporine\n41-58% RBCs, 33-47%\nplasma\nTacrolimus\n80% RBCs, 20% plasma\nSirolimus\n95% RBCs, 3% plasma, 2%  other cellular\n",
            "SLIDE #: 48 || Summary\nImmunosuppression is necessary to reduce the risk  of transplant rejection\nImmunosuppressant Drugs have narrow therapeutic\nranges\nVariable Pharmacokinetics makes dosing  challenging requiring many dose adjustments\nTherapeutic Drug Monitoring for  Immunosuppressants is used to ensure efficacy,  reducing transplant rejection, while avoiding  toxicity\n",
            "SLIDE #: 49 || Therapeutic Drug  Monitoring of Antiepileptic  Drugs\n",
            "SLIDE #: 50 || Epilepsy - Overview\nEpilepsy is a central nervous system disorder (neurological  disorder) in which nerve cell activity in the brain becomes  disrupted, causing seizures or periods of unusual behaviour,  sensations and sometimes loss of consciousness.\nSeizure symptoms can vary widely.\nFrom a simply blank stare for a few seconds to repeated twitching of arms or legs.\nAbout 1 in 26 people in the United States will develop a  seizure disorder.\nNearly 10% of individuals may have a single unprovoked seizure.\nHowever, a single seizure doesn't mean you have epilepsy. At least two unprovoked  seizures are generally required for an epilepsy diagnosis.\nEven mild seizures may require treatment because they can  be dangerous during activities such as driving or swimming.\nTreatment with medications or surgery is ~80% effective\nChildren with epilepsy may also outgrow their condition with\nage.\n",
            "SLIDE #: 51 || Symptoms\nEpilepsy is caused by abnormal activity in brain cells\ncan affect any process your brain coordinates.\nSeizure signs and symptoms may include:\nTemporary confusion\nA staring spell\nUncontrollable jerking movements of the arms and legs\nLoss of consciousness or awareness\nPsychic symptoms\nGenerally classify seizures as either focal or  generalized, based on how the abnormal brain  activity begins.\n",
            "SLIDE #: 52 || Focal Seizures\nWhen seizures appear to result from abnormal activity in  just one area of your brain, they're called focal (partial)  seizures.\nFocal seizures without loss of consciousness (simple\npartial seizures).\nThese seizures don't cause a loss of consciousness. They may alter emotions or  change the way things look, smell, feel, taste or sound. They may also result in  involuntary jerking of a body part, such as an arm or leg, and spontaneous  sensory symptoms such as tingling, dizziness and flashing lights.\nFocal dyscognitive seizures (complex partial seizures).\nThese seizures involve a change or loss of consciousness or awareness. During  a complex partial seizure, you may stare into space and not respond normally  to your environment or perform repetitive movements, such as hand rubbing,  chewing, swallowing or walking in circles.\nSymptoms may be confused with other neurological  disorders, such as migraine, narcolepsy or mental illness.\n",
            "SLIDE #: 53 || Generalized Seizures\no\nSeizures that appear to involve all areas of the brain are called  generalized seizures.\n1.\tAbsence seizures. (previously known as petit mal seizures)\noften occur in children and are characterized by staring into space or subtle body movements\no\no\no\no\no\nsuch as eye blinking or lip smacking. These seizures may occur in clusters and cause a brief loss\nof awareness.\nTonic seizures.\nTonic seizures cause stiffening of your muscles and may cause you to fall to the ground.\nAtonic seizures.\nAlso known as drop seizures, cause a loss of muscle control, which may cause you to suddenly\ncollapse or fall down.\nClonic seizures.\nAssociated with repeated or rhythmic, jerking muscle movements.\nMyoclonic seizures.\nUsually appear as sudden brief jerks or twitches of your arms and legs.\nTonic-clonic seizures. (previously known as grand mal seizures,)\nThe most dramatic type of epileptic seizure and can cause an abrupt loss of consciousness,  body stiffening and shaking, and sometimes loss of bladder control or biting your tongue.\n",
            "SLIDE #: 54 || Risk factors\nAge.\no most common during early childhood and after age 60\nFamily history.\nHead injuries.\nStroke and other vascular diseases.\nDementia.\nBrain infections.\nSeizures in childhood.\n",
            "SLIDE #: 55 || Causes\nEpilepsy has no identifiable cause in about half of those  with the condition.\nGenetic influence.\nIt's estimated that up to 500 genes could be tied to the condition. Certain  genes may make a person more sensitive to environmental conditions that  trigger seizures.\nHead trauma.\nCar accident or other traumatic injury\nBrain conditions.\nBrain conditions that cause damage to the brain, such as brain tumours or  strokes,\nStroke is a leading cause of epilepsy in adults older than age 35.\nInfectious diseases.\nMeningitis, AIDS and viral encephalitis\nPrenatal injury.\nInfection in the mother, poor nutrition or oxygen deficiencies.\nDevelopmental disorders.\nCan sometimes be associated with developmental disorders, such as autism  and neurofibromatosis.\n",
            "SLIDE #: 56 || Antiepileptic Drugs  (AED)\nAntiepileptic Drugs (AEDs)  are used to treat seizure  disorders\nFirst generation of AEDs  were introduced many  decades ago\no\tcarbamazepine, ethosuximide,  phenobarbital, phenytoin and  primidone, and valproic acid\nIn the last 20 years, there  has been a surge of new  generation AEDs entering  the market\nTher Drug Monit 2013;35:4–29)\n",
            "SLIDE #: 57 || Mechanism of Action of  AEDs\nLimit the sustained, repetitive firing of neurons, an  effect mediated by promoting the inactivated  state of voltage-activated Na+ channels.\nEnhanced γ-aminobutyric acid (GABA)–mediated  synaptic inhibition, an effect mediated either by a  presynaptic or postsynaptic action.\no\tDrugs effective against the most common forms of epileptic seizures,  partial and secondarily generalized tonic-clonic seizures, appear to  work by one of these two mechanisms.\nInhibition of voltage-activated Ca2+ channels  responsible for T-type Ca2+ currents.\no\tDrugs effective against absence seizures, less common form\nGoodman and Gilman. 12 Ed\n",
            "SLIDE #: 58 || Mechanism of Action of  AEDs\nMayo Clin Proc. 2012;87(9):879-889\n",
            "SLIDE #: 59 || Mechanism of Action of  AEDs\nMayo Clin Proc. 2012;87(9):879-889\n",
            "SLIDE #: 60 || Goodman and Gilman. 12 Ed\n",
            "SLIDE #: 61 || AEDs in the Clinical  Laboratory\nAEDs are among the most common medications for  which clinical laboratories perform therapeutic drug  monitoring (TDM)\nTDM quickly became part of clinical practice  because\nAEDs have complicated pharmacokinetics (ADME),\nnarrow therapeutic ranges\nsignificant differences in individual’s therapeutic dosages\n",
            "SLIDE #: 62 || Why do Therapeutic Drug  Monitoring (TDM)?\nToxicity\ndiagnosing toxicity\navoiding toxicity\nDosing\nafter dose adjustment (usually after reaching a steady state)\nassessment of adequate loading dose (after starting phenytoin  treatment)\nhelp predict a patient's dose requirements1\nMonitoring\nassessing compliance (anticonvulsant concentrations in patients having  frequent seizures)\ndiagnosing under treatment (particularly important for prophylactic\ndrugs such as anticonvulsants, immunosuppressants)\ndiagnosing failed therapy (therapeutic drug monitoring can help  distinguish between ineffective drug treatment, non-compliance and  adverse effects that mimic the underlying disease).\n",
            "SLIDE #: 63 || Which drugs need TDM?\nNarrow target range\nSignificant  pharmacokinetic  variability\nA reasonable  relationship between  plasma concentrations  and clinical effects\nEstablished target  concentration range\n",
            "SLIDE #: 64 || TDM Challenges with  AEDs\nDiagnosis is very difficult since seizures are  unpredictable and occur irregularly\nThere is no simple diagnostic test to assess the  clinical efficacy\nClinical assessment depends on careful  clinical observation and labour intensive EEG\nClinical signs and symptoms of toxicity are  subtle or difficult to differentiate form the  disorder\n",
            "SLIDE #: 65 || ",
            "SLIDE #: 66 || ",
            "SLIDE #: 67 || Indications for Monitoring Serum  AED concentrations - ILAE\nAfter initiation of treatment or after dose adjustment,  when the clinician decides to aim at a preselected target  concentration for that patient.\nOnce the desired clinical response has been achieved,  to establish the “individual therapeutic range.”\nTo assist the clinician in determining the magnitude of a  dose increase, particularly with AEDs showing dose-  dependent pharmacokinetics (most notably, phenytoin).\nWhen there are uncertainties in the differential diagnosis  of signs or symptoms suggestive of concentration-related  AED toxicity, or when toxicity is difficult to assess clinically  (for example, in young children or in patients with mental  disability).\nEpilepsia, 49(7):1239–1276, 2008\n",
            "SLIDE #: 68 || Indications for Monitoring Serum  AED concentrations - ILAE\nWhen seizures persist despite an apparently  adequate dosage.\nWhen an alteration in pharmacokinetics (and,  consequently, dose requirements) is suspected, due to  age-related factors, pregnancy, associated disease,  or drug-drug interactions.\nTo assess potential changes in steady state AED  concentration when a change in drug formulation is  made, including switches involving generic  formulations.\nWhenever there is an unexpected change in\nclinical response.\nWhen poor compliance is suspected.\nEpilepsia, 49(7):1239–1276, 2008\n",
            "SLIDE #: 69 || AEDs in Children\no  o\nAED PK is markedly influenced by age especially during  infancy and childhood\nShorter half-lives, and larger Vd compared with adults  Dosages may be 2-3x higher than adults\nReference range information is almost exclusively from  adult studies and there is little information about pediatrics\nPK interactions cause substantial changes in drug  concentrations. They are likely to occur in children too, but  the extent of the interactions may be different\nStudies have demonstrated that different types of seizures  respond to different serum concentrations. Childhood  seizures may be different types versus adult seizures\nAEDs may have long term adverse effects on the immature\nbrain that do not occur in the mature brain\nEpilepsia, 49(7):1239–1276, 2008\n",
            "SLIDE #: 70 || AEDs in Pregnancy\nMaternal serum concentrations not only reflect the  concentrations that determine therapeutic effect and  adverse effects but also the extent of drug exposure to  the fetus\nPK of many AEDs is affected by many important\nchanges during pregnancy\nBody weight\nAltered serum composition\nHemodynamic alterations\nHormonal changes\nDrug distribution changes due to fetoplacental unit\nPregnancy-associated PK changes have been  reasonably characterized for the older generation AEDs\nTDM is recommended during pregnancy at increased\nfrequency\nEpilepsia, 49(7):1239–1276, 2008\n",
            "SLIDE #: 71 || AEDs in Elderly\nTDM may be particularly helpful in guiding AED  therapy in elderly patients.\nGreater morbidity\nPoor medication compliance\nVariable age-related changes in pharmacodynamics and  pharmacokinetics\nIncreased likelihood of drug interactions affect the safety and efficacy of  both AEDs and co-medications\nEpilepsia, 49(7):1239–1276, 2008\n",
            "SLIDE #: 72 || AED Formulation Changes  and Generic Substitution\nWhen an AED formulation is changed, e.g., when  switching to/from generic formulations, measuring the  serum concentration of the AED before and after the  change may help in identifying potential alterations in  steady-state drug concentrations resulting from  differences in bioavailability\n\tWhen patients are switched to a formulation with  modified-release characteristics (for example, from an  immediate-release to a sustained-release formulations),  or when dosing schedule is changed (for example, from  twice daily to once daily administration), interpretation  of TDM data should also take into account the expected  variation in diurnal drug concentration profile\nEpilepsia, 49(7):1239–1276, 2008\n",
            "SLIDE #: 73 || AED Formulation Changes  and Generic Substitution\n\tA 2006 Survey by the American Academy of  Neurology found that seizures worsened in 59% of  individuals switched from brand-name to generic  AEDs\nLiow K, Barkley GL, Pollard JR. Position statement on the coverage of anticonvulsant drugs for the  treatment of epilepsy. Neurology. 2007;68(16):1249-1250.\nKrauss et al studied differences between 595 pairs  of generic AED formulations, estimated AUC varied  by more than 15% for 17% of pairs, and an  estimated Cmax differed by more than 15% for 39%.\nThe AEDs with low bioavailability and solubility, such as oxcarbazepine,  had the greatest variability.\nKrauss GL, Caffo B, Chang YT, Hendrix CW, Chuang K. Assessing bioequivalence of generic  antiepilepsy drugs. Ann Neurol. 2011;70(2):221-228.\n",
            "SLIDE #: 74 || Carbamazepine\nFirst line treatment in partial and secondarily generalized  tonic– clonic seizures and primary generalized tonic– clonic  seizures\nVoltage gated Na channel modulator\nAbsorption is relatively slow, erratic, variable, and formulation\ndependent\nUndergoes extensive metabolism with less that 2% of an oral  dose excreted unchanged in the urine\nMetabolism by primarily cytochrome P450 (CYP) 3A4, to pharmacologically active  carbamazepine-10–11-epoxide\nInactivated by epoxide hydrolase to 10, 11 - diol\nMany possible drug interactions\nCarbamazepine undergoes autoinduction so that clearance  can increase threefold within several weeks of starting therapy\nDuring maintenance carbamazepine monotherapy, adults  have half-lives of 8–20 h whereas in children 10–13 years of  age half-lives are 10–14 h\n",
            "SLIDE #: 75 || Carbamazepine\nSeizure control is most likely to occur between 4 and  12 mg/L (17–51 μ mol/L)\nThere is substantial overlap between  carbamazepine concentrations associated with  seizure control and those associated with toxicity\nUnpredictable relationship between dose and  carbamazepine concentration, its narrow  therapeutic index, and the presence of numerous  clinically significant drug interactions support the  need to individualize and maintain therapy using  TDM\n",
            "SLIDE #: 76 || Lamotrigine\nVoltage gated Na channel modulator and Ca Channel  blocker\nRapid and complete absorption form GI tract\nExtensive metabolism to an inactive glucuronide\nmetabolite via\tUGT1A4,\nAutoinduction phenomenon occurs with in 2 weeks,  resulting in 17% reduction in serum concentrations\nprone to drug interactions\nClearance is higher in children than adults\nClearance can be increased up to 300% in pregnancy\nNo clear-cut relationship exists between clinical response  and serum lamotrigine concentrations; however, toxicity  increases significantly with concentration >15 mg/L ( >58  μmol/L)\n",
            "SLIDE #: 77 || Phenytoin\nVoltage gated Na channel modulator\nComplex pharmacokinetics due to variable absorption,  high protein binding, saturable metabolism, and drug  interactions\nExtensive metabolism by CYP2C9 and CYP2C19 to  inactive metabolite\nSerum elimination half-life of phenytoin in adults is 30– 100\nhours\nElimination follows nonlinear kinetics\nMetabolism decreases with increasing dosages\nIncreasing dose can lead to disproportionately large increments in serum  concentrations\nMany interactions with other medications via metabolism\nand serum protein binding interactions\nReference range of 10–20 mg/L (40–79 μ mol/L)\nOften Free Drug levels are measured for TDM\n",
            "SLIDE #: 78 || Valproic Acid\nVoltage gated Na channel modulator and Ca Channel  blocker\nAlmost 100% bioavailability in all formulations\nFood delays absorption but not extent\nSerum protein binding decreases with increasing  concentration\nFree concentration increases in pregnancy, elderly, renal  disease, liver disease and conditions associated with low  albumin\nOften Free Drug levels are measured for TDM\nPharmacokinetics deviate from linearity due to changes  in serum protein binding\nChildren require higher dosages to achieve comparable\nplasma levels with adults\nUnpredictable relationship between dose and valproic  acid concentration supports the use of TDM\n",
            "SLIDE #: 79 || Matthew D. Krasowski, JUN.1.2013 Clinical Laboratory News\n",
            "SLIDE #: 80 || Conclusion - Why to  measure AEDs\nEstablish an individual therapeutic concentration\nAs an aid in the diagnosis of clinical toxicity\nTo assess compliance, particularly in patients with\nuncontrolled seizures or breakthrough seizures;\nTo guide dosage adjustment in situations  associated with increased pharmacokinetic  variability (e.g., children, the elderly, patients with  associated diseases, drug formulation changes);\nWhen a potentially important pharmacokinetic  change is anticipated (e.g., in pregnancy, or when  an interacting drug is added or removed);\nTo guide dose adjustments for AEDs with dose-  dependent pharmacokinetics, particularly  phenytoin.\n",
            "SLIDE #: 81 || Conclusions\nTDM has been used as a tool to optimize treatment  of epilepsy for almost 50 years.\nAlthough solid evidence for its usefulness in  improving clinical outcome is scarce, TDM  continues to play a role in epilepsy management,  partly due to the nature of the condition and partly  because of the pharmacokinetic variability of AEDs.\nThe evidence for a universal drug concentration-  effect interrelationships is less than satisfactory  highlighting the need for an “individual therapeutic  concentration”\n",
            "SLIDE #: 82 || Other Drugs\n",
            "SLIDE #: 83 || Digoxin\nPurpose: antiarrhythmic\nTherapeutic range: 1.0 - 2.7 nmol/L\nDigoxin has a narrow therapeutic range\nToxic symptoms are similar to sub-therapeutic symptoms  (arrhythmia).\n",
            "SLIDE #: 84 || Digoxin\nThere is marked overlap of serum digoxin levels between  those that are toxic and\tthose that aren’t.\nAt steady state the concentration of digoxin in cardiac tissue is  15-30 times that of serum.\n",
            "SLIDE #: 85 || Digoxin\nAccumulation of digoxin in tissue lags behind serum  concentrations.\nWhile the peak serum concentration is reached 2-3 h after the  oral dose, the peak tissue concentration occurs 6-10 h after an  oral dose.\n",
            "SLIDE #: 86 || Digoxin\nTherapeutic range is determined at the time of peak tissue\nconcentration.\nThe appropriate time to collect the specimen is 8 h or more  after the last dose\n(e.g. bedtime dose, specimen collection in morning)\n",
            "SLIDE #: 87 || Digoxin\nDigoxin toxicity develops more frequently and lasts longer in  patients with renal impairment.\nDosage requirements are decreased in patients with renal  disease.\n",
            "SLIDE #: 88 || Aminoglycosides\nPurpose:\tiv antibiotics\nTobramycin\nGentamicin\n",
            "SLIDE #: 89 || Aminoglycosides\nPurpose:\tiv antibiotic\nUsed for the treatment of aerobic gram-negative bacterial\ninfections\nMain objective is the maintenance of drug concentrations high\nenough to consistently achieve antibacterial activity.\n",
            "SLIDE #: 90 || Aminoglycosides\nElimination rates vary widely among patients, even those with  normal renal function.\nOtotoxicity and nephtrotoxicity are associated with both  excessive peak and trough aminoglycoside concentrations.\n",
            "SLIDE #: 91 || Aminoglycosides\nSusceptibility to toxicity varies widely from one patient to  another.\nBecause both peak and trough concentrations are important,  therapeutic ranges have been established for both of these  parameters.\n",
            "SLIDE #: 92 || Aminoglycosides\nSampling for trough measurements is done  just before the next dose (pre-dose).\nPeak (post-dose) serum sampling has to be done after the  distribution phase is completed.\n",
            "SLIDE #: 93 || Aminoglycosides\nIn most patients, sampling for the peak concentration should be  done 15-30 min after the end of the infusion (post-dose)\nin renally impaired or morbidly obese patients, sampling should  be done 30-60 min after infusion.\n",
            "SLIDE #: 94 || Thank You\n"
        ]
    },
    {
        "pptName": "L5_Knauer-Toxicology",
        "slides": [
            "SLIDE #: 1 || Toxicology\nClinical Biochemistry 3386b\nMichael Knauer PhD, FCACB\nmichael.knauer@lhsc.on.ca\n",
            "SLIDE #: 2 || Learning Objectives \u000bfor this Section:\nUnderstand the purpose and clinical context of toxicology.\nLearn the different clinical samples typically tested.\nLearn about the variety of drugs and poisons that are tested\nUnderstand the screen and confirmation tests and their purposes.\n",
            "SLIDE #: 3 || Toxicology\nPurpose of Toxicology Testing:\nTo detect, identify, and possibly measure, in various biological fluids, drugs and poisons which may or may not be suspected to be present.\nSubstance could be illicit or prescribed \n",
            "SLIDE #: 4 || Patients\nEmergency\nBabies and new mothers\nPsychiatric\nPain Clinic\nSexual Assault Centre\nInpatients (ICU)\nwho do we look at for testing?\n- most come from emergency departments where patients come in and you look for drug abuse\n- new mothers and babies sometiems tested for illicit drug use for CAS cases\n- psychiatric for compliance or illicit drug use\n- pain clinics do compliance testing to see if they are compliant with pain medication to renew prescription adn they are taking they are taking it and not supplmenting it with anything\n- sexual assault cases \n- ICU if they came in from motor vehicle c\n",
            "SLIDE #: 5 || Analytical Approaches\n Tests for specific drugs/poisons (e.g. drugs of abuse) when clinical  information points directly to them\nGeneral analyses for any or all drugs/ poisons when information on the case is limited\nfirst is direct testing - test  for specific drug\nsecond to see classes of drugs they've been on or broad panel like mass spec to look at 100s \n",
            "SLIDE #: 6 || Interpretation of Analyses Serum/Plasma:\nSpecimen of choice to measure drug levels\nCan measure level of intoxication\nContains parent drugs and some metabolites\nAnalysis rather involved because of complex matrix including large amounts of lipid and protein present\nDrugs can be present in low concentration\nmain sample type is serum/plasma if you want to measure drug levels in patient\n- can tell you about intoxication or impact of having drug in system\n- more complex matrix and harder to test for because of lots of serum proteins and lipids in the sample\n- requires more sensitive technology like liquid chromatography or mass spec because drugs are often present in low concentrations\n",
            "SLIDE #: 7 || Interpretation of Analyses - Urine\nIndicates exposure (what drugs taken) but exact timeline of when the compound was ingested\nCannot measure level of intoxication\nContains mostly drug metabolites (sometimes parent drug)\nLess complex matrix results in simpler analysis due to very small amounts of lipid and protein present\nthe more common sample type is urine - this is because the question is usually 'what did the person take' rather than how much they took\n- doesn't tell you much about amount taken or when they took it (doesn't tell you a lot about intoxication)\n- most cases you only detect drug metabolites\n- it's a simpler matrix - less protein and fat - therefore easier to measure drug of interest\n",
            "SLIDE #: 8 || Interpretation of Analyses – \u000bGastric Fluid\nrelatively infrequently requested\n invasive specimen\nno advantage over serum or urine\nanother fluid type that could be tested is gastric fluid \n- this is very rarely tested because so invasive to retreive and not a lot of advantage \n- e.g. known ingestion or found inconscious with empty pill bottle and it is thought they consumed 100s of pills\n",
            "SLIDE #: 9 || Interpretation of Analyses  - Hair and Meconium\nThese testing matrices are used to determine long term exposure to drugs\nHair testing can be used to identify a timeline for drug abuse or compliance. (e.g. was this a one-time exposure or has there been chronic exposure)\nMeconium tests are requested in neonates when there is concern regarding long term exposure to drugs in utero.\nNot clinically useful for acute management – TAT is too long – weeks\nUsually only requested by CAS\nanother sample type is hair and meconium (first stool formed in baby ~ black stool that baby has)\n- both are good matrices for long term exposure to drugs\n- hair testing can be used as a timeline - closer to scalp = more recent drug use\n- meconium testing is done on neonates and often when it is during concern regarding exposure in utero (medications or drug of abuse mom consumed during pregnancy)\n- tests are only done by specialized labs\n",
            "SLIDE #: 10 || Types of Drugs /Poisons\n1. Alcohols (ethanol, methanol, isopropanol and acetone, ethylene glycol)\n2. Drugs of Abuse (cannabinoids, opiates, cocaine, amphetamines, phencyclidine [PCP])\n3. Over-the-counter Drugs (salicylate, acetaminophen, pseudoephedrine, diphenhydramine)\n4. Prescription Drugs (antidepressants, benzodiazepines, barbiturates)\n5. Sexual assault drugs (gammahydroxybutyrate, flunitrazepam, ketamine)\n6. Heavy Metals (Pb, As, Hg)\n2. can be street drugs or pharmaceutical drugs\n",
            "SLIDE #: 11 || Ethanol\none of the most requested tox tests\nautomated, fast, convenient\nbased on alcohol dehydrogenase\nspecific for ethanol only\nif someone presents to ER with all signs of intoxication but they don't have ethanol\n",
            "SLIDE #: 12 || Toxic Volatile Alcohols\nMethanol    (windshield washer fluid, gas line antifreeze)\nIsopropanol    (rubbing alcohol)\nAcetone   (metabolite of isopropanol)\nthen you look at toxic volatile alcohols to see if they consumed these instead of ethanol \n",
            "SLIDE #: 13 || Glycols\nEthylene glycol         (antifreeze)\nPropylene Glycol     (numerous uses)\npeople might try to consume glycols in terms of suicidial intention/alcohol seeking behaviour \n",
            "SLIDE #: 14 || Toxic Alcohols\nmethanol, isopropanol, and ethylene glycol can only be analysed by gas chromatgraphy (GC)\nGC is also used to monitor treatment \n(ethanol therapy, fomepizole, and/or haemodialysis –methanol, EG\nsupportive treatment –  isopropanol/acetone)\nGC can be used to monitor treatment (make sure methabol/ethanol is decreasing)\ntreatment could be ethanol therapy to protect them from isoporonaol etc.\n- prevent ethanol from breaking  down into toxic metabolite\nfomepizole to prevent enzyme from breaking down and forming toxic metabolite\n^ most cases its followed up by hemodialysis to get rid of parent alchol and toxic emtabolite \nif overdose found than supportive treatment \n",
            "SLIDE #: 15 || example of GC chromatogram \ntop tracing is standards for volatiles - they are all chromatographically seperated from each other and each peak is diff retention time on column\nvolatile screen - patient sample only has peak correspodning with methanol and internal standard which helps quantify how mcuh tyey consumed\nethanol theraphy - large peak of ethanol because given to prevent methanol from forming toxic metabolite, peak of methanol is smaller\npost tretment - individual does not have ethanol or methanol detected\n",
            "SLIDE #: 16 || Serum Osmolality Gap (OGAP)\nOGAP  = Osmolality measured - Osmolality calculated\n \n\t\t   = Osmolality meas -  (2[Na] + [Glucose] + [Urea]) \n  \n\t          =    -10    to  +10\nunexplained (residual)  OGAP   =   OGAP – [Ethanol]\nOGAP is where you look for measured and calculated osmolality\nsubmit sample of serum to laboratory which is measured for it and you also measure it for the main thing that takes it up in normal person (sodium, glucose, and urea) \nuse both to calculate OGAP\nmeasured is normally higher than calculated\nmeasured componetnts are 2 times sodium (because sodium and chloride are there, glucose and urea)\n OGAP that is between -10 and +10 is normal OGAP\ntake the unexplained/residual OGAP - \n",
            "SLIDE #: 17 || Unexplained   OGAP\nPrecision   (i.e. SD)   is  ± 6\nAccumulation of measurement error of\nOsmolality\nNa\nGlucose\nUrea\nEthanol\nprecision of the OGAP - S.D could be +/- 6 due to accumulation error\n- small errors in all measurments add up \n",
            "SLIDE #: 18 || Unexplained   OGAP\nAn unexplained OGAP >10 mmol/L strongly suggests presence of something in addition to ethanol\nAn unexplained OGAP ≤10 mmol/L   - not helpful\n",
            "SLIDE #: 19 || Serum Osmolality Gap (OGAP)\nEthylene glycol is toxic at only 3.2 mmol/L \nMethanol is toxic at 8 mmol/L\nIf unexplained OGAP <=6 mmol/L, we encourage clinical staff to cancel the methanol/isopropanol screen but not a glycol screen\n",
            "SLIDE #: 20 || Acetaminophen\nTylenol\nOther preparations (e.g. Percocet, Robaxacet, combination cold remedies)\nLiver Toxicity is major concern\n> 4 grams per day\nAntidote\nantidote - anacytalsitine or NAC - used to protect liver from toxic metabolite produced \n",
            "SLIDE #: 21 ||  The effect of a single oral dose of a drug\u000b  on its concentration in serum/ plasma\nwhen you take a drug, you have absorption phase which peaks then a two phase distribtuion (distribution phase where it goes into tissues/fat and second one is elimination where it goes into bile or urine)\nknwoing when you are taking medicaiton from ingestion is important for interpretation of it \n",
            "SLIDE #: 22 || nomogram used in acetominophen overdosing\nit starts at 4 hrs after ingestion to 16 hrs\n- window where you are concerned about toxicitiy\n- measure the levels and plot it relating to time and when you think ingestion occured\n- more severe poisoning = more likely they are giving antidote\nearlier testing is done, earlier antidotte given \n",
            "SLIDE #: 23 || Salicylate\nAspirin\nOther preparations (e.g. Percodan)\nPepto-Bismol (bismuth subsalicylate)\nEnteric-coated preparations\nLeads to Metabolic Acidosis\nTreatment is to enhance elimination\nIon traping\neteric coated is different formulation where it has different coating or release pattern for aspirin\nion trapping - salicylate is ionized and released primarily in urine so you enhance elimnation by taking acidic urine and make it charged to add more base to urine to keep the salicylate negatively charged and keeps them in the urine allowing you to pee them out \n- uncharged salicylate have abiity to be reabsorbed back into body \n",
            "SLIDE #: 24 || Sexual Assault Drugs\nSexual assault drugs can include any drug which will reduce inhibitions and/or awareness such as:\nalcohol, cannabis, Ecstasy (MDMA), or benzodiazepines\nThe classical application of the term “date rape drug” is to drugs which also induce amnesia of the assault (e.g. Gammahydroxybutyrate [GHB, GBL], flunitrazepam [Rohypnol], ketamine [Special K])\ntake serum or urine samples from victim and look to see if they were drugged\ndrugs are used to reduce inhibitions/awareness/memory\n",
            "SLIDE #: 25 || Urine Drug  Testing\n",
            "SLIDE #: 26 || How Long are Drugs \u000bDetectable in Urine?*\n*Dose and individual dependent\nDrug\nEstimated Window of Detection\nDrug Screen Threshold (Cutoff) Concentration ng/mL (μmol/L)\n \nAmphetamines\n1 - 3 days\n1000 (7.41)\nBarbiturates\nshort/intermediate acting\nphenobarbital\n \n2 - 4 days\nSeveral weeks\n200 (0.84)\nBenzodiazepines\n1 - 7 days\n200 (0.70)\nCannabinoids\n4 - 30 days\n50 (0.147)\nCocaine\n \n300 (1.04)\nOpiates (Morphine or Codeine)\n2-3 days\n300 (1.05)\nGHB\n1 day (max)\n10 ug/mL\nthis is the first question in urine drug testing\nurine is primary choice because it is helpful in determining exposure of drug (not intoxication/effect of drug)\nhalf life gives you window of detection to find out if they consumed drugs\nshorter half life = shorter window of detection\nearlier you get the urine sample, more likely you will be able to pick up the trace of these\ndrug screening have different cutt offs for different methadologies\n",
            "SLIDE #: 27 || Terminology\nScreening Test:\ninitial test which distinguishes a negative result from a presumptive positive\n",
            "SLIDE #: 28 || Terminology\nPresumptive Positive:\npositive screen test result not yet validated by a confirmation  test\nin most cases, confirmation test/methodoly is by some type of mass spec method where you have definitive peak/fragmentation pattern compared to standard and you know it was present \nmost often come from immunoassay or POC\n",
            "SLIDE #: 29 || Terminology\nConfirmation Test:\ndefinitive test which conclusively establishes the\npresumptive positive screen result as a true or false\npositive\nconfirm. testing normally done with mass spec method \n",
            "SLIDE #: 30 || Terminology\nTrue Positive: \n   a positive screening test result which has been validated by a positive confirmation test result\nboth screening methodology and confirmation test both say drug is there in sample\n",
            "SLIDE #: 31 || Terminology\nFalse Positive:\n    a presumptive positive screening test result which has been invalidated by a negative confirmation test result\nnormally due to cross reactivity to some other drug in sample\n",
            "SLIDE #: 32 || Toxicology Methods\n1.  Screening Methods\n2.  Confirmation Methods\nscreening methods - rapid, easy to use, present in POC testing by lateral flow strips or core lab\nconfirmation methods - based on mass spec \n",
            "SLIDE #: 33 || Common Screen Methods \u000bSpecific screen methods:\nCore Lab or POCT (mostly immunoassays)\nQual or Quant\nFast & Cheap (relatively)\nSensitive screening methods\nFalse Positives?\nSerum(acetaminophen, salicylate, ethanol)\nUrine\nDrugs of abuse screens (urine)\nPrescription drug screens (mostly urine)\ncannabinoids\nopiates (but NOT oxycodone; poor cross-reactivity)\namphetamines\nbarbiturates (e.g. phenobarbital)\ncocaine\nbenzodiazepines (e.g. lorazepam)\nopiates\nserum tricyclic antidepressants (e.g. amitriptyline)\nthey can be qualitative (so either present or absent)\nquantitative e.g. in core lab where you can know if they are close to threshold, twice the threshold, half of it etc. \nthese are fast, quick, short TAT (within an hour or minute)\nsensitive - can pick up many drugs\nnot every drug in a class is equally good at causing a positive (doesn't react quite as well with antibodies)\nprone to false positivies because of interferent or other drug in sample which causing a false positive but it is not the class of drug that you want \nit is important to know class (?)\n- \n",
            "SLIDE #: 34 || Significant \u000bCross-reactivity Problems\nAmphetamines\n\t\t\t(pseudoephedrine,  e.g. Sudafed).\nTricyclic antidepressant drugs \n\t\t\t(30% false positives)\nCannabinoids\n\t              (50% of all neonatal positives can be false)\ncross reactivity causes false positives\namphetamines cross react with psudeoephedrine \ntricyclic antidepressant\n- structure is common to a lot of drugs\ncannabinoids \n",
            "SLIDE #: 35 || Tricyclic Immunoassay Screen Cross-reactants\nDiphenhydramine\nPhenothiazines\nCarbamazepine\nCyclobenzaprine\nHydroxyzine\nOrphenadrine\nCyproheptadine\nnot all of these are highly prescribed or used\ncarbamazepine - antiepileptic drug\n",
            "SLIDE #: 36 || Causes Of False Positive Immunoassay Drug Screen Results\n[Drug] is close to but below the cutoff conc’n\nPresence of interfering substances \n(usually other drugs)\ndue to interfering substance (some other drug)\nor drug gets close to cut-off\n- be a little bit higher than cut off but in confirmation testing its not high enough to reach cut off\n- could be due to the fact that parent drug/other drugs in the same class collectively bind and react in immunoassay therefore collectively theyre all greater in cutt off but when looking at them individually they might not meet it \n",
            "SLIDE #: 37 || Confirmation Methods\ngreater analytical sensitivity than the screen\nbased on a different chemical principle\nHPLC,  GC,  triple quad LCMS,   GC/MS\nmeasure lower concentrations and definiatively tell compound's presence\nmethod is based on mass spec usually which is a different pricniple than immunoassay\ncould be done by HPLC or GC but more commonly done by LCMS or GC/MS\n",
            "SLIDE #: 38 || Screen Confirmation\nPositive screen result for drugs of abuse and prescription drugs\nIndeterminate screen result may be close but below the cut-off level,\nFalse positive screen result due to cross reactivity or interference from other drugs is always possible\nIt is not necessary to do confirmations on all samples containing drugs, for example:\nNicotine (unless insurance testing)\nCaffeine\nTherapeutic drugs for which there are assays available\nPrescribed drugs (known to be taken by patient).\n",
            "SLIDE #: 39 || Criteria for Confirmation Testing:\nPresumptive positive immunoassay screen result\nAny uncertainty in the identification of a drug in the initial drug screen (e.g. GC/MS or LC/MS/MS)\nRequest from patient care giver\nif you need to know the true positive then you need to do a confirmation test\n",
            "SLIDE #: 40 || Criteria for Confirmation Testing:\nReality check:\nIn the clinical setting, confirmation testing cannot be done in real time for Emerg. Dept. needs\nAnd so many drug screens are ordered by ED.\n   Tox lab confirmation tests cannot keep up anyway\nConfirmation testing done on request only.\nAbsolutely necessary in forensic toxicology testing to determine cause of death with certainty\nwhen determining if to do a confirmation test, do a reality check, figure out if you need it and if it clinically impacts the case\nusually by ED, they want to determine what drug the overdose was and that's all they need to know to treat\n- ED though might be acting before the screening result\nED also orders them for patients admitted to psychiatry - to figure out what the patient came into the ED On \nconfirmation testing requires more investment of time and greater TAT therefore no clinical use to ED \nconfirmation testing done in certain clinical situations like pain clinics and forensic investigation \n",
            "SLIDE #: 41 || Toxidromes\nclinically, they are assessing toxidromes (clinical parameters they can measure to assess what potential drug a patient overdosed on)\n- they do this along with screening methodology sent to core lab \ntoxidromes - clinically assess respiratory rate, HR, blood pressure, size of pupils, temperature, bowel, sweat and energy\nyou can clinically classify drug overdose into one of these five categories which can dictate what the treatment should be\nall they need from the lab is a screen result to confirm that clinical picture and results match that they are on the right track\nanticholinergic - basically fight or flight response by someone\nnoloxone is therapy for opioid overdose\n",
            "SLIDE #: 42 || Part 2 - Toxicology Cases\n",
            "SLIDE #: 43 || Case 1:\nA patient with is history of elicit drug use was seen in clinic and is asked to submit a specimen to undergo a urine drug screen to assess for Rx compliance. Their Rx include: Oxycodone, Morphine, Diazepam, Adderall (amphetamine)\n",
            "SLIDE #: 44 || Case 1: Drug Screen Results\nScreening Test\nResult\nOrdering Physician Comments\nAmphetamines\nPositive\nIs this consistent with Rx or elicit use?\nBenzodiazepines\nNegative\nAre they compliant with Rx?\nCannaboids\nNegative\nCocaine\nPositive\nSuggest elicit drug use\nOpiates\nPositive\nOxycodone\nPositive\nTesting done in Core laboratory by Homogenous IA (KIMS methodology)\nsend screening testing to core laboratory - done with homogenous immunoassay\nphysicians have to determine if that makes sense with the prescriped drugs\nthe screen can't tell you if it is prescription or elicit\nopiates positive is consistent with prescription of morphine, so is oxycodene\nphysicians may want to request confirmation testing for the amphatmines or benzos\n",
            "SLIDE #: 45 || example of the GC/MS results for this patient\npatient has a positive/peak for cocaine -- so screening for cocaine got confirmed\nsmall peak for diazepam; maybe dose missed or its a low level accounted for by the negative screen but still detected by the more sensitive methodology\n",
            "SLIDE #: 46 || MDMA\nMDA\namphetamines - you can tell them apart by fragmentation pattern\n",
            "SLIDE #: 47 || Methamphetamine\nAmphetamine\nfragmentation pattern slightly different for these\nsame class of drugs but different fragmentation - screen result would be positive\nthis will tell you which one was taken \n",
            "SLIDE #: 48 || Case 1: Drug Screen Results\nScreening Test\nScreen Result\nOrdering Physician Comments\nConfirmation Testing\nAmphetamines\nPositive\nIs this consistent with Rx or elicit use?\nPositive for AMP, MethAMP, MDMA and MDA\nBenzodiazepines\nNegative\nAre they compliant with Rx?\nPositive\nCannaboids\nNegative\nNegative\nCocaine\nPositive\nSuggest elicit drug use\nPositive\nOpiates\nPositive\nPositive for Hydromorphone\nOxycodone\nPositive\nPositive\nTesting done in Core laboratory by Homogenous IA (KIMS methodology). \nConfirmation testing done by GC/MS\nfor benzos, confirmation tests show that they are compliant\n",
            "SLIDE #: 49 || Case 2\nA patient is seen in your pain clinic today and undergoes routine urine drug testing.\nTheir Rx history includes Codeine (OTC), Nitrazapam, Oxycodone and recently they have had a cold with OTC cough and cold therapy\nroutine testing to assess compliance to make sure they are taking pain meds prescribed and not selling it or supplementing it with other things\n",
            "SLIDE #: 50 || Case 2: Drug Screen Results\nScreening Test\nResult\nOrdering Physician Comments\nAmphetamines\nPositive\nIs elicit use?\nBenzodiazepines\nPositive\nCannaboids\nNegative\nCocaine\nNegative\nOpiates\nPositive\nOxycodone\nPositive\nTesting done in Core laboratory by Homogenous IA (KIMS methodology)\nnot prescribing amphetamines so you want to know if it is elicit use\nbenzos, oxycodene consistent with prescription\nconfirmation testing for amphetamines\n",
            "SLIDE #: 51 || GC/MS for this patient\n",
            "SLIDE #: 52 || ",
            "SLIDE #: 53 || Case 2: Drug Screen Results\nScreening Test\nResult\nOrdering Physician Comments\nConfirmation testing\nAmphetamines\nPositive\nIs elicit use?\nNegative (False Positive Screen)\nBenzodiazepines\nPositive\nPositive for Nitrazepam Met\nCannaboids\nNegative\nNegative\nCocaine\nNegative\nNegative\nOpiates\nPositive\nPositive for Hydromorphone and Hydrocodone\nOxycodone\nPositive\nPositive\nTesting done in Core laboratory by Homogenous IA (KIMS methodology)\nConfirmation testing done by GC/MS\n",
            "SLIDE #: 54 || Case 3: Parkinson’s or Drug Toxicity? \n",
            "SLIDE #: 55 || Case 3 – ED Presentation\n70y Male\nPresented to ED with a two week history of falls, difficulty ambulating, ataxia, and worsening tremor.\nConcerns in past few months regarding cognition and tremor and recently assessed by neurology for Multisystem Atrophy vs Parkinson’s Disease.\nBut symptoms have become significantly worse in the last few days.\nDifficulty ambulating around home\nDenys syncope or other cardiorespertory symptoms\nDaily nausea and vomiting (1 to 2x per day) after meals for the last several weeks and loose bowel movements\nOral intake has been minimal over the last 2-3 days\nNo fever or other infectious symptoms\n",
            "SLIDE #: 56 || Case 3 – Past Medical History\n20y Hx of bipolar disease with stable lithium dose\nCKD – Baseline Cr 160 mmol/L\nCAD – Grade 3-4 with multiple MIs in past\nAtrial Fibrillation\nHas an Automatic defibrillator inserted (AICD) – 6 years ago\nVentricular Tachycardia\nMild Cognitive impairment\nLung cancer – Left lung lobectomy in 2000\nCOPD\nPast smoker and consumes large amounts of nicotine gum\nTremors, autonomic instability, erectile dysfunction, REM sleep disturbances, head drop\nParkinsonian Syndrome – currently being worked up by Neurology\nRecently started on Sinemet (carbadopa/levodopa)\nCr - creatinine\n- normal levels\nMI - myocardial infarctions\n",
            "SLIDE #: 57 || Case 3 – Medication\nLithium Carbonate 300mg PO TID\nLevodopa/Carbidopa 100mg/25mg PO TID\nWarfarin 4mg PO OD\nVit B12 1000mcg PO OD\nSenokot 8.6mg PO qhs\nVenlafaxine SR 150mg PO OD\nDoxepin 50mg PO qhs\nAtorvastatin 40mg PO qhs\nAmiodarone 100mg PO OD\nQuetiapine 50mg PO qhs\nASA 81mg PO OD\nBisoprolol 7.5mg PO OD\nFurosemide 40mg PO OD\nMidodrine ?mg PO TID\nhe has complicated medical history and large list of medication\n",
            "SLIDE #: 58 || Case 3\nTriage Vitals\nT 36.6, HR 61, BP 97/60, RR 22, O2 Sat 96\n \nPhysical Exam\nAppears well, no distress, dry mucus membranes JVP 1cm ASA\nCVS: normal \nResp: Normal, no wheezes or crackles\nAbd: Soft and Lax, no tenderness or rigidity, + BS\nNo edema\nNeruo exam: alert and oriented, no facial asymmetry or slurred speech\nNo pronator drift, CN2-12 normal, Power 5/5 all limbs, Reflexes 2+ No asterixis\nLABS\nCBC: WBC 10.5, Hgb 122 L, Neut 9.0 H, Lymph 0.7 L, PLT 213, MCV 96.2 H\nNa 137, K 5.4 H, Cl 104, CO2 26, AG 7\nCa 2.54, Mg 1.27 H, PO4 1.2\nAlb 44\nAST 17, ALT 9, ALP 116, TBil 8\nCK 46, Lipase 48\nINR 2.61 H\nUrea 11.8 H\nCre 214 H\nHsTrpT 40 H\nGlu, random 5.2\nUDS – Negative\nEtOH - ND\nToxic Alcohol Screen – ND\nAPAP – ND\nSalicylate – ND\nLithium 2.5 mmol/L (0.4-1.3) C\nappears well and not in distress\nbasic chemistry panel is unremarkable; little bit high potassium but overall normal results\n- Cr is a little elevated\nlooking for toxic cause for his symptoms\nurine drug test - no ellicit drugs \nethanol/alcohol screen - none detected\naceptominophne (APAP) and serum - not detected \nthen someone measured lithium levels - he was prescribed it for his bipolar - it was critically high\n",
            "SLIDE #: 59 || Lithium Toxicity\nAcute – lithium naïve patients who overdose\nChronic – on maintenance Li therapy with some change – increase dose, reduced kidney function, or new drug-drug interaction\nAcute on chronic – existing burden (from chronic maintenance therapy) and are acutely exposed to a large burden\n",
            "SLIDE #: 60 || Lithium Pharmacokinetics\nA \nD \nM \nE \nComplete in 6-8 hrs\nPeak plasma level 0.5-2 hrs\nPeak plasma for delayed release 4-5 hrs\nIn total body water, no protein binding\nDelayed intracellular uptake\nCSF and brain uptake delayed by 24 hrs\nNone\nEntirely in urine\nFreely filtered in glomerulus, 80% reabsorbed\nT ½ 12-27 hours (delayed in geriatric patients)\nBecause of my background I got asked about the role for Dialysis and Whole Bowel irrigation \nA - absorption \nD - distribution\nM - lithium is an ion therefore not metabolized\nE -excretion; excreted in urine\n",
            "SLIDE #: 61 || Case 1 – Lithium Levels\nCollect D/T: 2016/04/07 1955\nReceive D/T: 2016/04/07 2027\n  LITHIUM (TDM)\n    LAST DOSE (LI)\nUNKNOWN~\n    TIME OF LAST DOSE (LI)\n20160407200100~\n    LITHIUM\nC\n2.5\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/08 0715\nReceive D/T: 2016/04/08 1032\n    LITHIUM\nC\n2.1\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/08 1332\nReceive D/T: 2016/04/08 1529\n    LITHIUM\nH\n1.9\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/08 1925\nReceive D/T: 2016/04/08 2031\n    LITHIUM\nH\n1.7\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/09 0724\nReceive D/T: 2016/04/09 0751\n    LITHIUM\nH\n1.4\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/09 1345\nReceive D/T: 2016/04/09 1500\n    LITHIUM\n1.2\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/10 0735\nReceive D/T: 2016/04/10 0814\n    LITHIUM\n0.9\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/11 1440\nReceive D/T: 2016/04/11 1523\n    LITHIUM\n0.6\n(0.4-1.3)\nmmol/L\nCollect D/T: 2016/04/13 0710\nReceive D/T: 2016/04/13 0816\n    LITHIUM\n0.4\n(0.4-1.3)\nmmol/L\n2.5 to 1.2 (2 Days)\n1.2 -0.6 ( 2 Days)\nLithium halflife is 2 days in this Patient normally ~1 day\n",
            "SLIDE #: 62 || Case 3 – Lithium Levels\n2.5 to 1.2 (2 Days)\n1.2 -0.6 ( 2 Days)\nLithium halflife is 2 days in this Patient normally ~1 day\nlonger than 24 hrs for a half life for him (first half life)\nnext half life - almost two days\nthis patient has a delayed half life and takes about two days per half life \n",
            "SLIDE #: 63 || Case 3 - Conclusion\nAfter doing a comprehensive laboratory investigation including UDS, toxic alcohol screen and lithium level for TDM. The patient was found to have a critical Lithium level 2.5 mmol/L (RI 0.4 – 1.3) with mild acute on chronic kidney disease Cre 214.\nHe was on a stable lithium dose over the last few years and denies any intentional overdose and was taking his lithium as prescribed. Lithium was held until the lithium levels came down to below the reference range 0.4 mmol/L (6 days).\nRecommendation from Nephrology, Clinical Pharmacology, and Poison Centre was to hold the Lithium and give IV fluids, acute dialysis is not indicated to facilitate lithium clearance. \nMonitor kidney function with frequent volume assessments and watch for lithium induced diabetes insipidus .\nThe differential for his presentation would include lithium toxicity versus worsening of his underlying neurological disorder, secondary to decreased oral intake, GI symptoms, and hypovolumeia.\nPatient was referred to Psychiatry for reassessment of Bipolar disorder and lithium dosing\n",
            "SLIDE #: 64 || Lithium Toxicity\nLithium toxicity treatment guidelines for Dialysis: \nLithium level >6 mmol/L: any patient\nLithium level >4 mmol/L: any patient on chronic lithium therapy\nLithium level between 2.5 and 4 mmol/L: any patient with severe neurologic symptoms, renal insufficiency, or unstable hemodynamically or neurologically\nLithium level <2.5 mmol/L: hemodialysis indicated only for patients with end-stage renal disease or patients whose lithium levels increase after admission or who fail to reach a lithium level below 1 mmol/L in 30 h\nRef Dr B. Kapur CSCC List Serv\n",
            "SLIDE #: 65 || Lithium Toxicity\nCurrent clinical practice in the fields of Psychiatry and Geriatric Psychiatry, expert opinion, and the literature, the the upper limit (1.3 mmol/L) was deemed too high for the elderly. \nRecommended therapeutic interval of 0.4-0.8 mmol/L in patients ≥ 65  years of age.\nAustralian and New Zealand Journal of Psychiatry 2011; 45:1026–1032 \nCurr Psychiatry Rep (2011) 13:488–492\n",
            "SLIDE #: 66 || Conclusions\nThese cases are to illustrate the need for toxicology testing in the compliance and over dose setting\nImportant to recognize the differences between screening and confirmation testing \n"
        ]
    },
    {
        "pptName": "L6_Knauer-Tumor_markets",
        "slides": [
            "SLIDE #: 1 || Tumor Markers\nClinical Biochemistry 3386b\nMichael Knauer PhD, FCACB\nmichael.knauer@lhsc.on.ca\n",
            "SLIDE #: 2 || Define cancer and describe the properties of “ideal” tumor markers. \nDiscuss the clinical application of tumor markers in the clinic and their potential uses. \u000b\nDescribe the clinical uses of prostate-specific antigen (PSA) in prostate cancer. \nObjectives\n",
            "SLIDE #: 3 || What is cancer?\nIt is a group of diseases characterized by uncontrolled growth and division of cells (proliferation) that can develop into a solid mass (tumor) and spread to other areas of the body. \nCancer develops as a consequence of multiple genetic mutations which usually occur over a long period of time. These mutations are often in genes that disrupt cell cycle, differentiation or apoptosis (programmed cell death) pathways \nActivated oncogene\nUncontrolled Growth \n",
            "SLIDE #: 4 || What is cancer?\nhttp://cisncancer.org/research/what_we_know/advances/oncogenes.html\nOncogenes\nThe bad guys, turn abnormal cell growth on (go/gas pedal)\nTumor-Suppressor Genes\nThe good guys, turn cell growth off (stop/brake pedal)\n2 types of genes involved\nTumor suppressor genes: braking signals during phase G1 of the cell cycle, to stop or slow the cell cycle before S phase. If tumor-suppressor genes are mutated, the normal brake mechanism will be disabled, resulting in uncontrolled growth, i.e. cancer.\nOncogenes: a proto-oncogene that has been mutated in a way that leads to signals that cause uncontrolled growth- i.e., cancer\nstop  signal (keep them in senescent state) \noncogenes are pro cancer genes - is the signal for cell to divide wh \n",
            "SLIDE #: 5 || Cancer\nCancer is staged based on \nTumor size\nHistology\nRegional lymph node \n      involvement\nPresence of metastasis\nA benign tumor is not considered to be a cancer because the tumor remains localized in the place where it started; it does not spread\nA malignant tumor is considered to be cancerous because the tumor does invade and destroy nearby tissues, and can be become metastatic (spread to distant sites)\nusually starts in small location but can spread throughout body \n",
            "SLIDE #: 6 || Tumor markers\nIdeal Tumor markers \nBe positive in all cases of cancer and negative in the absence of cancer\nBe specific to the malignant tissue, and be produced only by it\nHave plasma levels proportional to the tumor mass and stage \nHave plasma levels, urine levels, or both, that are relatively short half-life, reflecting temporal changes in tumor burden and response to therapy\nBe prognostically useful i.e. a rise in level predicts recurrence/ relapse \nBe easy, reproducible and inexpensive to measure\nHealthy cells\nCancer cells\nTumor markers\nProteins/substances that are selectively over-produced by and released from cancer (tumor) cells, but not typically from normal cells\n",
            "SLIDE #: 7 || Ideal tumor markers\nBe positive in all cases of cancer and negative in the absence of cancer\n-ve \nNormal\nTumor\nspecific to cancer\n",
            "SLIDE #: 8 || Ideal tumor markers\n2.   Be specific to the malignant tissue, and be produced only by it\nColon cells\nCEA\nPSA\nProstate cancer\ne.g. only produced in one area \n or can find cancer by detecting the protein \nin prostate cacner, you can't fidn it any other cancer in various locations around body\nbut in CEA could be produced in rectal, thryoid, or lung cancer - which is not the ideal tumour marker - because it doesn't help tell you wehere it started\n",
            "SLIDE #: 9 || Ideal tumor markers\n3.     Have plasma levels proportional to the tumor mass and stage \nLow concentration\nHigh concentration\n-ve \nconcentraiton of markers differentiate between stage 1 to 4 - the more present, larger the mass of cancer\n",
            "SLIDE #: 10 || Ideal tumor markers\nHave plasma levels, urine levels, or both, that are relatively short half-life, \n       reflecting temporal changes in tumor burden and response to therapy\n-ve \nAfter treatment\nBefore treatment\n",
            "SLIDE #: 11 || -ve \nIdeal tumor markers\nRecurrence/ Relapse? \nAfter treatment\n5.  Be prognostically useful i.e. a rise in level predicts recurrence/ relapse \nuse monitoring of markers to assess if cells were missed/relapse occured/treatment isn't working \ndecreases when it works\n",
            "SLIDE #: 12 || Ideal tumor markers\nBe positive in all cases of cancer and negative in the absence of cancer\nBe specific to the malignant tissue, and be produced only by it\nHave plasma levels proportional to the tumor mass and stage \nHave plasma levels, urine levels, or both, that are relatively short half-life, reflecting temporal changes in tumor burden and response to therapy\nBe prognostically useful i.e. a rise in level predicts recurrence/ relapse \nBe easy, reproducible and inexpensive to measure\nNOT EXIST\nideal tumor marker does not exist \n",
            "SLIDE #: 13 || Types of tumor markers\nPSA\nLD\nALP\ncatecholamines\nserotonin\ncalcitonin\nCA15-3\nCA125\nCA19-9\nCEA\nAFP\nhCG\nothers\nImmunoglobulin\nSerum free light chain\ntumor markers could be proteins associated with tumor, produced by tumor, oncoproteins, oncogenes, tumor supression genes\nmost common clinically is tumor associated proteins\n- protiens or associated molecules produced by tumor\noncofetal antigens\n- only produced in fetal/early development \n- picking up in adults suggest that cells progressed to fetal like cell or going back to stem cell like \neptihelial antigens\n- cancer antigens\n- mnumber corresponds to various types and lcoations\nenzymes\n- tumors produced enzymes \nhormones\n- selectively overproduce hormones or produce hormones\nothers\n- immunoglobin - plasma cells can contniue dividing and overproduce these, which is used to detect type of cancer\n",
            "SLIDE #: 14 || Role of Laboratory Tests\n",
            "SLIDE #: 15 || Role of Laboratory Tests\nscreening - this would be ideal place to use tumor markers\n- screen population when symptoms show to find cancer early\n",
            "SLIDE #: 16 || Role of Laboratory Tests: Screening\nScreening \nScreening refers to looking for cancer in people who have no symptoms of the disease. \nEarly detection is finding cancer at an early stage, when it’s less likely to have spread and is easier to treat.\nbut very few markers have been shown to be helpful in screening\neither markers arent snesitivie enough \n",
            "SLIDE #: 17 || Role of Laboratory Tests: Screening\nTumor marker value\nHealthy\ncancer\nChosen cut-off\nFrequency \ndistribution\nIncrease Specificity\nIncrease Sensitivity\nA screening test should have a very low false-negative rate i.e., the sensitivity of the test should be 100% or close to it\nThis means that a “negative” screening test result assures the patient is free of that disease/cancer\nsensitivity should be close to 100% \n- means negative reassures that they are free of cancer\nmove cut off left \n",
            "SLIDE #: 18 || Role of Laboratory Tests: Screening\nTumor marker value\nHealthy\ncancer\nChosen cut-off\nFrequency \ndistribution\nIncrease Specificity\nIncrease Sensitivity\nA screening test should have a very low false-negative rate i.e., the sensitivity of the test should be 100% or close to it\nThis means that a “negative” screening test result assures the patient is free of that disease/cancer\nmoving it left will pick up all cases but also high false positivite rate\n- this could cause undue stress on healthy population \n",
            "SLIDE #: 19 || Role of Laboratory Tests: Screening\nBest example is PAP smear for cancer of the cervix cancer and mammography for breast cancer.\n",
            "SLIDE #: 20 || Role of Laboratory Tests\n",
            "SLIDE #: 21 || Role of Laboratory Tests: Diagnosis\nDiagnosis\nTumor makers doesn’t help in establishing the diagnosis per se in most of the cases but corroborates it\nHelps in distinguish benign from malignant cases in some tumors\nIn patients that have symptoms, tumor markers may be used to help identify the source of the cancer, such as CA-125 for ovarian cancer, and to help differentiate it from other conditions\n",
            "SLIDE #: 22 || Role of Laboratory Tests\n",
            "SLIDE #: 23 || Role of Laboratory Tests: Prognosis\nStaging and Prognosis\nIf a patient has cancer, tumor marker elevations can be used to help determine how far the cancer has spread (staging) into other tissues and organs and how aggressive a cancer is likely to be (prognosis)\nThe presence or absence of a tumor marker or its quantification helps in determining the prognosis\nTumor marker concentration generally increases with tumor progression, reaching their highest levels when tumors metastasize.\nelevations in marker can tell you how far cancer spread and stage it \ncan also tell you how aggressive it is\n",
            "SLIDE #: 24 || A 57-year-old woman with a diagnosis of jaundice, diabetes mellitus, and pancreatitis. Suspected cancer of the head of the pancreas was based on given the history, physical examination, and clinical presentation, tumor markers were also ordered. \n\tLab result:\nLipase \t800 U/L (13 – 60 U/L)\nAmylase\t104 U/L (30 – 100 U/L)\nALP \t213 U/L (35 – 100 U/L)\nLD\t293 U/L (100 – 250 U/L)\nBilirubin\t115 umol/L (3.5 – 20 umol/L)\n\tOrder: \nCA19.9 \t241 U/mL (≤ 33 U/mL)\nRole of Laboratory Tests: Prognosis\nIf they were elevated above the reference range, it would most likely indicate cancer of the head of the pancreas in stage 2 or later. \nChemotherapy and radiation therapy would most likely be initiated.\nlipase elevated\nALP elevated\nLD - above reference interval\nbilirubin - elevated\nCA19.9 is also elevated\njust because tests are above, you can guess type/stage of cancer -- likely guess it is stage 2 cancer\n",
            "SLIDE #: 25 || Pancreatic cancer is the fourth most common cause of cancer death\nPancreatic cancer is difficult to diagnose until it is advanced and, thus chemotherapy and radiation therapy haven’t been very successful in curing or treating the disease\nBecause pancreatic cancer often presents with nonspecific symptoms until it reaches advanced stages, there is a need for good staging indicators\nSome indicators that have been used include serum enzymes such as amylase and lipase, ectopically produced hormones, and tumor-associated antigens: CA19.9  that provide the best specificity and sensitivity\nRole of Laboratory Tests: Prognosis\n",
            "SLIDE #: 26 || Role of Laboratory Tests\n",
            "SLIDE #: 27 || Role of Laboratory Tests: Monitoring\nMonitoring effectiveness of therapy and disease recurrence\nSeeing if certain treatments are likely to work or how well treatment is working.\nOne of the biggest uses for tumor markers is to monitor for cancer recurrence. \nIf a tumor marker is elevated before treatment, low after treatment, and then begins to rise over time, it is likely that the cancer is returning. (If it remains elevated after surgery, then chances are that not all of the cancer was removed). \nThe changes are important, which is why results of a series of level tests often mean more than a single result. If at all possible it’s best to compare results from tests done at the same lab, and always be sure that the results are of the same value.\nmore common ways is to measure it after person has been clear or in remission - this could be sign that cancer is back if it is elevated \nelevated before treatment, low after = means that treatment is working\nimportant to do serial monitoring to look for changes in levels of it \n- same lab because immunoassays are not standardized between vendors/kits therefore differences between labs can affect levels\n",
            "SLIDE #: 28 || A 25-year old man with a history of testicular cancer is followed post-surgery over the course of 10 months with β-hCG and AFP monitored. \nThis patient is treated with radiation at 2 months, followed by chemotherapy from months 6 through month 9.\n\t\nhttps://archive.org/details/ClinicalChemistry6thEditionBishop\nRole of Laboratory Tests: Monitoring\nday 0 he has low \n2 month follow up he is low levels but higher than before\n- begin to start radiation therapy -- this was successful in lowering HCg but not AFP\nmonth 5 - AFP continuing to rise\n- changed to chemotherapy\nfirst you have large spike in AFP and hcg but as the months pass, both tumor markers are declining back to baseline\n",
            "SLIDE #: 29 || Timeline of tumor marker use\ndifferent tumor marker ahve their advantages and disadvantages in the time line of cancer\ne.g. PSA/AFP are good screening markers but for diagnosis you may have other molecules and others for prognosis to determine type of cancer or poor prognosis with high levels\nnone of the examples are available for any of the five major reasons to use them - just one of the plethora of tumor markers are not ideal marker\n",
            "SLIDE #: 30 || Recommendations\nWhen ordering tumor markers\nNever rely on result of a single test\nMultiple markers should be considered to improve the outcome of the test (improve sensitivity and specificity)\nRepeat tests while following up should be ordered from the same lab using same kit\nDo serial testing\nWhile monitoring recurrence, make sure the tumor marker level was elevated before surgery (check baseline)\nThe half-life of the marker (know the metabolism of tumor markers) should be taken into account before interpreting the result\nuse same lab/vendor when repeating tests\nserial testing - before treatment, after treatment, and after remission\nset baseline level and compare successive measurements back to it \n",
            "SLIDE #: 31 || Define cancer and describe the properties of “ideal” tumor markers. \nDiscuss the clinical application of tumor markers in the clinic and their potential uses. \u000b\nDescribe the clinical uses of prostate-specific antigen (PSA) in prostate cancer. \nObjectives\n",
            "SLIDE #: 32 || Prostate cancer\nThe most common type of cancer (>65 yrs, African-Americans) and second most frequent cause of cancer-related death in men\nA malignant (cancerous) tumor begins in the prostate gland \nSome prostate cancers grow very slowly and may not cause problems for years\nCanadian Cancer Registry and National Cancer Incidence Reporting System databases at Statistics Canada\n",
            "SLIDE #: 33 || What is the function of prostate?\nProstate gland is a walnut-sized gland just below the bladder and in front of the rectum\nIt surrounds part of the urethra, which is the tube that carries urine and semen through the penis.\nThe prostate makes part a liquid called seminal fluid, which mixes with sperm from the testicles to make semen.\nAs a male gets older, the size of prostate gland increases and most males develop a significant increase in the size of the prostate called \n\t“benign prostatic hyperplasia, BPH” \n",
            "SLIDE #: 34 || What are the risk factors for prostate cancer?\nRisk factors\nIncreasing age\nRace\nFamily history\nFat diet\nMale hormones\nAdenocarcinoma occurs in periphery of prostate gland\nMetastasizes to lungs, bones (bone pain often first symptom as early stage of primary tumor maybe asymptomatic)\n",
            "SLIDE #: 35 || What are the symptoms of prostate cancer?\nFrequent urination, or weak or interrupted urine flow\nPain or burning during urination or blood in the urine\nThe urge to urinate frequently during the night\nDifferent symptoms if the cancer has spread (metastasis): \npain in the back, weight loss, fatigue\nSometimes, people with prostate cancer do not show any of these symptoms, or these symptoms may be similar to symptoms of other medical conditions\n",
            "SLIDE #: 36 || Role of Laboratory Tests: Screening\nFor tumor marker (biochemical testing), the screening of prostate cancer with serum PSA is the best example\nMajor disadvantage\nBeing the over-diagnosis and overtreatment of a certain tumor based on screening with tumor markers\nTumor marker value\nHealthy\ncancer\nChosen cut-off\nFrequency \ndistribution\nIncrease Specificity\nIncrease Sensitivity\nPSA - prostate specific antigen\nin order to get high sensitivity and 100% detection, you are incresing the risk of healthy people being positive that means yo uare overdiagnosising\n",
            "SLIDE #: 37 || How is Prostate Cancer Evaluated?\nhttp://www.cancer.gov/publications/dictionaries/cancer-terms?cdrid=46632\nPSA test\nDRE: Digital rectal exam \npalpation of prostate by DRE detects nodular lump\nDiagnosis is confirmed with a biopsy\nTransrectal ultrasound (TRUS)\nmeasures prostate volume\nImaging tests can determine if the cancer has spread\nprostate cancer screened by PSA test and visual rectal exam (palpation of prostate)\nconfirm diagnosis with biopsy\n",
            "SLIDE #: 38 || Prostate Specific Antigen (PSA)\nStructure\nA 28.4 kDa single chain chymotrypsin-like serine protease containing 237 amino acids \nIt is synthesized in prostate tissue, and after being released into the seminal fluid\nPhysiological function\nIt lyses the gel proteins, resulting in the liquefaction of the semen to promote the release and motility of spermatozoa\n",
            "SLIDE #: 39 || Prostate Specific Antigen (PSA)\nForms in serum: Complex and Free forms\nVarious molecular forms because of complex formation with protease inhibitors\nThere are 2 major forms of PSA that are found circulating in the blood\ncomplexed form: \nα1-antichymotrypsin (PSA-ACT)\nα2-macroglobulin\nfree form\nFree PSA comes from benign prostatic hyperplasia (BPH), an enlargement of the prostate. The higher the amount of free PSA, the less likely prostate cancer will be found as prostate cancer cells produce more complex PSA.\n\u000b\nTotal PSA = α1-antichymotrypsin-PSA (complexed) + fPSA\nbound to alpha 1 or alpha 2\nlooking at prostate size you can't tell if its cancer or hyperplasia\n",
            "SLIDE #: 40 || Total PSA test\nThe PSA test is a simple blood test, which measures the amount of PSA protein in the blood. \nIt is common for PSA to be found in the blood in very small concentrations.\nHigher levels of PSA may indicate the presence of cancer, but can also be an indicator of other prostate conditions. \n\u000b\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nY\nPSA\nbound antibody and detection AB on one side\ncapture antibody (solid support or magnetic bead on other side) ?\n",
            "SLIDE #: 41 || PSA test: Cut-off\nTotal PSA level, DRE\nPSA normal\nGrey zone\nFree PSA\nCalculate F/T PSA ratio\nAbnormal\nBiopsy\nPositive\nTreatment\nNormal\nRepeat DRE/PSA\nin 6 months\n< 10%\nfree PSA comes from benign prostatic hyperplasia (BPH)\nHigh free PSA = BPH\nLow free PSA = Cancer\ntotal PSA levels - you need more total levels and digital rectal ultrasound ot figure it out\nif results of PSA is less than 4 than normal and no risk\ngreater than 10 leads to further testing \n- if biopsy was positive you treat the individual\n- if negative, repeat the screening in 6 months\nif its between 4-10\n- measure free PSA levels; if less then 10% (more PSA is bound to protein than this increases risk for cancer and should proceed to biopsy)\n",
            "SLIDE #: 42 || % Free PSA\nTo enhance the specificity of total PSA in detecting prostate cancer, especially when total PSA values are between 4 and 10 µg/L. \nThe use of free/ total PSA in men with PSA levels can reduce the number of unnecessary biopsies.\nfPSA results can be used in 2 ways: \nUse of a single cut-off point. \n<25% fPSA it was shown that unnecessary needle biopsies could be reduced by 20%\nProbability of cancer:\nuse single cut off- free PSA is less than 25% than reduce biopsies by 20% \ngraded approach where you ahve free PSA les s than 10% then you have greater than 50% of cancer? \n",
            "SLIDE #: 43 || PSA test: to screen or not to screen\nBenefits\nLimitations\nMay indicate the presence of cancer in its earliest stages.\nMay lead to unnecessary tests and treatment.\nSimple blood test (not harmful).\nCannot distinguish between slow growing and advanced cancer.\nCurrently only test we have as red flag to indicate follow-up.\nThe PSA test cannot diagnose prostate cancer but can tell you if there’s a problem with the prostate.\nPSA can be elevated in \nBenign prostatic hyperplasia\nProstatitis (inflammation)\nProstate infection, UTI\nPhysical injuries: urethral catheterization, DRE, biopsy\nPhysical activities: cycling, prostatic massage\nused in screening but not the perfect test\n",
            "SLIDE #: 44 || PSA test: Why is it done?\nScreening\nProstate cancer often grows very slowly, without causing major problems\nDetecting prostate cancer early and treating it may prevent some health problems and reduce the risk of dying from the cancer\nHowever, some treatments for prostate cancer can cause other problems\nTogether with digital rectal exam (DRE), PSA can aid the diagnosis of prostate cancer\nTo monitor prostate cancer and how it responds to treatment\nIf PSA levels increase, the cancer may be growing or spreading\nPSA is usually not present in a man who has had his prostate gland removed\nA PSA level that rises after prostate removal may mean the cancer has returned or has spread \nprostate cancer screening is done because it grows slowly so detecting early is good to prevent death\n",
            "SLIDE #: 45 || PSA test: Canada Recommendation\nProstate Cancer Canada Recommends:\u000b\u000b1. Men should get a PSA test in their 40s to establish their baseline.\u000b\u000b2. Men at high risk for prostate cancer should talk to their primary care provider before age 40 about prostate cancer.\u000b\u000b3. At or over age 70, the decision to end prostate cancer screening should be based on an informed discussion with their primary care provider.\u000b \nWhile the PSA test is not currently used in Canada as a population-wide screening tool, it is used to monitor how someone responds to cancer treatment or to monitor disease recurrence or progression.\n\u000b\n",
            "SLIDE #: 46 || PSA: Case study\n69 y man presented to the  medical clinic with complaints of increased frequency of urination and difficulty urinating. \nFurther questioning revealed the need to urinate several times a night. \nAlthough the problem has been present for some time, it has recently become worse. \nA serum prostate-specific antigen (PSA) was obtained and a digital rectal examination (DRE) was performed.\nPSA \t15 μg/L\nDRE\tenlarged prostate without palpable nodules\n",
            "SLIDE #: 47 || PSA: Case study\nQuestions:\nCan serum PSA be used alone as a screening test for prostate cancer?\nWhat are some causes for an elevated serum PSA level?\nNo. PSA used in conjunction with DRE and trans rectal ultrasound to improve prostate cancer detection.\nBenign prostatic hyperplasia\nProstatitis\nPhysical injuries: urethral catheterization, DRE, biopsy\nPhysical activities: cycling, prostatic massage\n",
            "SLIDE #: 48 || PSA: Case study\nQuestions:\nIf this patient has cancer limited to the prostate, should PSA levels be monitored  after radical prostatectomy and/or radiation therapy?\nYes. PSA is extremely useful for monitoring cancer recurrence in patients following therapeutic intervention for prostate cancer.\nPSA (ug/L)\nAfter therapy, PSA levels should be extremely low or undetectable, with rising levels indicating recurrent disease. There is a direct relationship between the serum PSA concentration and the volume of prostate gland.\n"
        ]
    }
]