[
    {
        "pptName": "Feb 10 - Intro to Endocrine System",
        "slides": [
            "slide 3: hormones defn: chemical from glands or cells. Autocrine or paracrine",
            "slide 4: neurotransmitters defn: synthesized in pre-synaptic neuron and travel in synapse; does not reach cells via bloodstream",
            "slide 5: neuroendocrine cells defn: nerve cells secrete into bloodstream; hypothalamus to anterior pituitary via portal circulation",
            "slide 6: principle site of endocrine glands: diagram of major glands",
            "slide 7: chart of gland/hormones released/function/type",
            "slide 8: structure of hormones: lipid soluble and water soluble",
            "slide 9: transport of hormones: hydrophilic or hydrophobic carriers",
            "slide 10: transport of hormones: only free parts can bind to receptors – ideally you want to measure the free portion in lab because that’s what corresponds to activity",
            "slide 11: control of endocrine system: simple/negative feedback/positive feedback e.g. LH",
            "slide 12: control of endocrine system: inhibitory control e.g. dopamine and prolactin/endocrine rhythms e.g. cortisol, vitamin D",
            "slide 13: endocrine disorders: over-secretion = loss of negative feedback e.g. ectopic secretion/under-secretion = loss of stimulation e.g. organ failure/disordered metabolic pathway = reduced end product, increased intermediates e.g. congenital hyperplasia",
            "slide 14: ectopic hormones defn: hormones produced by tumours e.g. small cell lung carcinoma produces ACTH which is normally made in pituitary",
            "slide 15: measurements of hormone concentrations: bioassays – time consuming, poor accuracy/precision/rarely used",
            "slide 16: measurements of hormone concentrations: chemical reactions – nonspecific/insensitive/imprecise/not used",
            "slide 17: measurements of hormone concentrations: chromatography – works well for small molecules/LC-MS/MS is method of choice for small analytes",
            "slide 18: measurements of hormone concentrations: immunoassays – automated/accurate/nonspecific/measures concentration not activity/best for large molecules",
            "slide 19: basic components of immunoassays: analyte, antibodies, label/detection system, method to separate bound from free",
            "slide 20: competitive immunoassays: analyte and tracer (labelled hormone) compete for limited amount of antibody. Can be simultaneous or sequential. Signal inversely proportional to analyte concentration",
            "slide 22: competitive immunoassays: examples of mechanisms used to separate bound and free tracer",
            "slide 23: non-competitive (sandwich) immunoassays: uses large amount of antibodies and all analyte will bind. Second antibody (labelled detection) binds to epitope on analyte. Signal is proportional to concentration of the analyte",
            "slide 24: competitive immunoassays vs non-competitive immunoassay chart",
            "slide 25: immunoassay labels: list of labels used",
            "slide 28: tandem mass spectrometry (LC-MS/MS): measures small molecules and metabolites in urine or steroid hormones in blood",
            "slide 29: catecholamines and metabolites: examples measured by mass spec: neural crest tumours (neuroblastoma,  pheochromocytoma,  ganglioneuroma)",
            "slide 30: LC-MS/MS: two stages; one to preselect an ion and second to analyze fragments induced by collision with inert gas",
            "slide 31: LC-MS/MS for catecholamines: diagrams",
            "slide 32: more specificity than immunoassays"
        ]
    },
    {
        "pptName": "Feb 12 – The Hypothalamic-Pituitary Axis",
        "slides": [
            "slide 3: pineal gland: produces melatonin. Stimulated by darkness and promotes sleep",
            "slide 4: location of the endocrine cells in the brain - diagram",
            "slide 5: pituitary gland – labelled diagram and location in the brain",
            "slide 6: pituitary gland – labelled diagram",
            "slide 7: hypothalamic-pituitary axis",
            "slide 8: hormones of the hypothalamus: chart of name/alternative names/abbreviations/function",
            "slide 9: anterior pituitary hormones: chart of name/alternative names/abbreviations/target organ/effect",
            "slide 10: anterior pituitary hormones: cells that secrete thyroid-stimulating hormone does not also secrete growth hormone ",
            "slide 11: hormones of the pituitary gland: list of the body processes pituitary hormones control ",
            "slide 12: feedback loop: diagram of feedback loop for thyroid hormones",
            "slide 14: surgical approach: diagram of transsphenoidal surgery",
            "slide 15: hormones of the posterior pituitary: oxytocin – made in hypothalamus and stored in posterior pituitary. Stimulates uterine contraction and induces labor. Stimulates milk release during suckling. Not measured in laboratory tests",
            "slide 16: hormones of the posterior pituitary: ADH (anti-diuretic hormone) – made in hypothalamus and stored in posterior pituitary. Increases reabsorption of water by kidneys; translocates aquaporins to plasma membrane and prevents excess loss",
            "slide 17: regulation of ADH levels: dehydration/low blood volume stimulates/high osmolality release. Osmolality detected by osmoreceptors in the hypothalamus. Baroreceptors detect low blood pressure. Urine osmolality increased due to ADH secretion",
            "slide 18: osmolality: serum and urine osmolality measured by osmometry. Osmometers measure freezing point depression which is proportional to concentration of solutes in fluid",
            "slide 19: osmometry: chart of thermodynamics of sample vs temperature",
            "slide 20: diabetes insipidus: can be central (low ADH/high serum osmolality/ low urine osmolality with high urine volume output and thirst) or nephrogenic ( high ADH/ high serum osmolality/low urine osmolality with high urine volume output and thirst)",
            "slide 21: diabetes insipidus: water deprivation test – deprive water and measure urine and serum osmolality; administer ADH and do again to distinguish central from nephrogenic",
            "slide 22: ADH measurement: more common to measure copeptin as surrogate of ADH rather than assays because they are tedious, time consuming and poor precision",
            "slide 23: copeptin: derived from same precursor protein as ADH",
            "slide 24: advantages of measuring copeptin over ADH: more stable, correlates better with osmolality, assays are quick/automated/excellent precision",
            "slide 25a: syndrome of inappropriate ADH (SIADH): overproduction of ADH (high ADH, hyponatremia due to excess water, low serum osmolality, high urine osmolality) ",
            "slide 25b: syndrome of inappropriate ADH (SIADH): caused by head trauma, tumour, or some drugs. Treat underlying cause and restrict fluids"
        ]
    },
    {
        "pptName": "Feb 14 – The thyroid gland/thyroid function test/disorders of the thyroid",
        "slides": [
            "slide 3: thyroid gland: located below larynx. Gland size increases in areas with iron deficiency",
            "slide 4: hypothalamic-pituitary-thyroid axis: diagram: labelling of T3 and T4 depends on iodine moieties on the tyrosine molecules",
            "slide 5: thyroid stimulating hormone: diagram of structure. Alpha subunit is common for glycoproteins TSH, LH, FSH, hCG. They have unique beta subunits",
            "slide 6: thyroid follicular cells: thyroid gland consists of follicular cells (arranged around a colloid. More abundant and secrete thyroid hormone) and parafollicular (C) cells (secrete calcitonin)",
            "slide 8: thyroid hormones: diagram of synthesis pathway",
            "slide 9: thyroid hormones: binding of TSH to TSHR leads to increased uptake of iodine, increased synthesis of thyroglobulin and thyroperoxidase, increased uptake of colloid by follicular cells, and increased degradation and release of thyroid hormoens from thyroglobulin ",
            "slide 10: thyroid hormones: 80% secreted as T4, only T3 has hormone function, most T3 produced by peripheral deiodination of T4, most T3 and T4 bound to proteins in circulation, free hormone is biologically active",
            "slide 11: control of thyroid hormone production: thyroid dysgenesis causes low T4 and high TSH",
            "slide 12: iodine intake and thyroid function: insufficient dietary iodine causes low T4, high TSH, and goitre (hypertrophy)",
            "slide 14: biological actions of thyroid hormones: T3 binds to nuclear receptors. List of principles effects",
            "slide 15: causes of hyperthyroidism (thyrotoxicosis) and lab tests: primary – Graves disease: autoantibodies against TSH receptor bind and stimulate TSH receptors. Low TSH and high FT4 and FT3. Secondary – pituitary adenoma that excessively secretes TSH. High TSH, FT4, and FT3",
            "slide 16: clinical features/symptoms of hyperthyroidism: nervousness, irritability, bulging eyes, menstrual irregularities, warm/moist palms, increased sweating/heat intolerance, hoarseness/deep voice, persistent sore or dry throat, difficulty swallowing, goitre, irregular or rapid heartbeat, infertility, difficulty sleeping, frequent bowel movements, weight loss, diabetes",
            "slide 17: treatment of hyperthyroidism: list",
            "slide 18a: causes of hypothyroidism and lab tests: primary – insufficient iodine, drug or surgery induced thyroidal hypofunction, hashimoto’s thyroiditis (autoimmune destruction of thyroid; antibody is usually against TPO or Tg). Low FT4 and FT3, high TSH",
            "slide 18b: causes of hypothyroidism and lab tests: secondary – pituitary insufficiency due to malignancy, ischemia, head trauma. Low FT4, FT3, and TSH",
            "slide 18c: causes of hypothyroidism and lab tests: tertiary – hypothalamic dysfunction. Low FT4, FT3, TSH",
            "slide 19: clinical features/symptoms of hypothyroidism: thinning hair/hair loss, puffy face, dry and coarse skin, cool extremities, enlarged thyroid (goitre), slow heartbeat, poor appetite, infertility, heavy menstruation, carpal tunnel syndrome, weight gain, poor memory, intolerance to the cold, feeling of tiredness",
            "slide 20: treatment of hypothyroidism: list",
            "slide 21: TSH test: primary screening test. Most sensitive indicator of thyroid hormone activity (log-linear relationship between T4 and TSH; inverse relationship is primary disorder, not inverse is secondary)",
            "slide 22: thyroid function tests: measurement of free T4 needed to differentiate between hyper and hypo- and between primary and secondary. T4 reliably predicts T3 and has longer half-life (T3 more susceptible to short term variations)",
            "slide 23: measurement of FT4 and FT3: small therefore competitive immunoassay and measure free (active) portion",
            "slide 24: lab investigation of thyroid disease: TRH test – differentiate between secondary and tertiary. Thyroid binding immunoglobin (TSI or TBII) – May bind to TSH receptor and stimulate the thyroid gland  as if TSH (TSI, causing hyperthyroidism) or block it from  binding TSH (TBII, causing hypothyroidism). Anti-Tg, Anti-TPO – for hashimoto’s thyroiditis (primary hypothyroidism) ",
            "slide 25: lab investigation of thyroid disease: thyroglobulin – follicular cell thyroid cancers produce high levels of Tg. Tg monitored in patients and indicates recurrence. Calcitonin – tumor marker for C-cell carcinoma of thyroid gland",
            "slide 26: algorithm for initial assessment of thyroid function",
            "slide 27: parathyroid glands: secrete parathyroid hormone (PTH) which regulates calcium levels",
            "slide 28: parathyroid hormone: low concentration of calcium causes release of PTH which goes to bone (efflux of calcium from bone), kidneys (decreased loss of calcium in urine and stimulation of enzyme to make vitamin d), and intestine (vitamin d causes enhanced absorption of calcium at intestines)",
            "slide 29: parathyroid hormone: Intact PTH sandwich/non-comp. assays will recognize amino acids 1-84 (active) as well as 7-84 (inactive). One recognizes N and the other the C terminal. Newer assays detect 1-84"
        ]
    },
    {
        "pptName": "Feb 24 – Adrenal Cortex",
        "slides": [
            "slide 3: functional anatomy of adrenal gland: cortex divided into three zones – glomerulosa makes aldosterone, fasiculata makes cortisol, reticularis makes androgens",
            "slide 4: functional anatomy of the adrenal gland: diagram",
            "slide 5: steroid hormones: cortisol – controlled by pituitary via ACTH, aldosterone – controlled through RAAS, androgens – controlled by pituitary ACTH",
            "slide 6: biosynthesis of hormones of the adrenal cortex (adrenal steroids): pathway shown, DHEA-S is measured in lab",
            "slide 7: hypothalamic-pituitary-adrenal axis: diagram, stress such as physical, emotional, hypoglycemia, cold exposure and pain stimulate CRH",
            "slide 8: metabolic actions of cortisol: list – gluconeogenesis, deposition of fat, anti-inflammatory, increase sodium reabsorption and potassium excretion",
            "slide 9: metabolic actions of aldosterone: sodium reabsorption and potassium excretion at DCT and collecting duct, more potent than cortisol",
            "slide 10: Renin-Angiotensin-Aldosterone System (RAAS): Pathway diagram",
            "slide 11: adrenal androgens: DHEA and androstenedione in females, and testosterone and DHT in males",
            "slide 12: cushing’s syndrome: excessive production of cortisol by adrenal gland; caused by tumor, adrenal hyperplasia, or ectopic ACTH production by tumor. If the cause is due to a pituitary overproduction  of ACTH by a pituitary adenoma, the clinical  picture is the same, but condition now called  Cushing’s Disease",
            "slide 13: cushing’s syndrome: diagram of causes",
            "slide 14: cushing’s syndrome symptoms: central obesity/thin extremities, buffalo hump, moon facies, increase sweating, thinning of skin, bruising,stretch marks, irritability/depression, osteoporosis, insulin resistance/diabetes mellitus, hypertension, immune suppression, menstrual disorders, male pattern hair growth, baldness, hypercholestermia",
            "slide 15: diurnal variation in cortisol level: high in morning and low at midnight, someone with cushings loses diurnal variation (more constant elevation)",
            "slide 16: laboratory diagnosis of cushings syndrome/disease: Measurement of serum cortisol reflects total cortisol and  is subject to diurnal variation. Measurement of cortisol in a 24-hour urine specimen  reflects free (active) cortisol and collection over a 24-hour period helps to normalize for effects of diurnal  variation. Salivary cortisol also reflects free cortisol; usually collected around midnight",
            "slide 18: laboratory diagnosis of cushings syndrome/disease: ACTH measured to differentiate primary and secondary; Dexamethasone suppression test – low dose will suppress cortisol in normal individuals, high dose will suppress high cortisol levels due to pituitary adenoma ectopic ACTH-producing tumors will not be supressed",
            "slide 19: laboratory diagnosis of cushings syndrome/disease: flowchart/diagram",
            "slide 20: petrosal vein sampling: if ACTH increases in petrosal vein relative to peripheral blood upon CRH stimulation then pituitary adenoma. If not, then ectopic ACTH production",
            "slide 21a: adrenal insufficiency (addison’s disease): primary – often autoimmune disease against adnreal gland or adrenal dysgenesis, impaired steroidgenesis, corticosteroid withdrawal. All types result in low cortisol but primary can result in low aldosterone",
            "slide 21b: adrenal insufficiency (addison’s disease): secondary – low ACTH due to pituitary insufficiency. Tertiary – insufficient CRH production by hypothalamus. All types result in low cortisol but primary can result in low aldosterone",
            "slide 22: primary adrenal insufficiency (addison’s disease): low cortisol, high ACTH. Low cortisol leads to hypoglycemia. Low cortisol and aldosterone to low sodium and high potassium. Low aldosterone can also lead to metabolic acidosis which leads to hypercalcemia. Lab diagnosis involves measurement of cortisol, ACTH, sodium, potassium and sometimes antibodies against adrenal gland",
            "slide 23: adrenal insufficiency (addison’s disease): ACTH is small polypeptide fragmented from large molecule containing melanocyte stimulating hormone so increase in ACTH production can increase pigmentation",
            "slide 24: hyperaldosteronism: primary (Conn’s syndrome) – tumor in adrenal cortex producing aldosterone. Results in high sodium, low potassium, high serum and urinary aldosterone, and low levels of plasma renin. Secondary – e.g. renin-secreting tumor",
            "slide 25: congenital adrenal hyperplasia: diagram of pathway. Most commonly it is 21-hydroxylase that is affected resulting in accumulation of 17-OH-progesterone. Eventually results in excess synthesis of adrenal androgens",
            "slide 27: congenital adrenal hyperplasia: laboratory diagnosis – high levels of 17-OH progesterone. Treatment – replacement of glucocorticoids and mineralcorticoids"
        ]
    },
    {
        "pptName": "Feb 28 – Adrenal Medulla and Hormonal Control of Growth",
        "slides": [
            "slide 3: adrenal medulla: central portion of adrenal gland. Effects of catecholamines list",
            "slide 4: pheochromocytoma: catecholamine-producing tumours. Symptoms: tachycardia/palpitations, hypertension, headaches, sweating, anxiety, hyperglycemia, weight loss. The diagnosis is based on measuring the catecholamines  (or usually their metabolites (metanephrines)) in urine or  plasma",
            "slide 5: catecholamines and metabolites: metanephrinesis is only produced in adrenal medulla therefore best to measure it rather than catecholamines",
            "slide 7: human growth hormone: secreted by anterior pituitary in pulsatile manner under GHRH. Inhibited by hypothalamic stomatostatin. Carried in plasma in free form and bound to GH binding protein. Major action sites are bone and liver. Most action is mediated through another hormone, like IGF-1",
            "slide 8: growth hormone and IGF-1 regulation: diagram of pathway and stimualation",
            "slide 9: IGF-1: liver is major source of IGF-1 but other cells that contain GH receptors also produce it. 98% in plasma is protein bound to IGFBP3. Acts in autocrine or paracrine fashion",
            "slide 10: actions of growth hormone: list",
            "slide 11: glucose regulation: hormones that decrease blood glucose – insulin. Increase blood glucose – cortisol, catecholamines, growth hormone, glucagon",
            "slide 12: glucose regulation: low blood glucose stimulates growth hormone (GH) secretion. High blood glucoses suppresses growth hormone secretion",
            "slide 13: assessing growth hormone pathway: occurs in pulses throughout day and especially night. Measurement of IGF-1 more helpful. Stimulation and suppression tests also used",
            "slide 14: growth hormone deficiency: in adults, reduced bone and muscle mass, increased body fat, and impaired brain function. In child, pituitary dwarfism (classical dwarfism)",
            "slide 16: laron dwarfism: mutation in GH receptors. Can’t respond to GH and IGF01 levels are low",
            "slide 18: possible causes of short stature: list",
            "slide 19: investigation of short stature: list of causes",
            "slide 20: investigation of GH deficiency: stimuli used to increase GH secretion – insulin, exercise, glucagon (causes insulin release), arginine (suppress somatostatin). Blood drawn before and after stimulus and GH measured and glucose (if stimulus is insulin)",
            "slide 21: growth hormone excess: GH excess leads to – gigantism in children and acromegaly in adults. Diagnosis is based on lack of suppression of GH level after glucose supplementation",
            "slide 23: acromegaly: enlargement of soft tissue such as hands, feet, nose, lips, ears, heart, kidneys, vocal cords. Brow and jaw protrusion"
        ]
    },
    {
        "pptName": "Mar 2 – Reproductive Endocrinology",
        "slides": [
            "slide 3: puberty in males",
            "slide 4: hypothalamic-pituitary-gonadal axis in males: GnRH stimulates LH and FSH by anterior pituitary. LH promotes synthesis of testosterone by Leydig cells. FSH stimulates spermatogenesis by Sertoli cells which also produces inhibin which has negative feedback inhibition (as does testosterone)",
            "slide 5: adrenal androgens: Androstenedione and DHEA (DHEAS) are androgens made in the adrenal cortex in both males and females. Adrenal androgens are relatively weak as androgens when compared to testosterone and DHT",
            "slide 6: gonal androgens in males: Androstenedione and DHEA from the adrenal gland act as precursors for testosterone synthesis by the testes. Most testosterone in circulation is bound to sex-hormone binding globulin (SHBG). Testosterone is converted to dihydrotestosterone (DHT) by 5α-reductase in target tissues. DHT is a more potent androgen than testosterone",
            "slide 7: androgen resistance: genetic disorder due to lack of the testosterone receptor or deficiency of 5α-reductase. The genetic deficiency results in a patient with a high testosterone level and a low level of DHT. In males, can result in ambiguous genitalia at birth, failure to undergo puberty, infertility. Degree of symptoms depends on degree of defect",
            "slide 8a: hypogonadism in males: primary - Kleinfelter’s syndrome (47XXY), Testicular agenesis, Mumps (orchitis), Varicocele, Radiation/chemotherapy. Low testosterone, high LH/FSH",
            "slide 8b: hypogonadism in males: secondary - Isolated gonadotropin deficiency. Pituitary damage (panhypopituitarism). Tumours in the pituitary (e.g. prolactinoma). Low LH/FSH, low testosterone. Tertiary – kallmann syndrome (x-linked abnormality in GnRH production. Low LH/FSH, low testosterone)",
            "slide 9: hypogonadism in males: symptoms include delayed puberty, infertility. Treat underlying cause. Other treatments are testosterone, LH, FSH, GnRH",
            "slide 10: puberty in females: increased adrenal androgen and pulsatile GnRH production",
            "slide 11: hypothalamic-pituitary-gonadal axis in females: FSH promotes ovarian follicle development which eventually results in estrogen and progesterone production by corpus luteum after ovulation. LH promotes ovulation",
            "slide 12: esterdiol and progesterone: functions",
            "slide 13: menstrual cycle: follicular phase - levels of LH and FSH have been suppressed by the previously high estradiol levels, but gradually they start to increase, which results in follicular development via FSH and estradiol production via LH. Ovulation -estradiol concentration increases above a threshold where it actually stimulates an increase in LH levels, which induces  ovulation",
            "slide 14: menstrual cycle: luteal phase – corpus luteum produces progesterone and esterdiol, which thicken uterine lining and prepare for implantation. If fertilization does not occur, uterine lining sheds",
            "slide 15: ovulation, fertilization and implantation: diagram of beginning of fertilization",
            "slide 16: menstrual cycle with implantation: diagram of cycle",
            "slide 17: hormonal changes with pregnancy: hCG produced by trophoblastic cells of embryo. hCG maintains corpus luteum which keeps endometrium until placenta is developed enough to take over producing esterdiol and progesterone",
            "slide 18: hCG levels during pregnancy: detected as early as 6 days after conception. Pregnancy is considered to start on day 1 of last menstrual cycle, conception occurs 2 weeks so pregnancy 3-4 weeks along by time hCG is measured. Once placenta is developed and functional, hCG levels decline but remain elevated",
            "slide 19: hypogonadism: primary – turners syndrome, radiation/chemotherapy. Low esterdiol, high LH/FSH. Secondary – isolated gonadotropin deficiency, pituitary damage panhypopituitarism, tumors in pituitary. Low LH/FSH, low esterdiol. Tertiary – kallmann syndrome. Low LH/FSH, low esterdiol",
            "slide 20: hypogonadism in females: symptoms are delayed puberty, infertility, menstrual irregularities. Treat underlying cause, may include estrogen, progesterone, LH, FSH, GnRH",
            "slide 21: ectopic pregnancy: symptoms are abdominal pain, bleeding as embryo grows and puts pressure on fallopian tubes and other structures",
            "slide 22: ectopic pregnancy: hCG measurement and ultrasound used to check for it. normal doubling time for hCG is 2 days, ectopic pregnancy there is less than 66% rise in hCG in 48 hours (longer doubling time)",
            "slide 23: ectopic pregnancy: surgery if imminent risk of rupture or methotrexate",
            "slide 26: hCG has tumor marker: hCG may be increased in molar pregnancy (defective embryo), placental tumor (choriocarcinoma), non-seminiferous testicular cancer",
            "slide 27: hCG has tumor marker: pregnancy - hyperglycosylated hCG and free beta more common in early pregnancy; mostly intact hCG from 2nd trimester on. Trophoblastic and germ cell tumors mostly make intact hCG. Non-trophoblastic tumors (e.g. biliary, pancreatic, balder) make only free beta"
        ]
    },
    {
        "pptName": "Mar 11 – Glucose and Diabetes",
        "slides": [
            "slide 3: insulin: protein hormone produced and stored in beta cells of pancreas. Secreted in response to high blood glucose. Binding to insulin receptors causes translocation of GLUT4 to cell surface allowing for glucose uptake by adipose and striated muscle cells",
            "slide 4: hormones that increase blood glucose level in hypoglycemia: list",
            "slide 5: diabetes: classic symptoms – polyuria (high urine volume), polydipsia (excessive thirst), unexplained weight loss",
            "slide 6: type 1 diabetes mellitus: primarily result of pancreatic beta cell destruction due to immune-mediated process. Occurs due to absolute deficiency of insulin",
            "slide 7: treatment of type 1 diabetes: insulin administration",
            "slide 8: pancreas and islet transplantation: can result in prolonged insulin independence. Islet transplant result in transient insulin independence and reliably stabilize blood glucose",
            "slide 9: diabetic ketoacidosis (DKA): high blood glucose (hyperglycemia) due to non functioning insulin and gluconeogenesis/glycogenlysis. Fatty acids will be oxidized to ketones to fuel brain and heart so ketone levels will be high. Ketones are acidic and can causes metabolic acidosis. Symptoms are polyuria (high urine volume), dehydration, thirst, hyperventilation, acetone breath, vomiting, confusion, coma, death if not treated",
            "slide 10: DKA: occur in people who don’t realize they have diabetes or people not taking sufficient insulin. Most common in type 1 diabetics. Blood glucose and beta-hydroxybutyrate are most help tests. Treatment is insulin",
            "slide 11: ketones",
            "slide 12: DKA: potassium leaks out of cells due to impaired ATP production and some is excreted due to polyuria. As insulin is given, fuels Na/K ATPase and can cause K levels to drop to dangerous levels",
            "slide 13: type 2 diabetes mellitus: insulin resistance when reserve capacity to store fat reduced, signalling changes, and levels of free fatty acids in circulation increases. Initially greater insulin production due to reduced response but then progresses to type II when pancreas can’t produce enough insulin to keep blood glucose at normal level. More a condition of relative insulin deficiency than absolute",
            "slide 14: treatment of type 2 diabetes",
            "slide 15: metabolic syndrome: diagnosis requires 3 of the following – abdominal obesity, hypertension, elevated fasting blood glucose, hyperlipidemia, low HDL",
            "slide 16: long term complications of diabetes (Type 1 and 2): increased glycation reactions which leads to microvascular and macrovascular complications",
            "slide 17: methods of measuring glucose: hexokinase – photometric, glucose oxidase – photometric linked with peroxidase, oxygen selective electrode, glucose dehydrogenase – photometric ",
            "slide 18: hexokinase",
            "slide 19: glucose oxidase",
            "slide 20: glucose dehydrogenase",
            "slide 21: glucose stability (collection): separate from cells after collection if you intend to measure it. Additive NaF can inhibit glycolysis by inhibiting enolase. Only useful if samples takes more than one hour to be analyzed because enolase is late in pathway",
            "slide 22: diagnosis of diabetes: chart",
            "slide 23: glucose tolerance test: graph/chart: diabetic has higher levels",
            "slide 24 + 25: hemoglobin A1c (HBA1c): gives insight into average blood glucose over 2-3 months, procedure available to measure, factors increasing, factors decreasing",
            "slide 26: diagnosis of diabetes: advantages and disadvantages of parameters ",
            "slide 27: glucometers: based on glucose oxidase or dehydrogenase. Measures glucose in whole capillary blood (lab instruments measures in venous blood). Sometimes used in POCT",
            "slide 28: should be compared to lab instruments annually. Do not have same precision at low glucose levels as lab instruments.",
            "slide 29: fructosamine: glycated albumin, since it has shorter half life than Hb, it gives indication of glucose control over the past 4 weeks. Test used in place of HbA1c in people with contraindications for HbA1c testing or when there is interest in determining blood glucose control over shorter window of time. Not validated for diagnosis of diabetes",
            "slide 30: fructosamine: reduced NBT in alkaline solution to purple dye",
            "slide 31: glucose in urine: urine dipstick test to detect glucose in ruine. Test can suggest presence of diabetes but not validated for diagnosis",
            "slide 32: insulin: diagram of forms (preproinsulin to proinsulin to insulin to C-peptide)",
            "slide 33: insulin: measured by immunoassay. C-peptide is only produced endogenously and not found in injected forms, measurements of it help distinguish endogenous production from exogenous insulin (e.g. Munchausen syndrome vs insulinoma). C-peptide can also be measured in diabetics treated with insulin to see how much endogenous insulin is being produced"
        ]
    },
    {
        "pptName": "L4-Knauer-TDM",
        "slides": [
            " || SLIDE #: 1",
            "Therapeutic Drug  MonitoringClinical Biochemistry 3386bMichael Knauer PhD, FCACB  michael.knauer@lhsc.on.ca || SLIDE #: 2",
            "Therapeutic Drug MonitoringObjectives:TDM in the context of pharmacological principlesThe parameters involved in TDMThe role of appropriate sampling in TDMSpecial case examples – particular applications in  TDM. || SLIDE #: 3",
            "Therapeutic Drug MonitoringWhat is it and Why is it Done?Therapeutic Drug Monitoring(TDM) refers to the  measurement of drug  concentrations in the blood  or plasma of a patient to  keep it within a target range.TDM provides information  about the adequacy of  dosing of the drug regimen  and the likelihood of toxicity  associated with the drug.TDMDosingToxicityMonitoringThings that affect tdm is dosing, compliance/monitoring (person is taking it or not), toxicity (taking too much) || SLIDE #: 4",
            "Which Drugs need TDM?Narrow Therapeutic RangeSignificant pharmacokinetic variabilityA reasonable relationship between plasma  concentrations and clinical effects; however the  pharmacological effect is hard to measureMedications prone to drug interactionsCompliance issues or drugs prone to therapeutic  failure || SLIDE #: 5",
            "Why do Therapeutic Drug Monitoring  (TDM)?Narrow Therapeutic RangeDrugs have therapeutic rangesTaking a drug orally is in this diagram As you take it, concentration goes up peaks, and as eliminated it goes downReaches blue in is the minimum therapeutic effectOnce it goes below level of effect there is no pain relief Toxic concentration is exceeding rightMore dangerous drugs have smaller therapeutic ranges – harder to keep drug level effective yet not toxicMost durgs tho, you don’t take once, you take repeatablyThe challenge is to keep the peak and trough in the therapeutic range in each successive dosingDpeening on range, it could be hrader or easier to keep the drug in the safe zone || SLIDE #: 6",
            "Therapeutic Range with  Repeated DosingBlue line is continuous infusion (IV) / red Is oralHow constant influion would get you up in the range and keeps you in the correct range so you don’t have overdosing and eventually get to steady state concentrationAs long as noghting perturbes steady state that dose will keep you in the therapeutic range || SLIDE #: 7",
            "Why do Therapeutic Drug  Monitoring (TDM)?Variable  PharmacokineticsWhat the body does to the drugAbsorptionDistributionMetabolismEliminationWhen you first take it you have to absorb it from GI tractDistrinbute it around body through venous system and get to site of actionMetabolism – via liver and kidney to eliminate to more polar molecules or deactivate the drug to inactive metabolite (also some cases wehre you take inactive drug and activate in body)Eliminate is getting rid of it  || SLIDE #: 8",
            "Why do Therapeutic Drug  Monitoring (TDM)?Variable  PharmacokineticsNot One Dose Fits AllLevyBioDrugs, 2001Inter-patient Variability in Cylosporine  Blood Levels in Renal Transplant PatientsDiff people have diff pharmacokineticsLines don’t overlap – peak happens at diff points for diff peoplePeak height (amount of absorption) different between peopleThere is significant variability in terms of giving same drugs nad what happens after taking it  || SLIDE #: 9",
            "Pharmacokinetics – Fate of a Drug taken  OrallyFirst Pass  Effect.\nThere are rate equations to monitor drugs when they come into bodyTake it, absorbed in small intestine, portal vein to liver which converts from parent molecule to metabolite, which is then excreted or sent to bile to be eliminatedWhen you take a drug not all the drug gets into circulation; percentage gets eliminated before and bioavailability (amount of drug that makes it into systemic circulation – e.g. 70% bioavailability means 70% makes it to ciruclaiont  after liver– you can bypass this by IV which has 100% bioavailability)Drug parent and drug metabolite are in equilibrium with compartments – e.g. compartment could be fat store, muscle, or single organEffect compartment is when drug ofi nterest and organ of interest (eg. Knee for knee pain); drug and metabolite would all distributeThey can equilibrate back to centre compartment and this is where you can eliminate the drug (through kidney or liver by urine or feces) || SLIDE #: 10",
            "There are rate equations to monitor drugs when they come into bodyTake it, absorbed in small intestine, portal vein to liver which converts from parent molecule to metabolite, which is then excreted or sent to bile to be eliminatedWhen you take a drug not all the drug gets into circulation; percentage gets eliminated before and bioavailability (amount of drug that makes it into systemic circulation – e.g. 70% bioavailability means 70% makes it to ciruclaiont  after liver– you can bypass this by IV which has 100% bioavailability)Drug parent and drug metabolite are in equilibrium with compartments – e.g. compartment could be fat store, muscle, or single organEffect compartment is when drug ofi nterest and organ of interest (eg. Knee for knee pain); drug and metabolite would all distributeThey can equilibrate back to centre compartment and this is where you can eliminate the drug (through kidney or liver by urine or feces)The effect of a single oral dose of a drug  on its concentration in serum/ plasmaExample of a two compartment model.\nSlow eliminatation Modelled by two rate curcesDrug distributing into tissues in the body (faster rate)Slower elimination rate – drug eliminated through urine or feces || SLIDE #: 11",
            "Slow eliminatation Modelled by two rate curcesDrug distributing into tissues in the body (faster rate)Slower elimination rate – drug eliminated through urine or fecesT1/2 (Elimination) Half  LifeTime required for the concentration  of a drug to be reduced by half  (50%)..\nNot all drugs are thes same for half life || SLIDE #: 12",
            "Not all drugs are thes same for half lifeHalf Lives - ExamplesAcetaminophen –2 hCodeine –3 hTheophylline –8 hCarbamazepine –15 hLithium –22 hDigoxin –39 h(1.6 d)Sirolimus –69 h(2.9 d)Phenobarbital –99 h(4.1 d).\nDigoxin drug for heartSirolimus immunosuppresentPhenobarbital antieppilypeticNot everyone has same half life || SLIDE #: 13",
            "Digoxin drug for heartSirolimus immunosuppresentPhenobarbital antieppilypeticNot everyone has same half lifeThe effect of multiple identical  doses on drug concentrationCmax & Cmin = maximum & minimum  concentrationsC = average steady state concentration  MTC = minimum toxic concentration  MEC = minimum effective  concentrationAUC = Area Under the Curve (a  measure of the exposure of the  patient to the drug)τ = dosing interval.\nMinimul effective concentration is blue zoneMiddle is therapeutic rangeEach oral dosing gets you into therapeutic range and you hit your steady stateTime between dosing is dosing interval - it is approximating half lfie of the drug (take it once a day if half life is 24 hours e.g.)AUC is area under curve – can tell you how well the drug is absorbed and how much exposure individual getsC trough – what happens right before next oral doseMean is steady state concentrationHow long does it take to get to steady state? 5 half lives to get to stady state or 5 half lives to eliminate the drugs || SLIDE #: 14",
            "Minimul effective concentration is blue zoneMiddle is therapeutic rangeEach oral dosing gets you into therapeutic range and you hit your steady stateTime between dosing is dosing interval - it is approximating half lfie of the drug (take it once a day if half life is 24 hours e.g.)AUC is area under curve – can tell you how well the drug is absorbed and how much exposure individual getsC trough – what happens right before next oral doseMean is steady state concentrationHow long does it take to get to steady state? 5 half lives to get to stady state or 5 half lives to eliminate the drugsEffect of frequency of dosing.\nFrequency and dosing amount to keep it in range? In this example you see:Infusion of drug at 28 mg/h – reaches steady state and is pretty consistent Same drug at 224 mg/h (three times in a day – tid) orally, you can see effects as it peaks and troughs as it gets to theraptutic range – doesn’t matter what dosing you took it takes same amount of time to get into the range (5 half lives)Conveniemce is having to take the drug once a dayVurve has wider swings in peaks and troughs at higher concetration For a narrow range, you want to avoid more swings so you have to lower does and increase dosing interval to keep swings smaller and keep it in thereapuetic range || SLIDE #: 15",
            "Frequency and dosing amount to keep it in range? In this example you see:Infusion of drug at 28 mg/h – reaches steady state and is pretty consistent Same drug at 224 mg/h (three times in a day – tid) orally, you can see effects as it peaks and troughs as it gets to theraptutic range – doesn’t matter what dosing you took it takes same amount of time to get into the range (5 half lives)Conveniemce is having to take the drug once a dayVurve has wider swings in peaks and troughs at higher concetration For a narrow range, you want to avoid more swings so you have to lower does and increase dosing interval to keep swings smaller and keep it in thereapuetic rangeLoading doses.\nIf you can’t wait 5 half lives to get to therapeutic level in a drug so this is where loading doses come inDrugs wit hlong half life and you need effect rapidly (e.g. anticlotting drug) you want to give massive dose right off the bat (loading dose) and then maintance dose (smaller dose) to keep htem in the range || SLIDE #: 16",
            "If you can’t wait 5 half lives to get to therapeutic level in a drug so this is where loading doses come inDrugs wit hlong half life and you need effect rapidly (e.g. anticlotting drug) you want to give massive dose right off the bat (loading dose) and then maintance dose (smaller dose) to keep htem in the rangeLoading Dose -  CalculationC = 1.44 t1/2 DVdTWhere C is the average drug concentration in plasma  Vd is the apparent volume of distributiont1/2 is the elimination half-lifeD is the maintenance dose for this drug conc’n  T is dosage interval (time between doses).\nVd is where the theoretical space of where the drug goes in body – 5-6 L than the drug stays in blood volume, 1000 L then it stays in circulation and starts going into the tissueYou can look up Vd is for a drug || SLIDE #: 17",
            "Vd is where the theoretical space of where the drug goes in body – 5-6 L than the drug stays in blood volume, 1000 L then it stays in circulation and starts going into the tissueYou can look up Vd is for a drugLoading Dose -  CalculationC = 1.44 t1/2 DVdTThe total amount (weight) of drug in the body=\tCVdTherefore, the loading dose\tD*\t= CVdD*\t= CVd\t= 1.44 t1/2 DT || SLIDE #: 18",
            "Elimination KineticsFirst Order  Kinetics and  the Rule of 5o 50%o 25%o 12.5%o 6.25%o 3.1% (97%eliminated).\nTwo ways drugs are eliminated – 0 order kinetics or 1st order kinetics0 order kinetics is same amount of drug eliminated over time; 2 mg eliminated of drug per minuteIt is how alcohol is metabolized – you metabolzie same amount of alcohol in same amount of time First order kinetics is wehre you metabolize same proportion of drugs per unit time2% of drug metabolized per minuteThis matters when it comes to dosing - if you had something with first order kinetics it means it drops out of pocket range quicker than 0 order kinetics (which takes longer for it to come down from toxic rnage)Most drugs behave in 1st orderFirst half life – 50% of drug remainingSecond half life – 25% drug left5th – drug essentially eliminated || SLIDE #: 19",
            "Two ways drugs are eliminated – 0 order kinetics or 1st order kinetics0 order kinetics is same amount of drug eliminated over time; 2 mg eliminated of drug per minuteIt is how alcohol is metabolized – you metabolzie same amount of alcohol in same amount of time First order kinetics is wehre you metabolize same proportion of drugs per unit time2% of drug metabolized per minuteThis matters when it comes to dosing - if you had something with first order kinetics it means it drops out of pocket range quicker than 0 order kinetics (which takes longer for it to come down from toxic rnage)Most drugs behave in 1st orderFirst half life – 50% of drug remainingSecond half life – 25% drug left5th – drug essentially eliminatedThe Clinical Need\tfor  TDMCompliance(forgetfulness, etc.)Titration of optimal dosageVariation in drug metabolic rates (genetics, other drugs)Presence of disease (eg. renal, hepatic)Altered physiological states (youth, age, pregnancy)OverdoseIdentification and quantitation.\nChildren’s enzyme system don’t prform same way as adultsPregnancy can cause internal changes to blood volume, binding proteiins in blood etc. To try and identify if someone overdosed or how much of an overdose they have || SLIDE #: 20",
            "Children’s enzyme system don’t prform same way as adultsPregnancy can cause internal changes to blood volume, binding proteiins in blood etc. To try and identify if someone overdosed or how much of an overdose they haveClassical Criteria for Determining  the Necessity for TDM of a DrugNarrow but reasonably well defined  therapeutic rangePoor correlation between dosage and serum  concentrationGood correlation between serum  concentration and therapeutic effectTherapeutic effect which is hard to measureSpecific, accurate, and reproducible  method.\n || SLIDE #: 21",
            "When to sample?At steady-stateTrough-Just before the next dose is given (e.g. one half-life afterthe last dose)When toxicity is suspectedTimed sampling following a doseUsed to estimate AUCEg C2 for ISDRandom (last resort)Overdose (accidental or deliberate)Patient non-compliance (last dose unknown).\nTrough is best time to take it for oral dosingTime to catch peak and troughCurve estimation is exposure individual gets from the drugOnly do random during overdose and maybe used to determine drastic measures you may have to take or when you don’t know when they took the drug || SLIDE #: 22",
            "Trough is best time to take it for oral dosingTime to catch peak and troughCurve estimation is exposure individual gets from the drugOnly do random during overdose and maybe used to determine drastic measures you may have to take or when you don’t know when they took the drugExamples of Trough Measured Drugs (FYI):Core Lab:valproic acid, carbamazepine,  lithium, phenytoin, phenobarbital,  vancomycinSpecialty Lab:\tlamotrigine, gabapentin, topiramate,  clobazam, clonazepam, clozapine, risperidone,  haloperidol, olanzapine, nitrazepam, amiodarone.\nMeasure drug in core and speciality labsDepends on method where the drug measruements goDrugs with servious consequences in core labs because of fast turnaround time e.g. epileptics, antibioticsSpeciality labs because you need selectivity to determine parent/metabolite or if drug you can’t do in core || SLIDE #: 23",
            "Measure drug in core and speciality labsDepends on method where the drug measruements goDrugs with servious consequences in core labs because of fast turnaround time e.g. epileptics, antibioticsSpeciality labs because you need selectivity to determine parent/metabolite or if drug you can’t do in coreFree Drug Monitoring.\nFree drug monitoringIts not just drug and metabolite, but drug, free drug, drug bound to protein, and then metabolite that you have to considerProtein bound drug is normally albumin or positively charged drug, and alphaone/glycoprotein for negatively charged drugIn some cases, measuring free amount is better for concentraiotn/effect than total amount (which is free + protein bound) || SLIDE #: 24",
            "Free drug monitoringIts not just drug and metabolite, but drug, free drug, drug bound to protein, and then metabolite that you have to considerProtein bound drug is normally albumin or positively charged drug, and alphaone/glycoprotein for negatively charged drugIn some cases, measuring free amount is better for concentraiotn/effect than total amount (which is free + protein bound)Criteria for Free Drug MonitoringTDM is necessaryDrug highly (> 70%) bound to plasma proteins  Free drug level correlates poorly with total drugconcentrations.\nAlso when balance of bound to not can be disturbed negatively for e.g. if you take another drug or changing free fatty acids present (depends on the drug) or changing plasma protein concetraions (if someone is becoming malnourished) || SLIDE #: 25",
            "Also when balance of bound to not can be disturbed negatively for e.g. if you take another drug or changing free fatty acids present (depends on the drug) or changing plasma protein concetraions (if someone is becoming malnourished)Free Drug MonitoringCo-administered highly bound drugsElevated free fatty acidsChanges in plasma protein concentration || SLIDE #: 26",
            "Factors affecting Albumin  ConcentrationDecreasedMalnutrition  Renal Disease  MalabsorptionProtein-losing Enteropathy  Hepatic DiseaseBurnsTissue DamageInflammationIncreasedDehydration  Cancer.\nRenal – less protein in blood therefore less binding capacityProtein-losing EnteropathyLosing protein through gut Hepatic DiseaseNot produring proteinsBurns  - disturbances in protein^^ all these things increase free drug and lower albumin (protein) || SLIDE #: 27",
            "Renal – less protein in blood therefore less binding capacityProtein-losing EnteropathyLosing protein through gut Hepatic DiseaseNot produring proteinsBurns  - disturbances in protein^^ all these things increase free drug and lower albumin (protein)Free Drug MonitoringThe anticonvulsant drugs, phenytoin, and valproic  acid historically are the only drugs for which free  drug monitoring has been done routinely..\nFree drug is better for these than total drug There are total drug assays available for these in the core lab quickly; specialized lab does free from bound drug  || SLIDE #: 28",
            "Free drug is better for these than total drug There are total drug assays available for these in the core lab quickly; specialized lab does free from bound drug TDM Case Examples || SLIDE #: 29",
            "Therapeutic Drug Monitoring of  Immunosuppressant Therapy: Balancing  Efficacy and Toxicity || SLIDE #: 30",
            "Transplantation: a treatment for end-stage organ failureKIDNEYLIVERLUNG\tHEARTPANCREASPrimary Cause*:  Diabetes 27.5%Hypertension 25.9%Glomerulonephritis 16.8%Other 18.5%Cystic Kidney 11.2%* adults in the US, 2011Scientific Registry of Transplant RecipientsPrimary Cause*:  DM type I\t85.3%  DM type II\t\t6.1%  Other/unk\t\t 7.8%DM type unk. 0.9%Primary Cause*:HCV\t23.5%Other/unknown 22.3%Malignancy\t20.9%Alcoholic liver\t17.6%Cholestatic\t9.1%Acute hepatic necrosis 4.0%  Metabolic liver disease 2.5%INTESTINEPrimary Cause*:  Other SGS\t58.1%Necrotizing EC 12.4%Other\t12.4%Congen. SGS\t10.9%Pseudo-obstruc 6.2%Primary Cause*:  Cardiomyopathy 54.4%Coronary Artery 37.9%Congenital dis.\t3.6%Other/unknown\t2.7%Valvular disease  1.4%Primary Cause*:  Restrictive lung dis.\t49.1%  Obstructive lung dis. 32.0%CF or immunodef. 14.1%  Pulmonary vasc. dis. 4.4%  Other/unknown\t0.4%.\nYou reject organs due to immune systems T celsl look for markers outside cells that detect foreign things and they try to eliminateIn transplantation, you try to get markers as close to recipient as possibleTherefore you suppress immune sysmte so they don’t recognize transplant organ as foreign and don’t try to get rid of it  || SLIDE #: 31",
            "You reject organs due to immune systems T celsl look for markers outside cells that detect foreign things and they try to eliminateIn transplantation, you try to get markers as close to recipient as possibleTherefore you suppress immune sysmte so they don’t recognize transplant organ as foreign and don’t try to get rid of it Organ Transplantation in OntarioStatistics from Trillium Gift of Life || SLIDE #: 32",
            "Organ Rejection || SLIDE #: 33",
            "Transplant Rejection and  the\tImmune System || SLIDE #: 34",
            "Solution –ImmunosuppressionImmunosuppressants are a class of drugs that suppress or reduce the  strength of the body’s immune system, attempting to stop the  immune system from reacting to the transplanted organ..\nThey all have different mechanisms of action in terms of getting t cell to recognize antigens  || SLIDE #: 35",
            "They all have different mechanisms of action in terms of getting t cell to recognize antigens Mechanism\tof ActionNature Clinical Practice Cardiovascular Medicine (2006) 3, 203-212.\nDon’t need to know pathway but various parts you can block with immunosuppresents || SLIDE #: 36",
            "Don’t need to know pathway but various parts you can block with immunosuppresentsCyclosporine AUsed as a first-line  immunosuppressantRevolutionized field of  organ transplantation,  dramatically reducing  acute rejection ratesCyclic peptide of 11  amino acids from the  fungus Tolypocladium  inflatumInhibits calcineurin  through cyclophilin to  block NFAT-mediated  transcription of IL-2.\nReally big, complex structure || SLIDE #: 37",
            "Really big, complex structureTacrolimus23-membered macrocyclic  lactone from bacterium  Streptomyces tsukubaensisBlocks production of IL-2  (cytokine) and activation of  immune systemCalcineurin inhibitor 100x more  potent than cyclosporineLonger half-life thancyclosporineTrials comparing tacrolimus  and cyclosporine indicated a  reduced risk of acute  rejection with tacrolimusCurrently, predominant first-  line immunosuppressant drug  used, particularly in the US.\nBlocks fat activation as wellThis is now drug of choice for organ transplantation || SLIDE #: 38",
            "Blocks fat activation as wellThis is now drug of choice for organ transplantationSirolimusMacrolide antibiotic  structurally related to  tacrolimusIsolated from a bacteriumdiscovered on Easter IslandBinds FKBP12 and the  complex inhibits mTOR and  blocks signaling  downstream of IL-2Inhibits IL-2-mediated  activation of T and B cellsUsed in place of and in  combination with  cyclosporine and  tacrolimus.\n || SLIDE #: 39",
            "Immunosuppressive Drug  RegimensLow RiskFirst time  transplant  recipient<20% panel  reactive  antibodiesIntermediate  Risk20-80% panel  reactive  antibodiesHigh RiskRejected one  or more  transplants>80% panel  reactive  antibodiesTherapy is based on the transplant recipient’simmunological risk and donor factorsIntensity ofImmunosuppression Therapy.\nDetermine risk of individual for rejectionLow risk you may give them one immunosuppresentIntermediate or poor riskUse more intensive immunotherapy e.g. two drugsMight possible interact with each other || SLIDE #: 40",
            "Determine risk of individual for rejectionLow risk you may give them one immunosuppresentIntermediate or poor riskUse more intensive immunotherapy e.g. two drugsMight possible interact with each otherImmunosuppressive  Drug RegimensType of Organ TransplantPatient age (adults vs. children)Co-medications or patient conditionsInitial therapy versus long-term maintenanceTypical initial and long-term maintenance regimens  use a combination of medications includingcalcineurin inhibitor (tacrolimus or cyclosporine)antiproliferative agent (mycophenolic acid or  azathioprine)with or without corticosteroids.\nHow you choose depends on four 4 points on slideInitial therapy – hit immune system hard at firstLong-term – if you want to sustain it long time  || SLIDE #: 41",
            "How you choose depends on four 4 points on slideInitial therapy – hit immune system hard at firstLong-term – if you want to sustain it long time Balancing Efficacy and  Toxicity••Sub-therapeutic drug levels increase the risk of  acute organ rejectionImmunosuppressive drugs used in organ transplanthave toxicitiesDose dependent nephrotoxicity  Increased risk of infectionKDIGO Clinical Practice Guideline for thecare of kidney transplant recipients 2009.\nBalance which drugs you give for therapy/efficacy and toxicity Concentraions used to make sure you are not at risk for losing organ || SLIDE #: 42",
            "Balance which drugs you give for therapy/efficacy and toxicity Concentraions used to make sure you are not at risk for losing organTherapeutic Ranges for  Immunosuppressant Drugs(trough concentration)DrugTimeKidneyLiverHeart or LungCylcosporine  C0 (C2)(ng/mL)Initiation  Maintenance150-250 (>1200)75-150 (800)250-350 (>1000)100-200 (600)250-350 150- || SLIDE #: 250",
            "Tacrolimus  (ng/mL)Initiation  Maintenance  Minimizatio  n10-155-103-710-205-10-15-205-10-Sirolimus  (ng/mL)Initiation  Maintenance5-15--Everolimus(ng/mL)InitiationMaintenance5-153-8-3-8,3-12Current Trends in Transplantation. 2009.\nHigh level – intiation for the suppressionMaintenace dose is lwoer || SLIDE #: 43",
            "High level – intiation for the suppressionMaintenace dose is lwoerVariable  PharmacokineticsNot One Dose Fits AllWhy do Therapeutic Drug  Monitoring (TDM)?LevyBioDrugs, 2001Inter-patient Variability in Cylosporine  Blood Levels in Renal Transplant Patients.\nSomeone on it  || SLIDE #: 44",
            "Someone on it Drug-Drug\tInteractionsImmunosuppressant  drugs are heavily  metabolized by the  cytochrome P450  systemPotential for drug-drug  interactions that may  produce toxicity or  dangerously low levels  of immunosuppressionLeads to an increasedrisk of acute rejectionGhanta et al., Overview of Immuno-  suppression in Renal Transplantation, 2013.\nSome one on it should be wary of starting new drugs – could produce toxicity or non-effect of immunosuppesent || SLIDE #: 45",
            "Some one on it should be wary of starting new drugs – could produce toxicity or non-effect of immunosuppesentWhen should TDM be done  for Immunosuppressants?KDIGO Clinical Practice Guideline for thecare of kidney transplant recipients 2009.\nRecommendations on how often you should measure these drugs || SLIDE #: 46",
            "Recommendations on how often you should measure these drugsHow are Immunosuppressants  Measured?MethodsImmunoassaysCMIA (chemiluminescent  microparticle  immunoassays) (Abbott)Exhibit cross-reactivity with  drug metabolites that may  falsely raise valuesCompetitive assay designLC-MS/MSAble to distinguish  metabolites from the  parent drugMultiplex Analysis -measuremultiple analytes in one runSample: Whole blood  for cyclosporine,  tacrolimus and sirolimusSite of ActionDistribution in blood:Cyclosporine41-58% RBCs, 33-47%plasmaTacrolimus80% RBCs, 20% plasmaSirolimus95% RBCs, 3% plasma, 2%  other cellular || SLIDE #: 47",
            "SummaryImmunosuppression is necessary to reduce the risk  of transplant rejectionImmunosuppressant Drugs have narrow therapeuticrangesVariable Pharmacokinetics makes dosing  challenging requiring many dose adjustmentsTherapeutic Drug Monitoring for  Immunosuppressants is used to ensure efficacy,  reducing transplant rejection, while avoiding  toxicity || SLIDE #: 48",
            "Therapeutic Drug  Monitoring of Antiepileptic  Drugs || SLIDE #: 49",
            "Epilepsy - OverviewEpilepsy is a central nervous system disorder (neurological  disorder) in which nerve cell activity in the brain becomes  disrupted, causing seizures or periods of unusual behaviour,  sensations and sometimes loss of consciousness.Seizure symptoms can vary widely.From a simply blank stare for a few seconds to repeated twitching of arms or legs.About 1 in 26 people in the United States will develop a  seizure disorder.Nearly 10% of individuals may have a single unprovoked seizure.However, a single seizure doesn't mean you have epilepsy. At least two unprovoked  seizures are generally required for an epilepsy diagnosis.Even mild seizures may require treatment because they can  be dangerous during activities such as driving or swimming.Treatment with medications or surgery is ~80% effectiveChildren with epilepsy may also outgrow their condition withage. || SLIDE #: 50",
            "SymptomsEpilepsy is caused by abnormal activity in brain cellscan affect any process your brain coordinates.Seizure signs and symptoms may include:Temporary confusionA staring spellUncontrollable jerking movements of the arms and legsLoss of consciousness or awarenessPsychic symptomsGenerally classify seizures as either focal or  generalized, based on how the abnormal brain  activity begins. || SLIDE #: 51",
            "Focal SeizuresWhen seizures appear to result from abnormal activity in  just one area of your brain, they're called focal (partial)  seizures.Focal seizures without loss of consciousness (simplepartial seizures).These seizures don't cause a loss of consciousness. They may alter emotions or  change the way things look, smell, feel, taste or sound. They may also result in  involuntary jerking of a body part, such as an arm or leg, and spontaneous  sensory symptoms such as tingling, dizziness and flashing lights.Focal dyscognitive seizures (complex partial seizures).These seizures involve a change or loss of consciousness or awareness. During  a complex partial seizure, you may stare into space and not respond normally  to your environment or perform repetitive movements, such as hand rubbing,  chewing, swallowing or walking in circles.Symptoms may be confused with other neurological  disorders, such as migraine, narcolepsy or mental illness. || SLIDE #: 52",
            "Generalized SeizuresoSeizures that appear to involve all areas of the brain are called  generalized seizures.1.\tAbsence seizures. (previously known as petit mal seizures)often occur in children and are characterized by staring into space or subtle body movementsooooosuch as eye blinking or lip smacking. These seizures may occur in clusters and cause a brief lossof awareness.Tonic seizures.Tonic seizures cause stiffening of your muscles and may cause you to fall to the ground.Atonic seizures.Also known as drop seizures, cause a loss of muscle control, which may cause you to suddenlycollapse or fall down.Clonic seizures.Associated with repeated or rhythmic, jerking muscle movements.Myoclonic seizures.Usually appear as sudden brief jerks or twitches of your arms and legs.Tonic-clonic seizures. (previously known as grand mal seizures,)The most dramatic type of epileptic seizure and can cause an abrupt loss of consciousness,  body stiffening and shaking, and sometimes loss of bladder control or biting your tongue. || SLIDE #: 53",
            "Risk factorsAge.o most common during early childhood and after age 60Family history.Head injuries.Stroke and other vascular diseases.Dementia.Brain infections.Seizures in childhood. || SLIDE #: 54",
            "CausesEpilepsy has no identifiable cause in about half of those  with the condition.Genetic influence.It's estimated that up to 500 genes could be tied to the condition. Certain  genes may make a person more sensitive to environmental conditions that  trigger seizures.Head trauma.Car accident or other traumatic injuryBrain conditions.Brain conditions that cause damage to the brain, such as brain tumours or  strokes,Stroke is a leading cause of epilepsy in adults older than age 35.Infectious diseases.Meningitis, AIDS and viral encephalitisPrenatal injury.Infection in the mother, poor nutrition or oxygen deficiencies.Developmental disorders.Can sometimes be associated with developmental disorders, such as autism  and neurofibromatosis. || SLIDE #: 55",
            "Antiepileptic Drugs  (AED)Antiepileptic Drugs (AEDs)  are used to treat seizure  disordersFirst generation of AEDs  were introduced many  decades agoo\tcarbamazepine, ethosuximide,  phenobarbital, phenytoin and  primidone, and valproic acidIn the last 20 years, there  has been a surge of new  generation AEDs entering  the marketTher Drug Monit 2013;35:4–29) || SLIDE #: 56",
            "Mechanism of Action of  AEDsLimit the sustained, repetitive firing of neurons, an  effect mediated by promoting the inactivated  state of voltage-activated Na+ channels.Enhanced γ-aminobutyric acid (GABA)–mediated  synaptic inhibition, an effect mediated either by a  presynaptic or postsynaptic action.o\tDrugs effective against the most common forms of epileptic seizures,  partial and secondarily generalized tonic-clonic seizures, appear to  work by one of these two mechanisms.Inhibition of voltage-activated Ca2+ channels  responsible for T-type Ca2+ currents.o\tDrugs effective against absence seizures, less common formGoodman and Gilman. 12 Ed || SLIDE #: 57",
            "Mechanism of Action of  AEDsMayo Clin Proc. 2012;87(9):879-889 || SLIDE #: 58",
            "Mechanism of Action of  AEDsMayo Clin Proc. 2012;87(9):879-889 || SLIDE #: 59",
            "Goodman and Gilman. 12 Ed || SLIDE #: 60",
            "AEDs in the Clinical  LaboratoryAEDs are among the most common medications for  which clinical laboratories perform therapeutic drug  monitoring (TDM)TDM quickly became part of clinical practice  becauseAEDs have complicated pharmacokinetics (ADME),narrow therapeutic rangessignificant differences in individual’s therapeutic dosages || SLIDE #: 61",
            "Why do Therapeutic Drug  Monitoring (TDM)?Toxicitydiagnosing toxicityavoiding toxicityDosingafter dose adjustment (usually after reaching a steady state)assessment of adequate loading dose (after starting phenytoin  treatment)help predict a patient's dose requirements1Monitoringassessing compliance (anticonvulsant concentrations in patients having  frequent seizures)diagnosing under treatment (particularly important for prophylacticdrugs such as anticonvulsants, immunosuppressants)diagnosing failed therapy (therapeutic drug monitoring can help  distinguish between ineffective drug treatment, non-compliance and  adverse effects that mimic the underlying disease). || SLIDE #: 62",
            "Which drugs need TDM?Narrow target rangeSignificant  pharmacokinetic  variabilityA reasonable  relationship between  plasma concentrations  and clinical effectsEstablished target  concentration range || SLIDE #: 63",
            "TDM Challenges with  AEDsDiagnosis is very difficult since seizures are  unpredictable and occur irregularlyThere is no simple diagnostic test to assess the  clinical efficacyClinical assessment depends on careful  clinical observation and labour intensive EEGClinical signs and symptoms of toxicity are  subtle or difficult to differentiate form the  disorder || SLIDE #: 64",
            " || SLIDE #: 65",
            " || SLIDE #: 66",
            "Indications for Monitoring Serum  AED concentrations - ILAEAfter initiation of treatment or after dose adjustment,  when the clinician decides to aim at a preselected target  concentration for that patient.Once the desired clinical response has been achieved,  to establish the “individual therapeutic range.”To assist the clinician in determining the magnitude of a  dose increase, particularly with AEDs showing dose-  dependent pharmacokinetics (most notably, phenytoin).When there are uncertainties in the differential diagnosis  of signs or symptoms suggestive of concentration-related  AED toxicity, or when toxicity is difficult to assess clinically  (for example, in young children or in patients with mental  disability).Epilepsia, 49(7):1239–1276, 2008 || SLIDE #: 67",
            "Indications for Monitoring Serum  AED concentrations - ILAEWhen seizures persist despite an apparently  adequate dosage.When an alteration in pharmacokinetics (and,  consequently, dose requirements) is suspected, due to  age-related factors, pregnancy, associated disease,  or drug-drug interactions.To assess potential changes in steady state AED  concentration when a change in drug formulation is  made, including switches involving generic  formulations.Whenever there is an unexpected change inclinical response.When poor compliance is suspected.Epilepsia, 49(7):1239–1276, 2008 || SLIDE #: 68",
            "AEDs in Childreno  oAED PK is markedly influenced by age especially during  infancy and childhoodShorter half-lives, and larger Vd compared with adults  Dosages may be 2-3x higher than adultsReference range information is almost exclusively from  adult studies and there is little information about pediatricsPK interactions cause substantial changes in drug  concentrations. They are likely to occur in children too, but  the extent of the interactions may be differentStudies have demonstrated that different types of seizures  respond to different serum concentrations. Childhood  seizures may be different types versus adult seizuresAEDs may have long term adverse effects on the immaturebrain that do not occur in the mature brainEpilepsia, 49(7):1239–1276, 2008 || SLIDE #: 69",
            "AEDs in PregnancyMaternal serum concentrations not only reflect the  concentrations that determine therapeutic effect and  adverse effects but also the extent of drug exposure to  the fetusPK of many AEDs is affected by many importantchanges during pregnancyBody weightAltered serum compositionHemodynamic alterationsHormonal changesDrug distribution changes due to fetoplacental unitPregnancy-associated PK changes have been  reasonably characterized for the older generation AEDsTDM is recommended during pregnancy at increasedfrequencyEpilepsia, 49(7):1239–1276, 2008 || SLIDE #: 70",
            "AEDs in ElderlyTDM may be particularly helpful in guiding AED  therapy in elderly patients.Greater morbidityPoor medication complianceVariable age-related changes in pharmacodynamics and  pharmacokineticsIncreased likelihood of drug interactions affect the safety and efficacy of  both AEDs and co-medicationsEpilepsia, 49(7):1239–1276, 2008 || SLIDE #: 71",
            "AED Formulation Changes  and Generic SubstitutionWhen an AED formulation is changed, e.g., when  switching to/from generic formulations, measuring the  serum concentration of the AED before and after the  change may help in identifying potential alterations in  steady-state drug concentrations resulting from  differences in bioavailability\tWhen patients are switched to a formulation with  modified-release characteristics (for example, from an  immediate-release to a sustained-release formulations),  or when dosing schedule is changed (for example, from  twice daily to once daily administration), interpretation  of TDM data should also take into account the expected  variation in diurnal drug concentration profileEpilepsia, 49(7):1239–1276, 2008 || SLIDE #: 72",
            "AED Formulation Changes  and Generic Substitution\tA 2006 Survey by the American Academy of  Neurology found that seizures worsened in 59% of  individuals switched from brand-name to generic  AEDsLiow K, Barkley GL, Pollard JR. Position statement on the coverage of anticonvulsant drugs for the  treatment of epilepsy. Neurology. 2007;68(16):1249-1250.Krauss et al studied differences between 595 pairs  of generic AED formulations, estimated AUC varied  by more than 15% for 17% of pairs, and an  estimated Cmax differed by more than 15% for 39%.The AEDs with low bioavailability and solubility, such as oxcarbazepine,  had the greatest variability.Krauss GL, Caffo B, Chang YT, Hendrix CW, Chuang K. Assessing bioequivalence of generic  antiepilepsy drugs. Ann Neurol. 2011;70(2):221-228. || SLIDE #: 73",
            "CarbamazepineFirst line treatment in partial and secondarily generalized  tonic– clonic seizures and primary generalized tonic– clonic  seizuresVoltage gated Na channel modulatorAbsorption is relatively slow, erratic, variable, and formulationdependentUndergoes extensive metabolism with less that 2% of an oral  dose excreted unchanged in the urineMetabolism by primarily cytochrome P450 (CYP) 3A4, to pharmacologically active  carbamazepine-10–11-epoxideInactivated by epoxide hydrolase to 10, 11 - diolMany possible drug interactionsCarbamazepine undergoes autoinduction so that clearance  can increase threefold within several weeks of starting therapyDuring maintenance carbamazepine monotherapy, adults  have half-lives of 8–20 h whereas in children 10–13 years of  age half-lives are 10–14 h || SLIDE #: 74",
            "CarbamazepineSeizure control is most likely to occur between 4 and  12 mg/L (17–51 μ mol/L)There is substantial overlap between  carbamazepine concentrations associated with  seizure control and those associated with toxicityUnpredictable relationship between dose and  carbamazepine concentration, its narrow  therapeutic index, and the presence of numerous  clinically significant drug interactions support the  need to individualize and maintain therapy using  TDM || SLIDE #: 75",
            "LamotrigineVoltage gated Na channel modulator and Ca Channel  blockerRapid and complete absorption form GI tractExtensive metabolism to an inactive glucuronidemetabolite via\tUGT1A4,Autoinduction phenomenon occurs with in 2 weeks,  resulting in 17% reduction in serum concentrationsprone to drug interactionsClearance is higher in children than adultsClearance can be increased up to 300% in pregnancyNo clear-cut relationship exists between clinical response  and serum lamotrigine concentrations; however, toxicity  increases significantly with concentration >15 mg/L ( >58  μmol/L) || SLIDE #: 76",
            "PhenytoinVoltage gated Na channel modulatorComplex pharmacokinetics due to variable absorption,  high protein binding, saturable metabolism, and drug  interactionsExtensive metabolism by CYP2C9 and CYP2C19 to  inactive metaboliteSerum elimination half-life of phenytoin in adults is 30– 100hoursElimination follows nonlinear kineticsMetabolism decreases with increasing dosagesIncreasing dose can lead to disproportionately large increments in serum  concentrationsMany interactions with other medications via metabolismand serum protein binding interactionsReference range of 10–20 mg/L (40–79 μ mol/L)Often Free Drug levels are measured for TDM || SLIDE #: 77",
            "Valproic AcidVoltage gated Na channel modulator and Ca Channel  blockerAlmost 100% bioavailability in all formulationsFood delays absorption but not extentSerum protein binding decreases with increasing  concentrationFree concentration increases in pregnancy, elderly, renal  disease, liver disease and conditions associated with low  albuminOften Free Drug levels are measured for TDMPharmacokinetics deviate from linearity due to changes  in serum protein bindingChildren require higher dosages to achieve comparableplasma levels with adultsUnpredictable relationship between dose and valproic  acid concentration supports the use of TDM || SLIDE #: 78",
            "Matthew D. Krasowski, JUN.1.2013 Clinical Laboratory News || SLIDE #: 79",
            "Conclusion - Why to  measure AEDsEstablish an individual therapeutic concentrationAs an aid in the diagnosis of clinical toxicityTo assess compliance, particularly in patients withuncontrolled seizures or breakthrough seizures;To guide dosage adjustment in situations  associated with increased pharmacokinetic  variability (e.g., children, the elderly, patients with  associated diseases, drug formulation changes);When a potentially important pharmacokinetic  change is anticipated (e.g., in pregnancy, or when  an interacting drug is added or removed);To guide dose adjustments for AEDs with dose-  dependent pharmacokinetics, particularly  phenytoin. || SLIDE #: 80",
            "ConclusionsTDM has been used as a tool to optimize treatment  of epilepsy for almost 50 years.Although solid evidence for its usefulness in  improving clinical outcome is scarce, TDM  continues to play a role in epilepsy management,  partly due to the nature of the condition and partly  because of the pharmacokinetic variability of AEDs.The evidence for a universal drug concentration-  effect interrelationships is less than satisfactory  highlighting the need for an “individual therapeutic  concentration” || SLIDE #: 81",
            "Other Drugs || SLIDE #: 82",
            "DigoxinPurpose: antiarrhythmicTherapeutic range: 1.0 - 2.7 nmol/LDigoxin has a narrow therapeutic rangeToxic symptoms are similar to sub-therapeutic symptoms  (arrhythmia). || SLIDE #: 83",
            "DigoxinThere is marked overlap of serum digoxin levels between  those that are toxic and\tthose that aren’t.At steady state the concentration of digoxin in cardiac tissue is  15-30 times that of serum. || SLIDE #: 84",
            "DigoxinAccumulation of digoxin in tissue lags behind serum  concentrations.While the peak serum concentration is reached 2-3 h after the  oral dose, the peak tissue concentration occurs 6-10 h after an  oral dose. || SLIDE #: 85",
            "DigoxinTherapeutic range is determined at the time of peak tissueconcentration.The appropriate time to collect the specimen is 8 h or more  after the last dose(e.g. bedtime dose, specimen collection in morning) || SLIDE #: 86",
            "DigoxinDigoxin toxicity develops more frequently and lasts longer in  patients with renal impairment.Dosage requirements are decreased in patients with renal  disease. || SLIDE #: 87",
            "AminoglycosidesPurpose:\tiv antibioticsTobramycinGentamicin || SLIDE #: 88",
            "AminoglycosidesPurpose:\tiv antibioticUsed for the treatment of aerobic gram-negative bacterialinfectionsMain objective is the maintenance of drug concentrations highenough to consistently achieve antibacterial activity. || SLIDE #: 89",
            "AminoglycosidesElimination rates vary widely among patients, even those with  normal renal function.Ototoxicity and nephtrotoxicity are associated with both  excessive peak and trough aminoglycoside concentrations. || SLIDE #: 90",
            "AminoglycosidesSusceptibility to toxicity varies widely from one patient to  another.Because both peak and trough concentrations are important,  therapeutic ranges have been established for both of these  parameters. || SLIDE #: 91",
            "AminoglycosidesSampling for trough measurements is done  just before the next dose (pre-dose).Peak (post-dose) serum sampling has to be done after the  distribution phase is completed. || SLIDE #: 92",
            "AminoglycosidesIn most patients, sampling for the peak concentration should be  done 15-30 min after the end of the infusion (post-dose)in renally impaired or morbidly obese patients, sampling should  be done 30-60 min after infusion. || SLIDE #: 93",
            "Thank You || SLIDE #: 94"
        ]
    }
]