
[
	{
		"pptName": "Feb 10 - Intro to Endocrine System",
		"slides": [
			"slide 3: hormones defn: chemical from glands or cells. Autocrine or paracrine",
			"slide 4: neurotransmitters defn: synthesized in pre-synaptic neuron and travel in synapse; does not reach cells via bloodstream",
			"slide 5: neuroendocrine cells defn: nerve cells secrete into bloodstream; hypothalamus to anterior pituitary via portal circulation",
			"slide 6: principle site of endocrine glands: diagram of major glands",
			"slide 7: chart of gland/hormones released/function/type",
			"slide 8: structure of hormones: lipid soluble and water soluble",
			"slide 9: transport of hormones: hydrophilic or hydrophobic carriers",
			"slide 10: transport of hormones: only free parts can bind to receptors – ideally you want to measure the free portion in lab because that’s what corresponds to activity",
			"slide 11: control of endocrine system: simple/negative feedback/positive feedback e.g. LH",
			"slide 12: control of endocrine system: inhibitory control e.g. dopamine and prolactin/endocrine rhythms e.g. cortisol, vitamin D",
			"slide 13: endocrine disorders: over-secretion = loss of negative feedback e.g. ectopic secretion/under-secretion = loss of stimulation e.g. organ failure/disordered metabolic pathway = reduced end product, increased intermediates e.g. congenital hyperplasia",
			"slide 14: ectopic hormones defn: hormones produced by tumours e.g. small cell lung carcinoma produces ACTH which is normally made in pituitary",
			"slide 15: measurements of hormone concentrations: bioassays – time consuming, poor accuracy/precision/rarely used",
			"slide 16: measurements of hormone concentrations: chemical reactions – nonspecific/insensitive/imprecise/not used",
			"slide 17: measurements of hormone concentrations: chromatography – works well for small molecules/LC-MS/MS is method of choice for small analytes",
			"slide 18: measurements of hormone concentrations: immunoassays – automated/accurate/nonspecific/measures concentration not activity/best for large molecules",
			"slide 19: basic components of immunoassays: analyte, antibodies, label/detection system, method to separate bound from free",
			"slide 20: competitive immunoassays: analyte and tracer (labelled hormone) compete for limited amount of antibody. Can be simultaneous or sequential. Signal inversely proportional to analyte concentration",
			"slide 22: competitive immunoassays: examples of mechanisms used to separate bound and free tracer",
			"slide 23: non-competitive (sandwich) immunoassays: uses large amount of antibodies and all analyte will bind. Second antibody (labelled detection) binds to epitope on analyte. Signal is proportional to concentration of the analyte",
			"slide 24: competitive immunoassays vs non-competitive immunoassay chart",
			"slide 25: immunoassay labels: list of labels used",
			"slide 28: tandem mass spectrometry (LC-MS/MS): measures small molecules and metabolites in urine or steroid hormones in blood",
			"slide 29: catecholamines and metabolites: examples measured by mass spec: neural crest tumours (neuroblastoma,  pheochromocytoma,  ganglioneuroma)",
			"slide 30: LC-MS/MS: two stages; one to preselect an ion and second to analyze fragments induced by collision with inert gas",
			"slide 31: LC-MS/MS for catecholamines: diagrams",
			"slide 32: more specificity than immunoassays"
		]
	},
{
		"pptName": "Feb 12 – The Hypothalamic-Pituitary Axis",
		"slides": [
			"slide 3: pineal gland: produces melatonin. Stimulated by darkness and promotes sleep",
			"slide 4: location of the endocrine cells in the brain - diagram",
			"slide 5: pituitary gland – labelled diagram and location in the brain",
			"slide 6: pituitary gland – labelled diagram",
			"slide 7: hypothalamic-pituitary axis",
			"slide 8: hormones of the hypothalamus: chart of name/alternative names/abbreviations/function",
			"slide 9: anterior pituitary hormones: chart of name/alternative names/abbreviations/target organ/effect",
			"slide 10: anterior pituitary hormones: cells that secrete thyroid-stimulating hormone does not also secrete growth hormone ",
			"slide 11: hormones of the pituitary gland: list of the body processes pituitary hormones control ",
			"slide 12: feedback loop: diagram of feedback loop for thyroid hormones",
			"slide 14: surgical approach: diagram of transsphenoidal surgery",
			"slide 15: hormones of the posterior pituitary: oxytocin – made in hypothalamus and stored in posterior pituitary. Stimulates uterine contraction and induces labor. Stimulates milk release during suckling. Not measured in laboratory tests",
			"slide 16: hormones of the posterior pituitary: ADH (anti-diuretic hormone) – made in hypothalamus and stored in posterior pituitary. Increases reabsorption of water by kidneys; translocates aquaporins to plasma membrane and prevents excess loss",
			"slide 17: regulation of ADH levels: dehydration/low blood volume stimulates/high osmolality release. Osmolality detected by osmoreceptors in the hypothalamus. Baroreceptors detect low blood pressure. Urine osmolality increased due to ADH secretion",
			"slide 18: osmolality: serum and urine osmolality measured by osmometry. Osmometers measure freezing point depression which is proportional to concentration of solutes in fluid",
			"slide 19: osmometry: chart of thermodynamics of sample vs temperature",
			"slide 20: diabetes insipidus: can be central (low ADH/high serum osmolality/ low urine osmolality with high urine volume output and thirst) or nephrogenic ( high ADH/ high serum osmolality/low urine osmolality with high urine volume output and thirst)",
			"slide 21: diabetes insipidus: water deprivation test – deprive water and measure urine and serum osmolality; administer ADH and do again to distinguish central from nephrogenic",
			"slide 22: ADH measurement: more common to measure copeptin as surrogate of ADH rather than assays because they are tedious, time consuming and poor precision",
			"slide 23: copeptin: derived from same precursor protein as ADH",
			"slide 24: advantages of measuring copeptin over ADH: more stable, correlates better with osmolality, assays are quick/automated/excellent precision",
			"slide 25a: syndrome of inappropriate ADH (SIADH): overproduction of ADH (high ADH, hyponatremia due to excess water, low serum osmolality, high urine osmolality) ",
			"slide 25b: syndrome of inappropriate ADH (SIADH): caused by head trauma, tumour, or some drugs. Treat underlying cause and restrict fluids"
		]
	},
{
		"pptName": "Feb 14 – The thyroid gland/thyroid function test/disorders of the thyroid",
		"slides": [
			"slide 3: thyroid gland: located below larynx. Gland size increases in areas with iron deficiency",
			"slide 4: hypothalamic-pituitary-thyroid axis: diagram: labelling of T3 and T4 depends on iodine moieties on the tyrosine molecules",
			"slide 5: thyroid stimulating hormone: diagram of structure. Alpha subunit is common for glycoproteins TSH, LH, FSH, hCG. They have unique beta subunits",
			"slide 6: thyroid follicular cells: thyroid gland consists of follicular cells (arranged around a colloid. More abundant and secrete thyroid hormone) and parafollicular (C) cells (secrete calcitonin)",
			"slide 8: thyroid hormones: diagram of synthesis pathway",
			"slide 9: thyroid hormones: binding of TSH to TSHR leads to increased uptake of iodine, increased synthesis of thyroglobulin and thyroperoxidase, increased uptake of colloid by follicular cells, and increased degradation and release of thyroid hormoens from thyroglobulin ",
			"slide 10: thyroid hormones: 80% secreted as T4, only T3 has hormone function, most T3 produced by peripheral deiodination of T4, most T3 and T4 bound to proteins in circulation, free hormone is biologically active",
			"slide 11: control of thyroid hormone production: thyroid dysgenesis causes low T4 and high TSH",
			"slide 12: iodine intake and thyroid function: insufficient dietary iodine causes low T4, high TSH, and goitre (hypertrophy)",
			"slide 14: biological actions of thyroid hormones: T3 binds to nuclear receptors. List of principles effects",
			"slide 15: causes of hyperthyroidism (thyrotoxicosis) and lab tests: primary – Graves disease: autoantibodies against TSH receptor bind and stimulate TSH receptors. Low TSH and high FT4 and FT3. Secondary – pituitary adenoma that excessively secretes TSH. High TSH, FT4, and FT3",
			"slide 16: clinical features/symptoms of hyperthyroidism: nervousness, irritability, bulging eyes, menstrual irregularities, warm/moist palms, increased sweating/heat intolerance, hoarseness/deep voice, persistent sore or dry throat, difficulty swallowing, goitre, irregular or rapid heartbeat, infertility, difficulty sleeping, frequent bowel movements, weight loss, diabetes",
			"slide 17: treatment of hyperthyroidism: list",
			"slide 18a: causes of hypothyroidism and lab tests: primary – insufficient iodine, drug or surgery induced thyroidal hypofunction, hashimoto’s thyroiditis (autoimmune destruction of thyroid; antibody is usually against TPO or Tg). Low FT4 and FT3, high TSH",
			"slide 18b: causes of hypothyroidism and lab tests: secondary – pituitary insufficiency due to malignancy, ischemia, head trauma. Low FT4, FT3, and TSH",
			"slide 18c: causes of hypothyroidism and lab tests: tertiary – hypothalamic dysfunction. Low FT4, FT3, TSH",
			"slide 19: clinical features/symptoms of hypothyroidism: thinning hair/hair loss, puffy face, dry and coarse skin, cool extremities, enlarged thyroid (goitre), slow heartbeat, poor appetite, infertility, heavy menstruation, carpal tunnel syndrome, weight gain, poor memory, intolerance to the cold, feeling of tiredness",
			"slide 20: treatment of hypothyroidism: list",
			"slide 21: TSH test: primary screening test. Most sensitive indicator of thyroid hormone activity (log-linear relationship between T4 and TSH; inverse relationship is primary disorder, not inverse is secondary)",
			"slide 22: thyroid function tests: measurement of free T4 needed to differentiate between hyper and hypo- and between primary and secondary. T4 reliably predicts T3 and has longer half-life (T3 more susceptible to short term variations)",
			"slide 23: measurement of FT4 and FT3: small therefore competitive immunoassay and measure free (active) portion",
			"slide 24: lab investigation of thyroid disease: TRH test – differentiate between secondary and tertiary. Thyroid binding immunoglobin (TSI or TBII) – May bind to TSH receptor and stimulate the thyroid gland  as if TSH (TSI, causing hyperthyroidism) or block it from  binding TSH (TBII, causing hypothyroidism). Anti-Tg, Anti-TPO – for hashimoto’s thyroiditis (primary hypothyroidism) ",
			"slide 25: lab investigation of thyroid disease: thyroglobulin – follicular cell thyroid cancers produce high levels of Tg. Tg monitored in patients and indicates recurrence. Calcitonin – tumor marker for C-cell carcinoma of thyroid gland",
			"slide 26: algorithm for initial assessment of thyroid function",
			"slide 27: parathyroid glands: secrete parathyroid hormone (PTH) which regulates calcium levels",
			"slide 28: parathyroid hormone: low concentration of calcium causes release of PTH which goes to bone (efflux of calcium from bone), kidneys (decreased loss of calcium in urine and stimulation of enzyme to make vitamin d), and intestine (vitamin d causes enhanced absorption of calcium at intestines)",
			"slide 29: parathyroid hormone: Intact PTH sandwich/non-comp. assays will recognize amino acids 1-84 (active) as well as 7-84 (inactive). One recognizes N and the other the C terminal. Newer assays detect 1-84"
		]
	},
{
		"pptName": "Feb 24 – Adrenal Cortex",
		"slides": [
			"slide 3: functional anatomy of adrenal gland: cortex divided into three zones – glomerulosa makes aldosterone, fasiculata makes cortisol, reticularis makes androgens",
			"slide 4: functional anatomy of the adrenal gland: diagram",
			"slide 5: steroid hormones: cortisol – controlled by pituitary via ACTH, aldosterone – controlled through RAAS, androgens – controlled by pituitary ACTH",
			"slide 6: biosynthesis of hormones of the adrenal cortex (adrenal steroids): pathway shown, DHEA-S is measured in lab",
			"slide 7: hypothalamic-pituitary-adrenal axis: diagram, stress such as physical, emotional, hypoglycemia, cold exposure and pain stimulate CRH",
			"slide 8: metabolic actions of cortisol: list – gluconeogenesis, deposition of fat, anti-inflammatory, increase sodium reabsorption and potassium excretion",
			"slide 9: metabolic actions of aldosterone: sodium reabsorption and potassium excretion at DCT and collecting duct, more potent than cortisol",
			"slide 10: Renin-Angiotensin-Aldosterone System (RAAS): Pathway diagram",
			"slide 11: adrenal androgens: DHEA and androstenedione in females, and testosterone and DHT in males",
			"slide 12: cushing’s syndrome: excessive production of cortisol by adrenal gland; caused by tumor, adrenal hyperplasia, or ectopic ACTH production by tumor. If the cause is due to a pituitary overproduction  of ACTH by a pituitary adenoma, the clinical  picture is the same, but condition now called  Cushing’s Disease",
			"slide 13: cushing’s syndrome: diagram of causes",
			"slide 14: cushing’s syndrome symptoms: central obesity/thin extremities, buffalo hump, moon facies, increase sweating, thinning of skin, bruising,stretch marks, irritability/depression, osteoporosis, insulin resistance/diabetes mellitus, hypertension, immune suppression, menstrual disorders, male pattern hair growth, baldness, hypercholestermia",
			"slide 15: diurnal variation in cortisol level: high in morning and low at midnight, someone with cushings loses diurnal variation (more constant elevation)",
			"slide 16: laboratory diagnosis of cushings syndrome/disease: Measurement of serum cortisol reflects total cortisol and  is subject to diurnal variation. Measurement of cortisol in a 24-hour urine specimen  reflects free (active) cortisol and collection over a 24-hour period helps to normalize for effects of diurnal  variation. Salivary cortisol also reflects free cortisol; usually collected around midnight",
			"slide 18: laboratory diagnosis of cushings syndrome/disease: ACTH measured to differentiate primary and secondary; Dexamethasone suppression test – low dose will suppress cortisol in normal individuals, high dose will suppress high cortisol levels due to pituitary adenoma ectopic ACTH-producing tumors will not be supressed",
			"slide 19: laboratory diagnosis of cushings syndrome/disease: flowchart/diagram",
			"slide 20: petrosal vein sampling: if ACTH increases in petrosal vein relative to peripheral blood upon CRH stimulation then pituitary adenoma. If not, then ectopic ACTH production",
			"slide 21a: adrenal insufficiency (addison’s disease): primary – often autoimmune disease against adnreal gland or adrenal dysgenesis, impaired steroidgenesis, corticosteroid withdrawal. All types result in low cortisol but primary can result in low aldosterone",
			"slide 21b: adrenal insufficiency (addison’s disease): secondary – low ACTH due to pituitary insufficiency. Tertiary – insufficient CRH production by hypothalamus. All types result in low cortisol but primary can result in low aldosterone",
			"slide 22: primary adrenal insufficiency (addison’s disease): low cortisol, high ACTH. Low cortisol leads to hypoglycemia. Low cortisol and aldosterone to low sodium and high potassium. Low aldosterone can also lead to metabolic acidosis which leads to hypercalcemia. Lab diagnosis involves measurement of cortisol, ACTH, sodium, potassium and sometimes antibodies against adrenal gland",
			"slide 23: adrenal insufficiency (addison’s disease): ACTH is small polypeptide fragmented from large molecule containing melanocyte stimulating hormone so increase in ACTH production can increase pigmentation",
			"slide 24: hyperaldosteronism: primary (Conn’s syndrome) – tumor in adrenal cortex producing aldosterone. Results in high sodium, low potassium, high serum and urinary aldosterone, and low levels of plasma renin. Secondary – e.g. renin-secreting tumor",
			"slide 25: congenital adrenal hyperplasia: diagram of pathway. Most commonly it is 21-hydroxylase that is affected resulting in accumulation of 17-OH-progesterone. Eventually results in excess synthesis of adrenal androgens",
			"slide 27: congenital adrenal hyperplasia: laboratory diagnosis – high levels of 17-OH progesterone. Treatment – replacement of glucocorticoids and mineralcorticoids" 
		]
	},
{
		"pptName": "Feb 28 – Adrenal Medulla and Hormonal Control of Growth",
		"slides": [
			"slide 3: adrenal medulla: central portion of adrenal gland. Effects of catecholamines list",
			"slide 4: pheochromocytoma: catecholamine-producing tumours. Symptoms: tachycardia/palpitations, hypertension, headaches, sweating, anxiety, hyperglycemia, weight loss. The diagnosis is based on measuring the catecholamines  (or usually their metabolites (metanephrines)) in urine or  plasma",
			"slide 5: catecholamines and metabolites: metanephrinesis is only produced in adrenal medulla therefore best to measure it rather than catecholamines",
			"slide 7: human growth hormone: secreted by anterior pituitary in pulsatile manner under GHRH. Inhibited by hypothalamic stomatostatin. Carried in plasma in free form and bound to GH binding protein. Major action sites are bone and liver. Most action is mediated through another hormone, like IGF-1",
			"slide 8: growth hormone and IGF-1 regulation: diagram of pathway and stimualation",
			"slide 9: IGF-1: liver is major source of IGF-1 but other cells that contain GH receptors also produce it. 98% in plasma is protein bound to IGFBP3. Acts in autocrine or paracrine fashion",
			"slide 10: actions of growth hormone: list",
			"slide 11: glucose regulation: hormones that decrease blood glucose – insulin. Increase blood glucose – cortisol, catecholamines, growth hormone, glucagon",
			"slide 12: glucose regulation: low blood glucose stimulates growth hormone (GH) secretion. High blood glucoses suppresses growth hormone secretion",
			"slide 13: assessing growth hormone pathway: occurs in pulses throughout day and especially night. Measurement of IGF-1 more helpful. Stimulation and suppression tests also used",
			"slide 14: growth hormone deficiency: in adults, reduced bone and muscle mass, increased body fat, and impaired brain function. In child, pituitary dwarfism (classical dwarfism)",
			"slide 16: laron dwarfism: mutation in GH receptors. Can’t respond to GH and IGF01 levels are low",
			"slide 18: possible causes of short stature: list",
			"slide 19: investigation of short stature: list of causes",
			"slide 20: investigation of GH deficiency: stimuli used to increase GH secretion – insulin, exercise, glucagon (causes insulin release), arginine (suppress somatostatin). Blood drawn before and after stimulus and GH measured and glucose (if stimulus is insulin)",
			"slide 21: growth hormone excess: GH excess leads to – gigantism in children and acromegaly in adults. Diagnosis is based on lack of suppression of GH level after glucose supplementation",
			"slide 23: acromegaly: enlargement of soft tissue such as hands, feet, nose, lips, ears, heart, kidneys, vocal cords. Brow and jaw protrusion"
		]
	},
{
		"pptName": "Mar 2 – Reproductive Endocrinology",
		"slides": [
			"slide 3: puberty in males",
			"slide 4: hypothalamic-pituitary-gonadal axis in males: GnRH stimulates LH and FSH by anterior pituitary. LH promotes synthesis of testosterone by Leydig cells. FSH stimulates spermatogenesis by Sertoli cells which also produces inhibin which has negative feedback inhibition (as does testosterone)",
			"slide 5: adrenal androgens: Androstenedione and DHEA (DHEAS) are androgens made in the adrenal cortex in both males and females. Adrenal androgens are relatively weak as androgens when compared to testosterone and DHT",
			"slide 6: gonal androgens in males: Androstenedione and DHEA from the adrenal gland act as precursors for testosterone synthesis by the testes. Most testosterone in circulation is bound to sex-hormone binding globulin (SHBG). Testosterone is converted to dihydrotestosterone (DHT) by 5α-reductase in target tissues. DHT is a more potent androgen than testosterone",
			"slide 7: androgen resistance: genetic disorder due to lack of the testosterone receptor or deficiency of 5α-reductase. The genetic deficiency results in a patient with a high testosterone level and a low level of DHT. In males, can result in ambiguous genitalia at birth, failure to undergo puberty, infertility. Degree of symptoms depends on degree of defect",
			"slide 8a: hypogonadism in males: primary - Kleinfelter’s syndrome (47XXY), Testicular agenesis, Mumps (orchitis), Varicocele, Radiation/chemotherapy. Low testosterone, high LH/FSH",
			"slide 8b: hypogonadism in males: secondary - Isolated gonadotropin deficiency. Pituitary damage (panhypopituitarism). Tumours in the pituitary (e.g. prolactinoma). Low LH/FSH, low testosterone. Tertiary – kallmann syndrome (x-linked abnormality in GnRH production. Low LH/FSH, low testosterone)",
			"slide 9: hypogonadism in males: symptoms include delayed puberty, infertility. Treat underlying cause. Other treatments are testosterone, LH, FSH, GnRH",
			"slide 10: puberty in females: increased adrenal androgen and pulsatile GnRH production",
			"slide 11: hypothalamic-pituitary-gonadal axis in females: FSH promotes ovarian follicle development which eventually results in estrogen and progesterone production by corpus luteum after ovulation. LH promotes ovulation",
			"slide 12: esterdiol and progesterone: functions",
			"slide 13: menstrual cycle: follicular phase - levels of LH and FSH have been suppressed by the previously high estradiol levels, but gradually they start to increase, which results in follicular development via FSH and estradiol production via LH. Ovulation -estradiol concentration increases above a threshold where it actually stimulates an increase in LH levels, which induces  ovulation",
			"slide 14: menstrual cycle: luteal phase – corpus luteum produces progesterone and esterdiol, which thicken uterine lining and prepare for implantation. If fertilization does not occur, uterine lining sheds",
			"slide 15: ovulation, fertilization and implantation: diagram of beginning of fertilization",
			"slide 16: menstrual cycle with implantation: diagram of cycle",
			"slide 17: hormonal changes with pregnancy: hCG produced by trophoblastic cells of embryo. hCG maintains corpus luteum which keeps endometrium until placenta is developed enough to take over producing esterdiol and progesterone",
			"slide 18: hCG levels during pregnancy: detected as early as 6 days after conception. Pregnancy is considered to start on day 1 of last menstrual cycle, conception occurs 2 weeks so pregnancy 3-4 weeks along by time hCG is measured. Once placenta is developed and functional, hCG levels decline but remain elevated",
			"slide 19: hypogonadism: primary – turners syndrome, radiation/chemotherapy. Low esterdiol, high LH/FSH. Secondary – isolated gonadotropin deficiency, pituitary damage panhypopituitarism, tumors in pituitary. Low LH/FSH, low esterdiol. Tertiary – kallmann syndrome. Low LH/FSH, low esterdiol",
			"slide 20: hypogonadism in females: symptoms are delayed puberty, infertility, menstrual irregularities. Treat underlying cause, may include estrogen, progesterone, LH, FSH, GnRH",
			"slide 21: ectopic pregnancy: symptoms are abdominal pain, bleeding as embryo grows and puts pressure on fallopian tubes and other structures",
			"slide 22: ectopic pregnancy: hCG measurement and ultrasound used to check for it. normal doubling time for hCG is 2 days, ectopic pregnancy there is less than 66% rise in hCG in 48 hours (longer doubling time)",
			"slide 23: ectopic pregnancy: surgery if imminent risk of rupture or methotrexate",
			"slide 26: hCG has tumor marker: hCG may be increased in molar pregnancy (defective embryo), placental tumor (choriocarcinoma), non-seminiferous testicular cancer",
			"slide 27: hCG has tumor marker: pregnancy - hyperglycosylated hCG and free beta more common in early pregnancy; mostly intact hCG from 2nd trimester on. Trophoblastic and germ cell tumors mostly make intact hCG. Non-trophoblastic tumors (e.g. biliary, pancreatic, balder) make only free beta"
		]
	},

{
		"pptName": "Mar 11 – Glucose and Diabetes",
		"slides": [
			"slide 3: insulin: protein hormone produced and stored in beta cells of pancreas. Secreted in response to high blood glucose. Binding to insulin receptors causes translocation of GLUT4 to cell surface allowing for glucose uptake by adipose and striated muscle cells",
			"slide 4: hormones that increase blood glucose level in hypoglycemia: list",
			"slide 5: diabetes: classic symptoms – polyuria (high urine volume), polydipsia (excessive thirst), unexplained weight loss",
			"slide 6: type 1 diabetes mellitus: primarily result of pancreatic beta cell destruction due to immune-mediated process. Occurs due to absolute deficiency of insulin",
			"slide 7: treatment of type 1 diabetes: insulin administration",
			"slide 8: pancreas and islet transplantation: can result in prolonged insulin independence. Islet transplant result in transient insulin independence and reliably stabilize blood glucose",
			"slide 9: diabetic ketoacidosis (DKA): high blood glucose (hyperglycemia) due to non functioning insulin and gluconeogenesis/glycogenlysis. Fatty acids will be oxidized to ketones to fuel brain and heart so ketone levels will be high. Ketones are acidic and can causes metabolic acidosis. Symptoms are polyuria (high urine volume), dehydration, thirst, hyperventilation, acetone breath, vomiting, confusion, coma, death if not treated",
			"slide 10: DKA: occur in people who don’t realize they have diabetes or people not taking sufficient insulin. Most common in type 1 diabetics. Blood glucose and beta-hydroxybutyrate are most help tests. Treatment is insulin",
			"slide 11: ketones",
			"slide 12: DKA: potassium leaks out of cells due to impaired ATP production and some is excreted due to polyuria. As insulin is given, fuels Na/K ATPase and can cause K levels to drop to dangerous levels",
			"slide 13: type 2 diabetes mellitus: insulin resistance when reserve capacity to store fat reduced, signalling changes, and levels of free fatty acids in circulation increases. Initially greater insulin production due to reduced response but then progresses to type II when pancreas can’t produce enough insulin to keep blood glucose at normal level. More a condition of relative insulin deficiency than absolute",
			"slide 14: treatment of type 2 diabetes",
			"slide 15: metabolic syndrome: diagnosis requires 3 of the following – abdominal obesity, hypertension, elevated fasting blood glucose, hyperlipidemia, low HDL",
			"slide 16: long term complications of diabetes (Type 1 and 2): increased glycation reactions which leads to microvascular and macrovascular complications",
			"slide 17: methods of measuring glucose: hexokinase – photometric, glucose oxidase – photometric linked with peroxidase, oxygen selective electrode, glucose dehydrogenase – photometric ",
			"slide 18: hexokinase",
			"slide 19: glucose oxidase",
			"slide 20: glucose dehydrogenase",
			"slide 21: glucose stability (collection): separate from cells after collection if you intend to measure it. Additive NaF can inhibit glycolysis by inhibiting enolase. Only useful if samples takes more than one hour to be analyzed because enolase is late in pathway",
			"slide 22: diagnosis of diabetes: chart",
			"slide 23: glucose tolerance test: graph/chart: diabetic has higher levels",
			"slide 24 + 25: hemoglobin A1c (HBA1c): gives insight into average blood glucose over 2-3 months, procedure available to measure, factors increasing, factors decreasing",
			"slide 26: diagnosis of diabetes: advantages and disadvantages of parameters ",
			"slide 27: glucometers: based on glucose oxidase or dehydrogenase. Measures glucose in whole capillary blood (lab instruments measures in venous blood). Sometimes used in POCT",
			"slide 28: should be compared to lab instruments annually. Do not have same precision at low glucose levels as lab instruments.",
			"slide 29: fructosamine: glycated albumin, since it has shorter half life than Hb, it gives indication of glucose control over the past 4 weeks. Test used in place of HbA1c in people with contraindications for HbA1c testing or when there is interest in determining blood glucose control over shorter window of time. Not validated for diagnosis of diabetes", 
			"slide 30: fructosamine: reduced NBT in alkaline solution to purple dye",
			"slide 31: glucose in urine: urine dipstick test to detect glucose in ruine. Test can suggest presence of diabetes but not validated for diagnosis",
			"slide 32: insulin: diagram of forms (preproinsulin to proinsulin to insulin to C-peptide)",
			"slide 33: insulin: measured by immunoassay. C-peptide is only produced endogenously and not found in injected forms, measurements of it help distinguish endogenous production from exogenous insulin (e.g. Munchausen syndrome vs insulinoma). C-peptide can also be measured in diabetics treated with insulin to see how much endogenous insulin is being produced" 
		]
    }
]


 
